{
  "vperCycle": "The VPER cycle is the core rhythm of Intentional Life Design. Four phases repeat fractally from day to year: VISION (Fire) ignites purpose and direction; PLANNING (Air) channels energy into max 3 goals per period; EXECUTION (Earth) grounds intention into reality through consistent action; REVIEW (Water) integrates experience into wisdom, always starting with wins. ALIGNMENT (Ether) is the fifth element weaving all four into coherence. The Review Sequence follows: Celebrate, Recognize, Enhance, Reflect, Redirect, Energize. Always review before planning — the Gain mindset grounds planning in evidence of capability.",
  "gapToGain": "The foundational mindset of the system. The Gap measures against ideals (always moving, never enough). The Gain measures against your past self (fixed, always growing). Same reality, different experience. ALWAYS start reviews with wins — this is non-negotiable. 'Failures' are reframed as data and learning. Healthy detachment from outcomes keeps you in the Gain. Applied at every scale: daily gratitude, weekly wins, monthly celebration, quarterly recognition, annual deep reflection. Water element holds memory — intentional review means choosing what memory you carry forward.",
  "extremePrioritization": "If someone has more than 3 priorities, they have none. Maximum 3 Clear Goals per period at every time scale (year, quarter, month, week). Goals connect upward to vision and downward to executable actions. Think big, hold lightly: encourage ambitious goals AND healthy detachment from outcomes. Clear Goals are the concrete steps that make High Hard Goals achievable — the detailed roadmap breaking ambitious HHGs into manageable, focused tasks.",
  "quantumSpaceTime": "Life is organized across three dimensions: QUANTUM (Essence) holds atemporal truths — vision, self-knowledge, personal context. SPACE (Structure) holds what matters now — 12 life areas, active projects, topics of interest. TIME (Flow) provides the rhythm — nested cycles (Year > Quarter > Month > Week > Day), plans, reviews, and wins. All three dimensions ground into MANIFEST (Reality). Quantum without Space and Time is unrealized dream. Space without Quantum and Time is soulless organization. Time without Quantum and Space is meaningless calendar."
}
