{
  "identity": "Creator, mystic, and technologist. Felipe 'Fis' Fraga — MSc Computer Science, Official Tana Ambassador, bridge-builder between ancient wisdom and modern AI. Core values: Truth, Love, Creation, Integration, Freedom. Currently in entrepreneurial building phase, leveraging AI acceleration to bring the Intentional Life OS and Cosmic Blueprint vision to reality.",
  "energyPatterns": "Creative ideation peaks while walking in nature (voice-recording insights during hikes). Productive weeks alternate between high-output desk sessions and high-structuring ideation weeks. Evenings good for reflection and reviews. Energy sources: nature walks, family time, beach football (futevolei), sun exposure. Structuring weeks often precede acceleration periods.",
  "lifeStory": "7+ years spiritual journey beginning 2018. MSc Computer Science 2022 (thesis: AI + Knowledge Management). Tana Ambassador 2023. Published academic paper on Tana in Springer Nature 2024. Current chapter: 'The Ready Builder' — years of exploration converging into efficient creation capability through Claude Code + Tana MCP. The comparison trap is behind him; measuring only against past self (Gap to Gain).",
  "nonNegotiables": "Daily nature time and sun exposure. Beach football (futevolei) when in Rio. Building phase priority: entrepreneurial progress takes precedence. Based in Rio de Janeiro (America/Sao_Paulo timezone). Regular visits to mother in Petropolis (mountain town).",
  "businessContext": "Brand: Cosmic Tech Wisdom (fisfraga.com). Flagship: Intentional Life OS ($222/$144). Products: ILOS Tana Template + Claude Code Template, Tana Voice Note Agent, Tana Commands Course. In development: Cosmic Blueprint Copilot, Astrology/HD/Gene Keys Wisdom Bases. Tech stack: React 18 + TypeScript + Vite + Tailwind. Claude Code is the connector making bidirectional AI access to the life system executable.",
  "spiritualBackground": "100+ books across spirituality and consciousness. 5+ years daily practice (meditation, fasting, energy work). Formal training: Gene Keys (Richard Rudd), AMP Coaching (Benjamin Hardy), Language of Light (Robert Edward Grant), Alchemy and Alchemical Astrology (Stefano Gradi), Guardian Alliance (Adam Apollo). Deep expertise in Human Design, Astrology, Gene Keys, Numerology, Chakras, Sacred Geometry. Unique positioning: MSc Computer Science + 7+ years spiritual practice."
}
