[
  {
    "id": "conjunction",
    "type": "aspect",
    "name": "Conjunction",
    "symbol": "☌",
    "angle": 0,
    "orbRange": "6-10°",
    "nature": "Neutral",
    "keyword": "Act as One",
    "elementalPattern": "Any signs - Usually same sign",
    "image": "https://firebasestorage.googleapis.com/v0/b/tagr-prod.appspot.com/o/notespace%2Ffis%40fisfraga.com%2Fuploads%2FoRaS9Q4jnfkS.png?alt=media&token=ec87fe33-a5d1-41f5-96f7-178e5b9736ef",
    "explanation": "The Sacred Union of Planetary Consciousness. When two planets occupy the same celestial space, their energies merge into a single concentrated force. This is the cosmic marriage where distinct archetypal energies blend their essence, creating something entirely new. The conjunction represents pure potential - neither harmonious nor challenging, but intensely unified. It asks 'How do these energies dance as one?'",
    "impact": "Creates intense focus and concentration of energy in one life area. Can feel overwhelming if planets conflict, or powerfully supportive if planets harmonize. Often manifests as a strong drive or compulsion in the themes represented by the planets involved.",
    "integrationPractice": "Recognize both planets as facets of a single gem. Practice expressing both energies simultaneously rather than alternating between them. Find the synthesis that honors the full spectrum of this unified force."
  },
  {
    "id": "sextile",
    "type": "aspect",
    "name": "Sextile",
    "symbol": "⚹",
    "angle": 60,
    "orbRange": "3-6°",
    "nature": "Harmonious",
    "keyword": "Comfortable",
    "elementalPattern": "Complementary elements (Water + Earth OR Fire + Air)",
    "image": "https://firebasestorage.googleapis.com/v0/b/tagr-prod.appspot.com/o/notespace%2Ffis%40fisfraga.com%2Fuploads%2Fdq_8IsAWqssr.png?alt=media&token=ef4e5718-593b-43aa-87aa-485f49f37cd7",
    "explanation": "The Dance of Creative Opportunity. This sacred geometry creates a flowing conversation between planets, like old friends sharing wisdom across complementary elements. The sextile offers gentle support and natural talent, providing opportunities that unfold through conscious participation. It whispers 'Here is a gift - will you unwrap it through action?'",
    "impact": "Creates opportunities for growth that require conscious participation to activate. Brings supportive energy for learning and skill development. Often manifests as helpful people, resources, or circumstances that aid planetary expression.",
    "integrationPractice": "Actively engage with the opportunities this aspect provides. Practice consciously combining these planetary energies in daily life. Look for situations where both planets can express their gifts together."
  },
  {
    "id": "square",
    "type": "aspect",
    "name": "Square",
    "symbol": "□",
    "angle": 90,
    "orbRange": "6-8°",
    "nature": "Challenging",
    "keyword": "Tension",
    "elementalPattern": "Same modality (Cardinal, Fixed, or Mutable)",
    "image": "https://firebasestorage.googleapis.com/v0/b/tagr-prod.appspot.com/o/notespace%2Ffis%40fisfraga.com%2Fuploads%2FHG7FJiIzUi84.png?alt=media&token=e3d77f8d-e8a4-43ea-9606-b8ef9f846729",
    "explanation": "The Sacred Friction of Growth. This powerful geometry creates tension that demands action, like opposing forces that generate the friction needed for transformation. The square presents challenges that forge strength, pushing consciousness to find new solutions and break through limitations. It declares 'Growth requires effort - what new capacity will you develop?'",
    "impact": "Creates internal friction and external challenges that force growth and development. Often manifests as recurring obstacles that must be overcome through conscious effort and skill development. Builds strength through resistance.",
    "integrationPractice": "Embrace the creative tension rather than avoiding it. Find the higher synthesis that honors both planetary needs. Use the friction as fuel for breakthrough and conscious evolution."
  },
  {
    "id": "trine",
    "type": "aspect",
    "name": "Trine",
    "symbol": "△",
    "angle": 120,
    "orbRange": "6-8°",
    "nature": "Harmonious",
    "keyword": "Effortless",
    "elementalPattern": "Usually same element (Fire, Earth, Air, or Water)",
    "image": "https://firebasestorage.googleapis.com/v0/b/tagr-prod.appspot.com/o/notespace%2Ffis%40fisfraga.com%2Fuploads%2FPT6N0CMrlI9T.png?alt=media&token=2bdb29bd-7720-4f00-b0e2-d1906c8d512c",
    "explanation": "The Sacred Flow of Natural Grace. This divine geometry creates effortless harmony between planets within the same element, like a river flowing toward the sea. The trine represents natural talent, inherited gifts, and areas where consciousness flows with ease. It sings 'Here you are naturally gifted - how will you share this grace?'",
    "impact": "Brings natural ease and talent in combining these planetary energies. Can lead to complacency if gifts are taken for granted. Often represents areas of life that feel effortless and where success comes naturally.",
    "integrationPractice": "Cultivate gratitude for these natural gifts while avoiding complacency. Use these talents in service of growth and contribution. Share your natural abilities to uplift others."
  },
  {
    "id": "opposition",
    "type": "aspect",
    "name": "Opposition",
    "symbol": "☍",
    "angle": 180,
    "orbRange": "6-10°",
    "nature": "Challenging",
    "keyword": "Dialogue",
    "elementalPattern": "Opposite signs across the zodiac wheel, Complementary elements (Water + Earth OR Fire + Air)",
    "image": "https://firebasestorage.googleapis.com/v0/b/tagr-prod.appspot.com/o/notespace%2Ffis%40fisfraga.com%2Fuploads%2F07V8kniro0jl.png?alt=media&token=b93fecfc-9121-468d-b46b-c1322897ddf6",
    "explanation": "The Sacred Balance of Cosmic Polarities. This powerful geometry places planets in direct dialogue across the wheel, like two beings facing each other in deep conversation. The opposition creates awareness through contrast, teaching integration of seemingly opposite forces. It asks 'How do you find the center point between these two truths?'",
    "impact": "Creates push-pull dynamics and internal tension that demands conscious integration. Often manifests in relationships as projection of one planet onto others. Requires finding balance between competing needs and learning to hold paradox.",
    "integrationPractice": "Seek the higher synthesis that includes both planetary perspectives. Practice conscious oscillation between both energies. Find the wisdom that emerges from honoring both poles."
  },
  {
    "id": "quincunx",
    "type": "aspect",
    "name": "Quincunx (Inconjunct)",
    "symbol": "⚻",
    "angle": 150,
    "orbRange": "2-3°",
    "nature": "Challenging",
    "keyword": "Adjustment",
    "elementalPattern": "Mixed elements and modalities",
    "explanation": "The Sacred Mystery of Cosmic Adjustment. This subtle geometry creates a relationship between planets that don't naturally understand each other, like different languages seeking translation. The quincunx requires constant fine-tuning and conscious adjustment, often carrying karmic lessons from other lifetimes. It whispers 'Integration requires patience and continuous recalibration.'",
    "impact": "Creates areas of imbalance requiring ongoing adjustment and compromise. Often manifests as confusion between planetary energies, need for constant recalibration, or sense that something never quite fits together perfectly. Represents karmic patterns requiring conscious evolution.",
    "integrationPractice": "Practice patient adjustment without forcing resolution. Allow the mystery to unfold gradually. Look for the subtle wisdom that emerges from this ongoing cosmic conversation."
  },
  {
    "id": "semi-sextile",
    "type": "aspect",
    "name": "Semi-Sextile",
    "symbol": "⚺",
    "angle": 30,
    "orbRange": "1-2°",
    "nature": "Harmonious",
    "keyword": "Nudge",
    "elementalPattern": "Adjacent signs (consecutive zodiac signs)",
    "explanation": "The Gentle Whisper of Cosmic Encouragement. This delicate geometry creates a soft bridge between adjacent signs, offering subtle support and gentle growth opportunities. The semi-sextile provides quiet assistance that often goes unnoticed until consciously acknowledged. It murmurs 'Small steps lead to great journeys.'",
    "impact": "Creates subtle opportunities and untapped potential that require conscious effort to develop. Often manifests as gentle nudges, small synchronicities, or quiet support that builds gradually over time. Represents talents that need cultivation rather than automatic expression.",
    "integrationPractice": "Pay attention to subtle synchronicities and gentle nudges. Practice small daily actions that honor both planetary energies. Trust in gradual, organic development."
  },
  {
    "id": "semi-square",
    "type": "aspect",
    "name": "Semi-Square (Octile)",
    "symbol": "∠",
    "angle": 45,
    "orbRange": "1-2°",
    "nature": "Challenging",
    "keyword": "Irritation",
    "elementalPattern": "Mixed elements and modalities",
    "explanation": "The Gentle Friction of Awakening. This minor challenging aspect creates subtle irritation that serves as a wake-up call, like a pebble in your shoe that reminds you to pay attention. The semi-square brings minor stress that can catalyze awareness and motivate positive change. It suggests 'Something needs adjustment - what small shift will bring relief?'",
    "impact": "Creates minor tension and low-level irritations that signal need for adjustment. Often manifests as mental blocks, communication difficulties, or small persistent problems that require attention. Builds awareness through gentle discomfort.",
    "integrationPractice": "Use minor irritations as signals for needed adjustments. Practice micro-corrections rather than major overhauls. Listen to the subtle wisdom in small discomforts."
  },
  {
    "id": "sesqui-square",
    "type": "aspect",
    "name": "Sesqui-Square",
    "symbol": "⚼",
    "angle": 135,
    "orbRange": "1-2°",
    "nature": "Challenging",
    "keyword": "Persistence",
    "elementalPattern": "Mixed elements and modalities",
    "explanation": "The Persistent Call for Integration. This aspect creates ongoing low-level tension that requires consistent attention, like a teacher who keeps asking the same important question until you finally understand. The sesqui-square demands integration through persistent effort and conscious choice. It states 'This lesson will continue until you learn it.'",
    "impact": "Creates mild but persistent tension that feels like frustration or need for refinement. Often manifests as recurring patterns that require ongoing attention and gradual adjustment. Builds character through consistent effort to resolve minor but persistent challenges.",
    "integrationPractice": "Embrace the repetitive nature of this teaching. Practice consistent small actions rather than dramatic gestures. Allow the persistence to refine your understanding."
  },
  {
    "id": "quintile",
    "type": "aspect",
    "name": "Quintile",
    "symbol": "Q",
    "angle": 72,
    "orbRange": "1-2°",
    "nature": "Harmonious",
    "keyword": "Genius",
    "elementalPattern": "Mixed elements and modalities, creates five-pointed star sacred geometry",
    "explanation": "The Sacred Geometry of Creative Mastery. This rare and powerful aspect connects to the five-pointed star, creating opportunities for unique creative expression and specialized talents. The quintile represents gifts that emerge through dedicated practice and conscious development. It proclaims 'Here lies a seed of genius - will you tend this garden?'",
    "impact": "Creates unique creative abilities and specialized talents that can be developed with practice. Often manifests as distinctive abilities, unusual skills, or creative genius that sets you apart. Represents potential mastery in specific areas.",
    "integrationPractice": "Develop your unique creative talents through dedicated practice. Honor the specialness of this gift while staying humble. Share your mastery in service of beauty and truth."
  },
  {
    "id": "biquintile",
    "type": "aspect",
    "name": "Biquintile",
    "symbol": "bQ",
    "angle": 144,
    "orbRange": "1-2°",
    "nature": "Harmonious",
    "keyword": "Mastery",
    "elementalPattern": "Mixed elements and modalities, completing the five-pointed star sacred geometry",
    "explanation": "The Culmination of Creative Genius. The biquintile completes the sacred pentagram geometry, representing talents that have been developed through lifetimes of practice. This aspect indicates an area where creative mastery can be achieved through dedication and conscious cultivation. It declares 'Your unique gifts have ripened - now share them with the world.'",
    "impact": "Creates deeply specialized creative abilities that feel innate yet require conscious development to fully manifest. Often indicates areas of natural mastery, artistic genius, or unique problem-solving abilities. Represents evolved talents ready for expression and sharing.",
    "integrationPractice": "Trust your unique creative vision even when others don't understand. Practice your craft with dedication and humility. Allow your mastery to serve beauty, truth, and the collective evolution."
  }
]
