[
  {
    "id": "ring-of-humanity",
    "type": "codon-ring",
    "name": "Ring of Humanity",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-10",
      "gk-17",
      "gk-21",
      "gk-25",
      "gk-38",
      "gk-51"
    ],
    "aminoAcid": "Arginine",
    "aminoAcids": ["Arginine"],
    "transformationTheme": "This ring transforms the shadow of the sacred wound into the gift of heart-centered trust when consciousness chooses love over suffering as its primary authority.",
    "theme": "The Sacred Wound",
    "collectivePurpose": "To embrace the full spectrum of human emotion and the archetypal human journey",
    "description": "The Sacred Wound at the heart of humanity. These six Gene Keys represent an archetypal aspect of the human story—wounded from the outset (25), you must do battle with your shadows (38), overcome the limitations of your mind (17), surrender your need to control life (21), find your true self (10) before you can awaken (51). This ring concerns love and the human capacity to trust in the authority of the heart.",
    "primaryThemes": [
      "Sacred wound and human suffering",
      "Trust in the authority of the heart",
      "Archetypal human journey",
      "Love and human bonding"
    ]
  },
  {
    "id": "ring-of-water",
    "type": "codon-ring",
    "name": "Ring of Water",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-2",
      "gk-8"
    ],
    "aminoAcid": "Phenylalanine",
    "aminoAcids": ["Phenylalanine"],
    "transformationTheme": "This ring transforms the shadow of emotional chaos into the gift of depth and receptivity when consciousness surrenders to the great feminine current rather than resisting the flow toward self-realization.",
    "theme": "The Feminine Principle",
    "collectivePurpose": "To embody the great feminine principle and guide humanity along the journey to self-realization",
    "description": "The Ring of Water draws humans along their inevitable journey to self-realization. This is the great feminine ring, made of two of the prime feminine Gene Keys. It forms an eternal genetic knot with its polarity, the Ring of Fire. These two chemical families move us along the trajectory of our destinies, ensuring that our genetic material finds its opposite match.",
    "primaryThemes": [
      "Great feminine principle (yin)",
      "Journey to self-realization",
      "Mystical figure-of-eight with Ring of Fire",
      "Balancing opposing forces"
    ],
    "connectedRing": "ring-of-fire",
    "connectionType": "Polarity (Eternal Genetic Knot)"
  },
  {
    "id": "ring-of-fire",
    "type": "codon-ring",
    "name": "Ring of Fire",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-1",
      "gk-14"
    ],
    "aminoAcid": "Lysine",
    "aminoAcids": ["Lysine"],
    "transformationTheme": "This ring transforms the shadow of wasted creative force into the gift of divine beauty and bounteousness when consciousness learns to channel rather than exhaust its inner fire.",
    "theme": "Divine Creative Power",
    "collectivePurpose": "To ignite the creative fire of consciousness and manifest endless beauty",
    "description": "When the inner divine fire is released through your DNA, you become capable of miraculous power. The Ring of Fire unites the two Siddhis of Beauty and Bounteousness. It represents the energetic gem at the heart of creation—to create that which is endlessly beautiful and to imbue it with the awareness of this endless beauty. Genius is intimately connected to freshness and newness.",
    "primaryThemes": [
      "Divine fire and creative power",
      "Beauty and bounteousness (Siddhic union)",
      "Genius, freshness, and newness",
      "Fully engaged or fully at rest"
    ],
    "connectedRing": "ring-of-water",
    "connectionType": "Polarity (Eternal Genetic Knot)"
  },
  {
    "id": "ring-of-illusion",
    "type": "codon-ring",
    "name": "Ring of Illusion",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-28",
      "gk-32"
    ],
    "aminoAcid": "Aspartic Acid",
    "aminoAcids": ["Aspartic Acid"],
    "transformationTheme": "This ring transforms the shadow of postponed living and fear of mortality into the gift of total presence when consciousness sees through the veil that separates it from this moment.",
    "theme": "Breaking the Illusion of Death",
    "collectivePurpose": "To see through the veil of illusion and break the fear of mortality",
    "description": "This binary genetic codon group is based on the illusion of death. It guides humanity through the veils of primal fear—fear of death itself and fears of dying unfulfilled. At the shadow level, these Gene Keys cause humans to postpone their lives, seeking purpose in the future. At its core, this ring carries the potential for humanity to break the illusion of death altogether through living totally in the present moment.",
    "primaryThemes": [
      "Illusion of death and mortality",
      "Primal fear patterns",
      "Postponing life for future purpose",
      "Living totally in the present moment"
    ]
  },
  {
    "id": "ring-of-light",
    "type": "codon-ring",
    "name": "Ring of Light",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-5",
      "gk-9",
      "gk-11",
      "gk-26"
    ],
    "aminoAcid": "Threonine",
    "aminoAcids": ["Threonine"],
    "transformationTheme": "This ring transforms the shadow of magnetic contraction into the gift of luminous transmission when consciousness opens its heart and consciously raises the frequency drawn into the cells.",
    "theme": "Capturing and Transmuting Light",
    "collectivePurpose": "To bring light and clarity to consciousness by consciously raising DNA frequency",
    "description": "The Ring of Light determines the blueprint of how your body captures, stores, and transmutes light waves into energy. Through the magnetism of your living aura, you draw in or limit the frequencies of light into your cellular structure. If you live out of fear, you magnetically limit the light. The more open-hearted you are, the more you magnetize higher frequencies into your DNA. This ring addresses the central message of the Gene Keys—that you wield the power to consciously alter your reality through the medium of your DNA.",
    "primaryThemes": [
      "Capturing, storing, and transmuting light",
      "Magnetic frequency of the aura",
      "Consciously raising DNA frequency",
      "Core message of Gene Keys transmission"
    ]
  },
  {
    "id": "ring-of-purification",
    "type": "codon-ring",
    "name": "Ring of Purification",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-13",
      "gk-30"
    ],
    "aminoAcid": "Glutamine",
    "aminoAcids": ["Glutamine"],
    "transformationTheme": "This ring transforms the shadow of desire and accumulated emotional residue into the gift of clarity and lightness when consciousness embraces purification as renewal rather than punishment.",
    "theme": "Progressive Cleansing",
    "collectivePurpose": "To purify and refine consciousness through progressive cycles of cleansing",
    "description": "The Ring of Purification guides humanity to evolve through progressive cycles of cleansing and purification. It takes us on a journey through the purifying fires of consciousness where our beings begin to relinquish the hold of desire. As one of the great human genetic battlefields, there is scientific evidence linking its amino acid, glutamine, to various functions in our gut. Symbolically, there's a connection between how effectively we process our past and how effectively our body eliminates waste.",
    "primaryThemes": [
      "Progressive cycles of cleansing",
      "Relinquishing the hold of desire",
      "Processing the past",
      "Gut health and emotional digestion"
    ]
  },
  {
    "id": "ring-of-seeking",
    "type": "codon-ring",
    "name": "Ring of Seeking",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-15",
      "gk-39",
      "gk-52",
      "gk-53",
      "gk-54",
      "gk-58"
    ],
    "aminoAcid": "Serine",
    "aminoAcids": ["Serine"],
    "transformationTheme": "This ring transforms the shadow of restless discontent into the gift of inspired aspiration when consciousness turns the evolutionary pressure inward and discovers that seeking itself leads to the source.",
    "theme": "Evolutionary Pressure",
    "collectivePurpose": "To seek and find meaning through the evolutionary pressure that drives spiritual aspiration",
    "description": "This Codon Ring is the great pressure codon inside human DNA. Each of the six Gene Keys drives an aspect of human evolutionary movement. In shadow frequency, this pressure creates stress and fear. In higher frequencies, it generates creativity and aspiration. Together these six pressures drive you to seek answers that end the longing inside. All seeking eventually leads inward, and as seeking stops, the vital energy becomes clearer and more radiant.",
    "primaryThemes": [
      "Evolutionary pressure and movement",
      "Dissatisfaction driving spiritual aspiration",
      "Turning inward to unlock vitality",
      "Creative force when pressure releases"
    ]
  },
  {
    "id": "ring-of-prosperity",
    "type": "codon-ring",
    "name": "Ring of Prosperity",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-16",
      "gk-45"
    ],
    "aminoAcid": "Cysteine",
    "aminoAcids": ["Cysteine"],
    "transformationTheme": "This ring transforms the shadow of hoarding and competition into the gift of synergistic abundance when consciousness unites diverse talents into the collective genius of the Guild.",
    "theme": "True Abundance",
    "collectivePurpose": "To manifest sustainable prosperity through group synergy and collective genius",
    "description": "This codon ring is the master program in your DNA for activating true prosperity. The Ring of Prosperity shows that the more we diversify and unite our resources, the more successful and efficient we become. Through fusion of human talent coupled with the power of group synergy, anything becomes possible. This leads to the mystical secrets of the Guilds—the genetic groupings of genius that when brought together can liberate prosperity exponentially throughout our civilization.",
    "primaryThemes": [
      "Activating true prosperity and abundance",
      "Group synergy and collective genius",
      "Diversifying and uniting resources",
      "The mystical Guilds"
    ]
  },
  {
    "id": "ring-of-divinity",
    "type": "codon-ring",
    "name": "Ring of Divinity",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-22",
      "gk-36",
      "gk-37",
      "gk-63"
    ],
    "aminoAcid": "Proline",
    "aminoAcids": ["Proline"],
    "transformationTheme": "This ring transforms the shadow of doubt and suffering into the gift of grace and redemption when consciousness recognizes that the wound is the very portal through which divinity enters the world.",
    "theme": "Christ Consciousness",
    "collectivePurpose": "To awaken the highest consciousness and bring the manifestation of the Divine Being into the world",
    "description": "Deeply connected to the true meaning of Christ consciousness, the Ring of Divinity and its four genetic archetypes have the capacity to awaken the highest consciousness inside you. It reveals a great Truth—all humans are made equal in suffering. Doubt makes us human and leads to Graciousness in how we treat others. Because of its connection to the 22nd Gene Key, this ring brings intense emotional experiences and challenges, but ultimately it is about Redemption.",
    "primaryThemes": [
      "Christ consciousness and divine archetypes",
      "Equality in suffering and redemption",
      "Transformation through emotional challenges",
      "Doubt, humanity, grace, and truth"
    ]
  },
  {
    "id": "ring-of-no-return",
    "type": "codon-ring",
    "name": "Ring of No Return",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-31",
      "gk-62"
    ],
    "aminoAcid": "Tyrosine",
    "aminoAcids": ["Tyrosine"],
    "transformationTheme": "This ring transforms the shadow of spiritual timidity into the gift of authentic expression when consciousness crosses the threshold of speaking its truth and finds there is no return to lesser frequencies.",
    "theme": "Throat Center Initiation",
    "collectivePurpose": "To transcend all limitation through speaking higher truth",
    "description": "The Ring of No Return refers to the evolutionary process that takes place when higher consciousness reaches the throat centre. This is where the greatest human initiation occurs—the leap from the 4th causal body into the 5th buddhic body. Once you begin to speak your truth and the higher involutionary currents begin to use your voice to transmit their truths, there is No Return. You have broken away from the lower realms forever, taking the leap from worship to embodiment.",
    "primaryThemes": [
      "Throat center initiation",
      "Leap from 4th causal to 5th buddhic body",
      "Speaking higher truth",
      "From worship to embodiment"
    ]
  },
  {
    "id": "ring-of-destiny",
    "type": "codon-ring",
    "name": "Ring of Destiny",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-34",
      "gk-43"
    ],
    "aminoAcid": "Asparagine",
    "aminoAcids": ["Asparagine"],
    "transformationTheme": "This ring transforms the shadow of missed timing and unfulfilled potential into the gift of destiny's recognition when consciousness learns to read the moment where evolution and involution dance as one.",
    "theme": "Evolution Meets Involution",
    "collectivePurpose": "To fulfill one's unique destiny where evolution and involution meet",
    "description": "Through the Ring of Destiny, the two great forces of evolution and involution come together. Human destiny is caught between the polarity of these two Gene Keys—the 34th representing the human urge to evolve and become more, and the 43rd representing the Divine urge to involve and dive down into matter. The result is pure fusion, as spirit enters matter and imbues it with divinity. The secret of this ring is timing—life is a mystery in which chance and love are dancing together.",
    "primaryThemes": [
      "Evolution + Involution meeting",
      "Spirit entering matter as divinity",
      "Secret of timing",
      "Chance and love dancing together"
    ]
  },
  {
    "id": "ring-of-miracles",
    "type": "codon-ring",
    "name": "Ring of Miracles",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-35"
    ],
    "aminoAcid": "Tryptophan",
    "aminoAcids": ["Tryptophan"],
    "transformationTheme": "This ring transforms the shadow of limiting belief and mundane expectation into the gift of boundless possibility when consciousness opens like a child to the miraculous encoded in every moment.",
    "theme": "Boundless Possibility",
    "collectivePurpose": "To recognize and manifest the miraculous through childlike boundlessness",
    "description": "As the single heart of the Ring of Miracles, the 35th Gene Key brings the miraculous into the world. It opens up all kinds of possibilities to those who allow their minds to become like a child's. To the child, anything seems possible—this is the state of boundlessness. To activate such streams of miracles, you have to break free from the beliefs and limitations imposed on your mind. Throughout history, people have flown, ascended and dematerialized right before people's eyes. Anything is possible.",
    "primaryThemes": [
      "Boundlessness and childlike possibility",
      "Breaking the laws of form",
      "Manifesting the miraculous",
      "Freedom from limiting beliefs"
    ]
  },
  {
    "id": "ring-of-matter",
    "type": "codon-ring",
    "name": "Ring of Matter",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-18",
      "gk-46",
      "gk-48",
      "gk-57"
    ],
    "aminoAcid": "Alanine",
    "aminoAcids": ["Alanine"],
    "transformationTheme": "This ring transforms the shadow of developmental wounding and physical disconnection into the gift of full incarnation when consciousness allows spirit to penetrate and illuminate every layer of matter.",
    "theme": "Incarnation and Development",
    "collectivePurpose": "To ground spirit into material form through healthy physical, emotional, and mental development",
    "description": "The Ring of Matter programs the human developmental process of incarnation from conception to age 21. It is through this ring that spirit first penetrates into matter and releases its true radiance. Throughout each developmental cycle, this ring plays a crucial role through biofeedback with the outer environment. The 57th Gene Key lays seeds during gestation, while the 46th, 48th, and 18th govern the physical, emotional, and mental phases respectively. This ring governs the very infrastructure of our health.",
    "primaryThemes": [
      "Incarnation from conception to age 21",
      "Spirit penetrating matter",
      "Physical, emotional, mental health infrastructure",
      "Developmental phases and imprinting"
    ]
  },
  {
    "id": "ring-of-alchemy",
    "type": "codon-ring",
    "name": "Ring of Alchemy",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-6",
      "gk-40",
      "gk-47",
      "gk-64"
    ],
    "aminoAcid": "Glycine",
    "aminoAcids": ["Glycine"],
    "transformationTheme": "This ring transforms the shadow of interference and karmic accumulation into the gift of transmuted DNA when consciousness releases what binds it and allows peace to reorganize matter from within.",
    "theme": "DNA Transmutation",
    "collectivePurpose": "To transform and transmute DNA, bringing peace to earth through alchemical process",
    "description": "This very powerful genetic grouping plays a pivotal role in the transformation of the human species. Each of these four Gene Keys will transmute your DNA so there is no longer any interference in your physical body. The 6th Gift breaks down barriers in relationships, the 40th Gift forges openness into communities, the 47th Gift allows transformation of old ways, and the 64th Gift opens us to fresh possibilities. This ring activates karmic release, allowing your highest subtle bodies to manifest through your physical body.",
    "primaryThemes": [
      "DNA transmutation and transformation",
      "Karmic release and subtle body manifestation",
      "Peace on earth through alchemical process",
      "Breaking barriers in relationships and communities"
    ]
  },
  {
    "id": "ring-of-gaia",
    "type": "codon-ring",
    "name": "Ring of Gaia",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-19",
      "gk-60",
      "gk-61"
    ],
    "aminoAcid": "Isoleucine",
    "aminoAcids": ["Isoleucine"],
    "transformationTheme": "This ring transforms the shadow of separation and ecological disconnection into the gift of planetary consciousness when awareness recognizes all life forms as expressions of one shared evolutionary destiny.",
    "theme": "Planetary Consciousness",
    "collectivePurpose": "To attune to the wisdom of the planet and discover our collective destiny as one entity",
    "description": "The Ring of Gaia holds the blueprint that all beings sharing earth will eventually live in union. This genetic grouping allows awareness to move between different life forms and connect all beings along the same initiatory journey. Through this ring we see how our ecosystem—all life forms—is destined to discover its own inner truth as one entity. Evolution is breaking out from inside us, and to unlock its secrets we need only look inward. Everything from the tiniest nanoparticle to the cosmos has the same shining jewel of inner truth at its core.",
    "primaryThemes": [
      "Planetary consciousness and unity",
      "All beings sharing one destiny",
      "Ecosystem awareness across life forms",
      "Quantum unity and inner truth"
    ]
  },
  {
    "id": "ring-of-trials",
    "type": "codon-ring",
    "name": "Ring of Trials",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-12",
      "gk-33",
      "gk-56"
    ],
    "aminoAcid": "Stop Codon (Terminator)",
    "aminoAcids": ["Stop codon"],
    "transformationTheme": "This ring transforms the shadow of endless striving and attachment to outcome into the gift of sacred completion when the hero within learns to release, seal, and step beyond the illusion of the outer world.",
    "theme": "The Hero's Journey",
    "collectivePurpose": "To test humanity on the road to self-realization through the mythical hero's journey",
    "description": "The three Gene Keys in this unique group are the 'stop' or 'terminator' codons. They behave as a seal that closes energy leaks—chemical punctuation marks with unusual importance within the genetic code. When activated, this ring begins to unplug humanity from the illusory world of the outer senses. On an archetypal level, these three codons lay out the great dramatic script of evolution itself, testing humans on their road to self-realization. Every human awakening must arouse the hero or heroine inside.",
    "primaryThemes": [
      "Stop codons sealing energy leaks",
      "Hero's journey and mythical trials",
      "Unplugging from outer senses",
      "Testing humanity toward self-realization"
    ]
  },
  {
    "id": "ring-of-union",
    "type": "codon-ring",
    "name": "Ring of Union",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-4",
      "gk-7",
      "gk-29",
      "gk-59"
    ],
    "aminoAcid": "Valine",
    "aminoAcids": ["Valine"],
    "transformationTheme": "This ring transforms the shadow of relational dysfunction and manipulation into the gift of purified union when consciousness meets others through virtue, transparency, and the sacred power of devotion.",
    "theme": "Purifying Human Relationships",
    "collectivePurpose": "To create unity and bonding between beings through collective leadership emergence",
    "description": "The ultimate role of the Ring of Union is the purification of human relationships across our planet. These four Gene Keys govern human relationship patterns and their dysfunction. The combined dynamic of virtue with forgiveness, devotion and transparency sets the stage for collective leadership—a completely new phenomenon in humanity. This ring is currently undergoing spontaneous mutation in our DNA, directly responsible for huge shifts in how we relate, particularly through sexuality and gender.",
    "primaryThemes": [
      "Purifying human relationships",
      "Collective leadership emergence",
      "Transformation of sexuality and gender",
      "Virtue, forgiveness, devotion, transparency"
    ]
  },
  {
    "id": "ring-of-life-and-death",
    "type": "codon-ring",
    "name": "Ring of Life and Death",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-3",
      "gk-20",
      "gk-23",
      "gk-24",
      "gk-27",
      "gk-42"
    ],
    "aminoAcid": "Leucine",
    "aminoAcids": ["Leucine"],
    "transformationTheme": "This ring transforms the shadow of immaturity and resistance to endings into the gift of cyclical wisdom when consciousness learns to die and be reborn with full presence at each threshold of change.",
    "theme": "Cycles of Transformation",
    "collectivePurpose": "To embrace the cycles of change and renewal through the transformative power of endings and beginnings",
    "description": "The Ring of Life and Death governs the eternal cycle of transformation that defines existence. These six Gene Keys hold the secrets of how consciousness moves through birth, life, death, and rebirth. This ring teaches that true power comes from surrendering to the natural rhythms of ending and beginning, and that every death contains the seed of new life. It is the ring that most directly interfaces with the mystery of mortality and immortality.",
    "primaryThemes": [
      "Transformation and renewal cycles",
      "Birth, life, death, and rebirth",
      "Surrendering to natural rhythms",
      "The mystery of mortality"
    ]
  },
  {
    "id": "ring-of-the-illuminati",
    "type": "codon-ring",
    "name": "Ring of the Illuminati",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-44",
      "gk-50"
    ],
    "aminoAcid": "Methionine",
    "aminoAcids": ["Methionine"],
    "transformationTheme": "This ring transforms the shadow of hidden knowledge and ancestral karmic patterns into the gift of collective illumination when consciousness brings the buried records of humanity into the light of awareness.",
    "theme": "Collective Memory",
    "collectivePurpose": "To access and transmit the collective memory of humanity through karmic inheritance",
    "description": "The Ring of the Illuminati connects to the collective memory bank of humanity. These Gene Keys govern the transmission of karmic inheritance and the cosmic records that are stored within DNA. This ring has historically been associated with secret societies and hidden knowledge, but its true purpose is to illuminate—to bring light to what has been hidden in the shadows of collective memory and to transform ancestral patterns into collective wisdom.",
    "primaryThemes": [
      "Collective memory and karmic inheritance",
      "Cosmic records in DNA",
      "Hidden knowledge brought to light",
      "Ancestral pattern transformation"
    ]
  },
  {
    "id": "ring-of-the-whirlwind",
    "type": "codon-ring",
    "name": "Ring of the Whirlwind",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-49",
      "gk-55"
    ],
    "aminoAcid": "Histidine",
    "aminoAcids": ["Histidine"],
    "transformationTheme": "This ring transforms the shadow of revolutionary chaos and emotional overwhelm into the gift of collective mutation when consciousness rides the whirlwind as a vehicle for the highest evolutionary leap.",
    "theme": "Revolutionary Transformation",
    "collectivePurpose": "To catalyze revolutionary change through the transformative power of emotional mutation",
    "description": "The Ring of the Whirlwind carries the most powerful transformative force in the human genome. These two Gene Keys are responsible for great revolutions in human consciousness and society. When activated, this ring creates a whirlwind of change that can feel chaotic but ultimately serves evolution. The 49th Gene Key governs revolution and the 55th holds the key to emotional mutation—together they represent the unstoppable force of change that periodically sweeps through humanity.",
    "primaryThemes": [
      "Revolutionary change",
      "Emotional mutation",
      "Transformative chaos",
      "Unstoppable evolutionary force"
    ]
  },
  {
    "id": "ring-of-origin",
    "type": "codon-ring",
    "name": "Ring of Origin",
    "symbol": "⬡",
    "geneKeyIds": [
      "gk-41"
    ],
    "aminoAcid": "Glutamic Acid",
    "aminoAcids": ["Glutamic Acid"],
    "transformationTheme": "This ring transforms the shadow of fantasy disconnected from reality into the gift of visionary initiation when consciousness returns to the source of all being and plants the seed of the next great cycle.",
    "theme": "The Beginning of Everything",
    "collectivePurpose": "To return to the source of all being and initiate new cycles of creation",
    "description": "The Ring of Origin contains only the 41st Gene Key, representing the singular beginning point of all genetic sequences. This is the start codon—where all things begin. The 41st Gene Key is associated with new beginnings, the power of fantasy and imagination, and the pressure of contraction that precedes expansion. This ring holds the secret that every ending is a new beginning, and that the source of all creation is always available in this present moment.",
    "primaryThemes": [
      "The source of all being",
      "New beginnings and initiation",
      "Fantasy and imagination",
      "Contraction before expansion"
    ]
  }
]
