[
  {
    "id": "galactic-center",
    "type": "galactic-point",
    "name": "Galactic Center",
    "symbol": "GC",
    "eclipticLongitude": 267.15,
    "orb": 2.0,
    "zodiacSign": "sagittarius",
    "zodiacDegree": 27,
    "zodiacMinute": 9,
    "archetype": "The Great Transmitter — Phoenix Rising",
    "keywords": ["Source", "Higher Consciousness", "Divine Downloads", "Quest for Truth", "Phoenix Rising", "Transformation", "Galactic Mission", "Unified Consciousness", "Rebirth", "Soul Purpose"],
    "gift": "Direct transmission from Source — a natural attunement to higher consciousness, unified consciousness, and Divine understanding. Those with natal planets here are 'naturally wired' to receive galactic intelligence. Even the house containing 27° Sagittarius (without a direct conjunction) creates an unconscious pull toward expanded awareness in that life domain. When consciously embraced, this connection supports a deep soul mission that serves collective awakening and the phoenix rising through transformation.",
    "challenge": "The intensity of the signal can overwhelm — obsessive loops, difficulty filtering transmissions, or a sense of messianic purpose that isolates. The transformation themes of the phoenix can manifest as repeated cycles of destruction before rebirth. The challenge is staying grounded while remaining open to the channel.",
    "description": "The Galactic Center is the supermassive black hole at the gravitational heart of the Milky Way, currently at 27°09' Sagittarius. In Julia Balaz's 'Galactic Soul Journey Mapping' framework, it is one of the five primary 'Supra Cosmic Hubs' — the most powerful cosmic transmission portals. Planets conjunct the GC become dedicated receivers of Source frequency: higher learning, quest for truth, and the phoenix-rising transformation. Even the house containing this degree shows where a soul has an unconscious pull toward higher consciousness.",
    "contemplationTheme": "Your connection to Source — how you receive cosmic transmissions and carry your galactic soul mission"
  },
  {
    "id": "galactic-anti-center",
    "type": "galactic-point",
    "name": "Galactic Anti-Center",
    "symbol": "GAC",
    "eclipticLongitude": 87.15,
    "orb": 2.0,
    "zodiacSign": "gemini",
    "zodiacDegree": 27,
    "zodiacMinute": 9,
    "archetype": "The Cosmic Horizon — Looking Beyond the Galaxy",
    "keywords": ["Cosmic Periphery", "Individual Transcendence", "Beyond the Galactic Narrative", "Pioneering", "Unique Perspective", "Freedom from Conditioning", "Outer Cosmos", "Fresh Eyes"],
    "gift": "The complementary polarity to the Galactic Center — where the GC receives transmissions from the core, the Anti-Center looks outward toward the vast cosmos beyond the Milky Way. Those with planets here carry a genuinely fresh perspective, unencumbered by the deepest galactic gravity. They can see exit points from old collective stories that others can't yet perceive. A natural freedom from collective conditioning and the ability to pioneer new directions of thought.",
    "challenge": "The cosmic periphery can feel like exile. Difficulty belonging, a sense of never quite fitting in, or swinging between total immersion in collective life and complete detachment. The challenge is cherishing the unique vantage point rather than mourning the sense of separation it can bring.",
    "description": "The Galactic Anti-Center is the exact opposite point from the Galactic Center — the direction looking outward from our galaxy toward the cosmos beyond the Milky Way. At 27°09' Gemini, it represents the frontier, the edge, and the expansive view of what lies outside our galactic home. As the natural polarity to the GC, it holds the complementary theme: individual transcendence rather than collective transmission, freedom rather than mission, the outer cosmos rather than the Source.",
    "contemplationTheme": "Your cosmic freedom — how you carry a perspective from beyond the galactic narrative"
  },
  {
    "id": "super-galactic-center",
    "type": "galactic-point",
    "name": "Super Galactic Center",
    "symbol": "SGC",
    "eclipticLongitude": 181.87,
    "orb": 2.0,
    "zodiacSign": "libra",
    "zodiacDegree": 1,
    "zodiacMinute": 52,
    "archetype": "The Cosmic Vacuum — Multidimensional Heart",
    "keywords": ["Multidimensional Perception", "Advanced Soul", "Higher Dimensions", "Mass Magnetism", "Cosmic Harmony", "Super-Group Consciousness", "Expanded Awareness", "Helping Humanity", "Soul Evolution", "Gravity at Scale"],
    "gift": "Julia Balaz describes the SGC as a 'cosmic vacuum cleaner, devouring everything in sight' — an extraordinary gravitational pull operating at a scale beyond the galactic. Conjunctions or oppositions to Sun, Moon, Ascendant, Lunar Nodes, or Midheaven indicate souls 'from higher dimensions' with multidimensional perception and an innate capacity to help humanity reach higher consciousness. An extraordinary magnetism and the love principle operating at super-collective scale.",
    "challenge": "The magnetic pull can become indiscriminate — attracting everything, including what depletes. The SGC's 'cosmic vacuum' quality means the person may feel pulled in all directions simultaneously, or may unconsciously absorb collective emotional fields. The challenge is directing the magnetism with discernment while honoring the vast relational field it creates.",
    "description": "The Super Galactic Center is the gravitational heart of the Virgo Supercluster — a cosmic structure containing over 1,300 galaxy groups including our own Milky Way. At approximately 2° Libra, it is one of the five 'Supra Cosmic Hubs' in Julia Balaz's Galactic Soul Journey Mapping framework. She describes it as operating like a 'cosmic vacuum cleaner' — an irresistible gravitational force that draws everything toward it. Planets here indicate souls from higher dimensions who carry multidimensional perception and a deep calling to help humanity reach higher consciousness.",
    "contemplationTheme": "Your multidimensional magnetism — how you draw, harmonize, and help humanity reach higher consciousness"
  },
  {
    "id": "great-attractor",
    "type": "galactic-point",
    "name": "Great Attractor",
    "symbol": "GA",
    "eclipticLongitude": 254.03,
    "orb": 1.5,
    "zodiacSign": "sagittarius",
    "zodiacDegree": 14,
    "zodiacMinute": 2,
    "archetype": "The Irresistible Force — Multidimensional Polarizer",
    "keywords": ["Multidimensional Perception", "Mass Attraction", "Polarization", "Paradox", "Gravitational Presence", "Soul Evolution", "Irresistible Pull", "Catalyzing Consciousness", "Beyond Contradiction"],
    "gift": "One of Julia Balaz's five 'Supra Cosmic Hubs,' the Great Attractor carries an almost impossible level of gravitational influence and multidimensional perception. Those with planets here tend to be loved and feared in equal measure — a polarizing quality that catalyzes awakening in others. The ability to go beyond paradox, holding apparently contradictory truths simultaneously. A natural capacity for soul-evolution acceleration in their field.",
    "challenge": "The polarizing effect can be exhausting — encountering intense love or intense rejection with few neutral responses. Feeling pulled toward everything simultaneously, or attracting vast waves of both devotion and resistance. The challenge is owning the paradox without being paralyzed by it, and learning to channel the gravitational quality with conscious direction.",
    "description": "The Great Attractor is a gravitational anomaly of extraordinary mass sitting at ~14° Sagittarius, pulling hundreds of galaxies — including the Milky Way — toward it at 600 km/s. It lies behind the Zone of Avoidance (the galactic plane obscures it from direct observation), adding a quality of the hidden mystery. As one of Julia Balaz's five 'Supra Cosmic Hubs,' it carries themes of irresistible gravitational force, multidimensional perception, and the polarizing catalyzation of consciousness evolution.",
    "contemplationTheme": "Your gravitational field — how you polarize, catalyze, and draw soul evolution toward higher dimensions"
  }
]
