[
  {
    "id": "gk-sphere-lifes-work",
    "type": "gk-sphere",
    "name": "Life's Work",
    "symbol": "☉",
    "sequence": "Activation",
    "sequenceOrder": 1,
    "planetarySource": "Natal Sun",
    "description": "The Life's Work sphere represents your core creative expression in the world. It's the Gene Key that describes your essential purpose and the unique contribution you're here to make. This is the sphere of external expression and how you're designed to be seen.",
    "question": "What is my purpose? How am I designed to contribute?",
    "keywords": [
      "Purpose",
      "Expression",
      "Vocation",
      "Contribution",
      "Core Gift"
    ],
    "theme": "External expression of your purpose",
    "practicalGuidance": "This Gene Key describes the work you're here to do and the gifts you're here to share. When you align with your Life's Work, you feel on purpose. When you resist it, you may feel lost or unfulfilled. Contemplate the shadow, gift, and siddhi of this key to understand your life's creative expression.",
    "partnerSphere": "gk-sphere-evolution",
    "relationship": "The Life's Work and Evolution spheres are complementary—one is your external expression, the other your internal evolution."
  },
  {
    "id": "gk-sphere-evolution",
    "type": "gk-sphere",
    "name": "Evolution",
    "symbol": "⊕",
    "sequence": "Activation",
    "sequenceOrder": 2,
    "planetarySource": "Natal Earth",
    "description": "The Evolution sphere represents your personal growth edge and the internal journey you're on in this lifetime. While Life's Work is what you express outwardly, Evolution is what you're learning and integrating internally. It's your path of growth.",
    "question": "What am I here to learn? What is my growth edge?",
    "keywords": [
      "Growth",
      "Learning",
      "Integration",
      "Evolution",
      "Grounding"
    ],
    "theme": "Internal growth and evolution",
    "practicalGuidance": "This Gene Key shows what you're here to learn and integrate. It often represents the challenges you face that become your greatest teachers. Working with this key consciously accelerates your personal evolution.",
    "partnerSphere": "gk-sphere-lifes-work",
    "relationship": "Evolution grounds and supports Life's Work—as you evolve internally, your external expression deepens."
  },
  {
    "id": "gk-sphere-radiance",
    "type": "gk-sphere",
    "name": "Radiance",
    "symbol": "☽",
    "sequence": "Activation",
    "sequenceOrder": 3,
    "planetarySource": "Pre-Natal / Design Sun",
    "description": "The Radiance sphere represents your natural glow—the quality of presence that emanates from you when you're aligned. Calculated from your Design Sun position (~88 days before birth), it reflects the unconscious radiance that shines through you.",
    "question": "What is my natural radiance? How does my presence affect others?",
    "keywords": [
      "Radiance",
      "Presence",
      "Natural gifts",
      "Unconscious light",
      "Aura"
    ],
    "theme": "Your natural emanation and presence",
    "practicalGuidance": "This key shows the frequency you naturally emanate when you're not trying. It's connected to your unconscious gifts that shine through you. Aligning with your Radiance allows your presence to naturally uplift others.",
    "partnerSphere": "gk-sphere-purpose",
    "relationship": "Radiance and Purpose form a polarity—your natural radiance supports the discovery of your higher purpose."
  },
  {
    "id": "gk-sphere-purpose",
    "type": "gk-sphere",
    "name": "Purpose",
    "symbol": "☊",
    "sequence": "Activation",
    "sequenceOrder": 4,
    "planetarySource": "Pre-Natal / Design Earth",
    "description": "The Purpose sphere represents your higher purpose and the grounding force of your incarnation. Calculated from your Design Earth position (~88 days before birth), it reveals the unconscious foundation supporting your soul's journey.",
    "question": "What is my higher purpose? What grounds my incarnation?",
    "keywords": [
      "Higher purpose",
      "Foundation",
      "Soul grounding",
      "Unconscious purpose",
      "Destiny"
    ],
    "theme": "Your soul's evolutionary foundation",
    "practicalGuidance": "This Gene Key reveals the deeper purpose underlying your life. It may not feel conscious—it's the ground you stand on. Contemplating this key helps you align with your soul's intended foundation.",
    "partnerSphere": "gk-sphere-radiance",
    "relationship": "Purpose grounds you while Radiance emanates—together they form the axis of your incarnation."
  },
  {
    "id": "gk-sphere-attraction",
    "type": "gk-sphere",
    "name": "Attraction",
    "symbol": "♀",
    "sequence": "Venus",
    "sequenceOrder": 1,
    "planetarySource": "Pre-Natal / Design Moon",
    "description": "The Attraction sphere reveals the unconscious emotional patterns that draw certain people and experiences into your life. Calculated from your Design Moon (~88 days before birth), it shows your deepest emotional magnetism.",
    "question": "What am I unconsciously attracting? What patterns repeat in my relationships?",
    "keywords": [
      "Attraction",
      "Magnetism",
      "Emotional patterns",
      "Unconscious",
      "Drawing in"
    ],
    "theme": "Unconscious relational patterns",
    "practicalGuidance": "This key reveals shadow patterns that unconsciously attract certain relationship dynamics. By becoming conscious of this sphere, you can transform unconscious attraction into conscious magnetism.",
    "partnerSphere": null,
    "relationship": "Attraction is the entry point to the Venus Sequence, revealing the deepest layer of relationship patterns."
  },
  {
    "id": "gk-sphere-iq",
    "type": "gk-sphere",
    "name": "IQ",
    "symbol": "♀",
    "sequence": "Venus",
    "sequenceOrder": 2,
    "planetarySource": "Natal Venus",
    "description": "The IQ sphere represents your conscious relationship intelligence—how you value, appreciate, and connect with others. Calculated from your Natal Venus position, it shows your conscious patterns of attraction and relating.",
    "question": "How do I consciously value relationships? What do I appreciate in others?",
    "keywords": [
      "Intelligence",
      "Values",
      "Appreciation",
      "Conscious attraction",
      "Relating style"
    ],
    "theme": "Conscious relationship intelligence",
    "practicalGuidance": "This key shows how your conscious values influence your relationships. Working with this sphere helps you develop clearer understanding of what you truly value in connection.",
    "partnerSphere": "gk-sphere-eq",
    "relationship": "IQ and EQ work together—relationship intelligence and emotional courage must both develop for healthy relating."
  },
  {
    "id": "gk-sphere-eq",
    "type": "gk-sphere",
    "name": "EQ",
    "symbol": "♂",
    "sequence": "Venus",
    "sequenceOrder": 3,
    "planetarySource": "Natal Mars",
    "description": "The EQ sphere represents your emotional courage and how you assert yourself in relationships. Calculated from your Natal Mars position, it reveals your conscious capacity to take emotional risks and stand in your truth.",
    "question": "How do I express my emotional truth? What gives me courage in relationships?",
    "keywords": [
      "Emotional courage",
      "Assertion",
      "Truth",
      "Bravery",
      "Action"
    ],
    "theme": "Emotional courage in relationships",
    "practicalGuidance": "This key shows your capacity for emotional bravery in relationships. Developing this sphere increases your ability to be authentic and take emotional risks with others.",
    "partnerSphere": "gk-sphere-iq",
    "relationship": "EQ complements IQ—together they form the foundation for balanced relating with both appreciation and courage."
  },
  {
    "id": "gk-sphere-sq",
    "type": "gk-sphere",
    "name": "SQ",
    "symbol": "♀",
    "sequence": "Venus",
    "sequenceOrder": 4,
    "planetarySource": "Pre-Natal / Design Venus",
    "description": "The SQ (Spiritual Intelligence) sphere represents your unconscious capacity for spiritual connection in relationships. Calculated from your Design Venus (~88 days before birth), it reveals the deeper spiritual dimension of your relating.",
    "question": "How do I experience the sacred in relationships? What is my spiritual capacity for love?",
    "keywords": [
      "Spiritual intelligence",
      "Sacred",
      "Divine love",
      "Transcendence",
      "Union"
    ],
    "theme": "Spiritual dimension of relationships",
    "practicalGuidance": "This key reveals your unconscious capacity for spiritual depth in relationships. Working with this sphere opens you to experiencing love as a path to the divine.",
    "partnerSphere": null,
    "relationship": "SQ represents the higher octave of relational love, bridging human and divine connection."
  },
  {
    "id": "gk-sphere-core",
    "type": "gk-sphere",
    "name": "Core",
    "symbol": "♂",
    "sequence": "Venus",
    "sequenceOrder": 5,
    "planetarySource": "Pre-Natal / Design Mars",
    "description": "The Core sphere represents the deepest wound and the greatest treasure at the center of your being. Calculated from your Design Mars (~88 days before birth), it reveals the unconscious wound that underlies all other patterns—and the place of your deepest transformation.",
    "question": "What is my core wound? What is the treasure at my center?",
    "keywords": [
      "Core wound",
      "Treasure",
      "Vulnerability",
      "Power",
      "Transformation"
    ],
    "theme": "The deepest wound and greatest gift",
    "practicalGuidance": "This is the most sensitive sphere in your profile. Working with the Core requires gentle, patient contemplation. As you heal the Core wound, you unlock your deepest gifts and most authentic power.",
    "partnerSphere": null,
    "relationship": "The Core is the center of the Venus Sequence—all other spheres orbit around and are affected by this one."
  },
  {
    "id": "gk-sphere-vocation",
    "type": "gk-sphere",
    "name": "Vocation",
    "symbol": "♂",
    "sequence": "Pearl",
    "sequenceOrder": 1,
    "planetarySource": "Pre-Natal / Design Mars",
    "description": "The Vocation sphere represents your higher calling in service to the world. Calculated from your Design Mars (~88 days before birth), it shows the unconscious drive that propels your work into the world.",
    "question": "What is my higher calling? How am I meant to serve the world?",
    "keywords": [
      "Calling",
      "Service",
      "Drive",
      "Mission",
      "Work"
    ],
    "theme": "Your calling in service to the world",
    "practicalGuidance": "This key shows how your unconscious drive manifests as service. Vocation is about finding the intersection between what drives you and what the world needs.",
    "partnerSphere": "gk-sphere-culture",
    "relationship": "Vocation and Culture work together—your calling manifests through the cultural context you engage with."
  },
  {
    "id": "gk-sphere-culture",
    "type": "gk-sphere",
    "name": "Culture",
    "symbol": "♃",
    "sequence": "Pearl",
    "sequenceOrder": 2,
    "planetarySource": "Pre-Natal / Design Jupiter",
    "description": "The Culture sphere represents the collective field you're designed to influence or be influenced by. Calculated from your Design Jupiter (~88 days before birth), it shows your unconscious relationship to culture and expansion.",
    "question": "What culture am I here to serve or transform? What collective field am I part of?",
    "keywords": [
      "Culture",
      "Collective",
      "Field",
      "Expansion",
      "Evolution"
    ],
    "theme": "Your relationship to collective culture",
    "practicalGuidance": "This key reveals your unconscious connection to the collective field. Understanding this sphere helps you see how your individual journey serves cultural evolution.",
    "partnerSphere": "gk-sphere-vocation",
    "relationship": "Culture provides the context in which your Vocation can flourish and have impact."
  },
  {
    "id": "gk-sphere-brand",
    "type": "gk-sphere",
    "name": "Brand",
    "symbol": "☉",
    "sequence": "Pearl",
    "sequenceOrder": 3,
    "planetarySource": "Natal Sun",
    "description": "The Brand sphere represents your unique imprint and how you're designed to be recognized in the world. The same as your Life's Work (Natal Sun), Brand is about the authentic signature that makes you memorable and distinct.",
    "question": "What is my authentic imprint? How am I designed to be recognized?",
    "keywords": [
      "Brand",
      "Signature",
      "Recognition",
      "Authenticity",
      "Imprint"
    ],
    "theme": "Your authentic signature in the world",
    "practicalGuidance": "This key shows your natural 'brand'—the authentic quality that distinguishes you. It's not about creating an image but about allowing your true essence to be seen and recognized.",
    "partnerSphere": "gk-sphere-pearl",
    "relationship": "Brand supports the Pearl—your authentic imprint is the vessel through which your prosperity flows."
  },
  {
    "id": "gk-sphere-pearl",
    "type": "gk-sphere",
    "name": "Pearl",
    "symbol": "♃",
    "sequence": "Pearl",
    "sequenceOrder": 4,
    "planetarySource": "Natal Jupiter",
    "description": "The Pearl sphere represents the culmination of the entire hologenetic profile—the treasure that emerges from the integration of all your gifts. Calculated from your Natal Jupiter, it represents conscious expansion and prosperity.",
    "question": "What is my ultimate treasure? What prosperity am I here to embody?",
    "keywords": [
      "Pearl",
      "Prosperity",
      "Treasure",
      "Expansion",
      "Abundance"
    ],
    "theme": "The ultimate treasure of your existence",
    "practicalGuidance": "The Pearl is the fruit of your entire journey. It emerges naturally as you work with all the other spheres. True prosperity—material and spiritual—flows from embodying your Pearl.",
    "partnerSphere": "gk-sphere-brand",
    "relationship": "The Pearl is the ultimate flowering—supported by your Brand and expressing the integration of your entire profile."
  },
  {
    "id": "gk-sphere-creativity",
    "type": "gk-sphere",
    "name": "Creativity",
    "symbol": "♅",
    "sequence": "Additional",
    "sequenceOrder": 1,
    "planetarySource": "Pre-Natal / Design Uranus",
    "description": "The Creativity sphere represents your unique creative genius and innovative capacity. Calculated from your Design Uranus (~88 days before birth), it reveals the unconscious wellspring of your originality and breakthrough insights.",
    "question": "What is my unique creative genius? How do I innovate?",
    "keywords": [
      "Creativity",
      "Innovation",
      "Genius",
      "Breakthrough",
      "Originality"
    ],
    "theme": "Your unique creative expression",
    "practicalGuidance": "This key shows where your creative genius lives. It often manifests as sudden insights or unconventional approaches. Allowing this sphere to express itself brings original contributions to the world.",
    "partnerSphere": null,
    "relationship": "Creativity adds the spark of innovation to your profile."
  },
  {
    "id": "gk-sphere-relating",
    "type": "gk-sphere",
    "name": "Relating",
    "symbol": "☿",
    "sequence": "Additional",
    "sequenceOrder": 2,
    "planetarySource": "Natal Mercury",
    "description": "The Relating sphere represents your conscious communication style and how you connect mentally with others. Calculated from your Natal Mercury, it reveals your approach to communication, thinking, and everyday relating.",
    "question": "How do I communicate? What is my relating style?",
    "keywords": [
      "Communication",
      "Relating",
      "Thinking",
      "Expression",
      "Connection"
    ],
    "theme": "Your communication and relating style",
    "practicalGuidance": "This key shows how you naturally communicate and think. Understanding this sphere helps you refine your ability to connect and share ideas with others.",
    "partnerSphere": null,
    "relationship": "Relating influences how you communicate your gifts to the world."
  },
  {
    "id": "gk-sphere-stability",
    "type": "gk-sphere",
    "name": "Stability",
    "symbol": "♄",
    "sequence": "Additional",
    "sequenceOrder": 3,
    "planetarySource": "Pre-Natal / Design Saturn",
    "description": "The Stability sphere represents your unconscious relationship to structure, discipline, and mastery. Calculated from your Design Saturn (~88 days before birth), it shows the foundation that supports your long-term growth.",
    "question": "What provides my stability? What structures support my growth?",
    "keywords": [
      "Stability",
      "Structure",
      "Discipline",
      "Mastery",
      "Foundation"
    ],
    "theme": "Your structural foundation",
    "practicalGuidance": "This key reveals the unconscious structures that support your life. Working with this sphere helps you build sustainable foundations for your work and relationships.",
    "partnerSphere": null,
    "relationship": "Stability provides the structural foundation that supports all other spheres."
  }
]
