[
  {
    "id": "hd-authority-emotional",
    "type": "hd-authority",
    "name": "Emotional Authority",
    "symbol": "☀︎",
    "alternativeNames": [
      "Solar Plexus Authority",
      "Emotional Solar Plexus"
    ],
    "description": "Emotional Authority is the most common inner authority, found in approximately 50% of the population. Those with this authority have a defined Solar Plexus Center, which creates an emotional wave that moves through highs and lows over time. Clarity comes from riding the wave and making decisions when emotionally neutral.",
    "centerId": "solar-plexus-center",
    "decisionProcess": "Wait through your emotional wave before making important decisions. Don't decide in the high of enthusiasm or the low of doubt. Sleep on it. Give yourself time—there is no truth in the now for you. When you've experienced the decision from multiple emotional states and feel calm clarity, you're ready.",
    "percentage": "~50%",
    "keywords": [
      "Emotional wave",
      "Patience",
      "Time",
      "Clarity through waiting",
      "No truth in the now"
    ],
    "practicalGuidance": "Track your emotional patterns. Notice that your feelings about decisions change over time. Ask yourself: 'Have I felt this from both emotional highs and lows?' When you feel calm and clear—not excited, not doubtful—that's when to decide.",
    "timeframe": "Hours to days depending on the significance of the decision",
    "signs": {
      "correct": "Decisions feel solid over time. You don't regret choices made with emotional clarity.",
      "incorrect": "Impulsive decisions during emotional highs or lows lead to regret when the wave passes."
    },
    "waveMechanic": "The emotional wave moves through highs, lows, and neutral points in a natural cycle. Ra's core teaching: 'There is no truth in the now for emotional authority.' No decision is final until the wave has moved through at least one complete cycle and clarity emerges in the absence of emotional charge — not excitement, not depression, but a quiet knowing.",
    "somaticCue": "A sense of settled knowing — not excitement, not dread, but a stillness that persists across multiple emotional states. The signal is the absence of reactivity rather than the presence of a feeling. When the same decision still feels right after a high AND after a low, that is clarity.",
    "commonOverride": "Deciding in a moment of emotional high ('I'm so excited, this is right!') or emotional low ('I have to decide now or lose the opportunity'). The mind mistakes emotional intensity for clarity. The pattern: treating the peak of the wave as the decision point rather than waiting for the neutral."
  },
  {
    "id": "hd-authority-sacral",
    "type": "hd-authority",
    "name": "Sacral Authority",
    "symbol": "◉",
    "alternativeNames": [
      "Gut Authority",
      "Sacral Response"
    ],
    "description": "Sacral Authority belongs to Generators and Manifesting Generators who have a defined Sacral Center but undefined Solar Plexus. The Sacral speaks through sounds and sensations—an immediate gut response of 'uh-huh' (yes) or 'uhn-uhn' (no). This is the most instinctual and in-the-moment authority.",
    "centerId": "sacral-center",
    "decisionProcess": "Listen to your gut. When presented with something, notice if there's an 'uh-huh' (rising, opening, energizing sensation) or 'uhn-uhn' (contracting, closing, draining sensation). The Sacral responds in the moment—trust that initial response. If you're unsure, have someone ask you yes/no questions.",
    "percentage": "~35%",
    "keywords": [
      "Gut response",
      "Uh-huh/Uhn-uhn",
      "In the moment",
      "Sounds",
      "Life force"
    ],
    "practicalGuidance": "Pay attention to the sounds you naturally make. When someone asks if you want something, notice if your body opens or closes. Practice responding to yes/no questions and trusting your gut. The mind may second-guess—the Sacral knows.",
    "timeframe": "Immediate—the response is available in the moment",
    "signs": {
      "correct": "Following gut responses leads to satisfaction and sustained energy.",
      "incorrect": "Overriding the Sacral with mental justifications leads to frustration and exhaustion."
    },
    "waveMechanic": null,
    "somaticCue": "The Sacral sound: a gut-level 'uh-huh' (yes) or 'uhn-uhn' (no) that arises before words form. Ra taught it as a literal sound — not metaphorical. The gut responds to yes/no questions with a visceral pull toward or away, located in the belly below the navel. The signal is immediate and pre-verbal.",
    "commonOverride": "Asking 'why does my gut say yes to this?' and then rationalizing. The Sacral's response is not explainable by the mind; it simply is. The most common pattern: the gut says no, but the mind lists reasons why it should be yes — and the mind wins. The result is the Generator working at things they weren't designed to work at."
  },
  {
    "id": "hd-authority-splenic",
    "type": "hd-authority",
    "name": "Splenic Authority",
    "symbol": "◇",
    "alternativeNames": [
      "Intuitive Authority",
      "Instinctual Authority"
    ],
    "description": "Splenic Authority comes from a defined Spleen Center with undefined Sacral and Solar Plexus. The Spleen is the oldest awareness center, governing survival instincts, intuition, and bodily knowing. It speaks quietly and only once—in the moment.",
    "centerId": "spleen-center",
    "decisionProcess": "Trust your spontaneous intuitive hits. The Spleen speaks softly and doesn't repeat itself. It's a knowing that comes as a subtle sensation, a quiet 'yes' or 'no' in the body. This isn't emotional or mental—it's primal instinct. If you miss it, wait for another moment.",
    "percentage": "~11%",
    "keywords": [
      "Intuition",
      "Instinct",
      "Spontaneous",
      "Survival",
      "In the moment"
    ],
    "practicalGuidance": "Cultivate awareness of subtle body sensations. The Spleen might speak as a shiver, a slight feeling of wrongness, or a quiet pull toward something. It's easy to miss or override with the mind. Practice trusting these subtle signals.",
    "timeframe": "Immediate—the hit comes once in the moment",
    "signs": {
      "correct": "Following intuitive hits leads to safety, well-being, and being in the right place at the right time.",
      "incorrect": "Ignoring or missing splenic hits can lead to unhealthy situations, wrong timing, or danger."
    },
    "waveMechanic": null,
    "somaticCue": "An instantaneous, quiet knowing — a subtle shiver, a feeling of wrongness or rightness that arises once before the mind activates. Ra: 'The Spleen speaks once. And it speaks quietly. You have to be present to hear it.' Often experienced as a subtle physical sensation — a contraction, a lightness, or a brief flash of knowing in the moment.",
    "commonOverride": "The mind says 'I'll think about it' or 'let me make sure' — but the Splenic hit has already spoken and will not repeat. The most common pattern: the hit was clear, the mind second-guessed it, and the person later says 'I knew from the beginning.' Splenic beings who have been deeply conditioned often cannot hear the signal at all — it has been overridden so many times it has gone quiet."
  },
  {
    "id": "hd-authority-ego",
    "type": "hd-authority",
    "name": "Ego Authority",
    "symbol": "♡",
    "alternativeNames": [
      "Heart Authority",
      "Ego Manifested",
      "Ego Projected"
    ],
    "description": "Ego Authority comes from a defined Heart/Ego Center connected to the Throat (Ego Manifested) or G Center (Ego Projected). The Heart Center is about willpower, self-worth, and material promises. Decisions are correct when they serve your heart's desires and what you truly want.",
    "centerId": "heart-center",
    "decisionProcess": "Ask yourself: 'What do I want?' Listen to what your heart truly desires—not what you should want or what others want for you. Your will is your guide. If your heart is in it, you have the willpower to follow through. If not, you'll eventually quit.",
    "percentage": "~1%",
    "keywords": [
      "Willpower",
      "Desire",
      "What I want",
      "Self-worth",
      "Commitment"
    ],
    "practicalGuidance": "Get in touch with your genuine desires. When considering something, ask: 'Do I really want this? Is my heart in it?' Listen for what you want to say rather than what you think you should say. Your heart voice often starts with 'I want...' or 'I will...'",
    "timeframe": "Can be immediate or may need time to feel into heart's desire",
    "signs": {
      "correct": "Following heart's desires gives you willpower to complete things. You feel self-worth and material stability.",
      "incorrect": "Overcommitting or making promises your heart isn't in leads to broken commitments and depleted willpower."
    },
    "waveMechanic": null,
    "somaticCue": "A sense of genuine desire located in the heart/chest area — the question is whether the heart is actually in it. Ra: 'Will I?' is the Ego authority's self-inquiry. Not 'should I?' (that's the not-self asking). Not 'can I?' (that's the mind). But 'do I actually want this?' — felt as a real pull from the chest, not manufactured willpower.",
    "commonOverride": "Committing based on what sounds correct to others or what seems like the noble/responsible choice, rather than genuine desire. Undefined Ego conditioning at play: proving worth through overcommitment. The pattern: agreeing to things the heart is not in because 'I should be able to handle this.'"
  },
  {
    "id": "hd-authority-self-projected",
    "type": "hd-authority",
    "name": "Self-Projected Authority",
    "symbol": "⬡",
    "alternativeNames": [
      "G Center Authority",
      "Identity Authority"
    ],
    "description": "Self-Projected Authority is found in Projectors with the G Center connected to the Throat, but with undefined Sacral, Solar Plexus, Spleen, and Heart Centers. Clarity comes from speaking your truth and listening to what you say. Your identity and direction reveal themselves through expression.",
    "centerId": "g-center",
    "decisionProcess": "Talk it through with trusted others who can listen without agenda. As you speak, pay attention to what you say and how you feel saying it. Your truth reveals itself through expression. You're not seeking advice—you're seeking to hear yourself.",
    "percentage": "~3%",
    "keywords": [
      "Identity",
      "Direction",
      "Speaking truth",
      "Self-expression",
      "Being heard"
    ],
    "practicalGuidance": "Find trusted sounding boards—people who can listen without trying to influence you. When considering a decision, talk about it and notice: Do you sound authentic? Does what you're saying feel aligned? Your voice and words carry your truth.",
    "timeframe": "Usually needs a conversation or time to express and hear yourself",
    "signs": {
      "correct": "When speaking your truth, you feel aligned and clear about your direction.",
      "incorrect": "Making decisions without expressing them, or following others' advice over your own knowing, leads to identity confusion."
    },
    "waveMechanic": null,
    "somaticCue": "The truth is heard when speaking out loud to a trusted sounding board — not a person who gives advice, but someone who listens without agenda. The clarity emerges in the Projector's own voice, not from the listener's response. Ra: 'You need to hear yourself speak your truth. The voice carries the knowing.' The signal: a sentence that comes out and feels unmistakably true.",
    "commonOverride": "Thinking through the decision in the head rather than speaking it aloud. Or seeking advice (opinions) instead of sounding boards (listeners). The mind assumes it already knows what it will say, so it skips the speaking step. But the Self-Projected authority requires the act of voicing — the clarity is not available through internal reflection alone."
  },
  {
    "id": "hd-authority-mental",
    "type": "hd-authority",
    "name": "Mental Authority (None/Sounding Board)",
    "symbol": "◯",
    "alternativeNames": [
      "No Inner Authority",
      "Environmental Authority",
      "Outer Authority"
    ],
    "description": "Mental Projectors have no defined centers below the Throat. Without traditional inner authority, they find clarity through their environment and by talking things through over time. Their authority is essentially outer—relying on the right people and places to mirror their truth.",
    "centerId": null,
    "decisionProcess": "Talk through decisions with different people over time. Notice how you feel in different environments when considering the decision. Pay attention to what comes out of your mouth—not to get advice, but to hear yourself process. The right environment and people help you find clarity.",
    "percentage": "~3%",
    "keywords": [
      "Sounding board",
      "Environment",
      "Talking it through",
      "Time",
      "Trusted others"
    ],
    "practicalGuidance": "Cultivate a network of trusted sounding boards. When making decisions, discuss them with different people in different environments. Don't ask for advice—just talk and listen to yourself. Notice how different spaces make you feel about decisions.",
    "timeframe": "Extended—may need multiple conversations over time",
    "signs": {
      "correct": "The right environments and conversations bring natural clarity. Decisions feel right when processed this way.",
      "incorrect": "Rushing decisions or being in wrong environments leads to unclear, regrettable choices."
    },
    "waveMechanic": null,
    "somaticCue": "No inner authority — the signal is the environment itself and trusted outer voices. Clarity comes through the process of speaking to multiple people across multiple environments and listening to what consistently resonates. The cue is not a feeling but a pattern that emerges through multiple conversations: what keeps coming up as the right choice when speaking in different contexts?",
    "commonOverride": "Trying to decide alone, in isolation, without speaking the decision aloud to others. Or seeking one authoritative answer from one trusted source rather than gathering resonance across multiple conversations. The pattern: treating this as a mental decision when it is actually a relational and environmental one."
  },
  {
    "id": "hd-authority-lunar",
    "type": "hd-authority",
    "name": "Lunar Authority",
    "symbol": "☽",
    "alternativeNames": [
      "Lunar Cycle Authority",
      "Moon Authority"
    ],
    "description": "Lunar Authority is unique to Reflectors, who have no defined centers. Over a 28-29 day lunar cycle, the Moon activates all 64 gates, allowing Reflectors to sample every possible perspective. Major decisions require waiting through this complete cycle to gain true clarity.",
    "centerId": null,
    "decisionProcess": "For significant decisions, wait a full lunar cycle (28-29 days). Track how you feel about the decision at different times as the Moon moves through the gates. Talk with trusted advisors throughout. Notice patterns and when clarity emerges.",
    "percentage": "~1%",
    "keywords": [
      "Lunar cycle",
      "28 days",
      "All perspectives",
      "Patience",
      "Moon transits"
    ],
    "practicalGuidance": "Track the Moon and notice how your sense of a decision changes. Keep a journal. Talk to trusted people at different points in the cycle. By the end of the full Moon cycle, you'll have experienced the decision from every angle and can move forward with clarity.",
    "timeframe": "Full lunar cycle (28-29 days) for major decisions",
    "signs": {
      "correct": "Decisions made after a full cycle feel clear and aligned. Life brings delightful surprises.",
      "incorrect": "Rushing decisions leads to disappointment and feeling lost or disconnected."
    },
    "waveMechanic": null,
    "somaticCue": "The 28-day lunar cycle is the Reflector's decision-making timeframe — not a feeling but a process. The signal is consistency across the full moon cycle: how does the decision feel when the moon is in different gates? The 'cue' is the absence of a consistent no across the entire lunar transit. If after 28 days it still feels potentially right, that is the Reflector's yes.",
    "commonOverride": "Deciding in response to social or situational pressure before the 28-day cycle completes. Or deciding when the moon is in a gate that creates a misleadingly negative impression. The pattern: treating urgency as a legitimate reason to bypass the only process that gives Reflectors reliable guidance."
  }
]
