[
  {
    "id": "gate-1",
    "type": "hd-gate",
    "name": "Gate 1: The Divine Creative",
    "symbol": "1",
    "gateNumber": 1,
    "iChingHexagram": 1,
    "iChingName": "Self-Expression",
    "centerId": "g-center",
    "channelGateId": "gate-8",
    "tropicalSignId": "scorpio",
    "degreeStart": 223.25,
    "degreeEnd": 228.867,
    "geneKeyId": "gk-1",
    "keywords": [
      "creativity",
      "surrendering to the highs and lows of creativity",
      "and making marks"
    ],
    "coreTheme": "Capacity for creativity.",
    "hdDefinition": "Creation as a primal force. The energy potential to manifest inspiration without limitation.",
    "highExpression": "Deep honoring of natural creative cycles, understanding that creative lows are equally sacred as highs. Leading by example through authentic self-expression, trusting the creative process without forcing outcomes.",
    "lowExpression": "Resisting creative ebbs and flows, believing you should be creative all the time, making low feelings mean something is wrong. Trying to force creativity or comparing yourself to others.",
    "affirmations": [
      "I honor my natural creative cycles",
      "I am a creative powerhouse",
      "I surrender to the highs and lows of creativity"
    ],
    "description": "The drive and deep need to focus on expressing oneself in unique and creative ways. Not concerned with being best, but with living out true creative nature and authentic individuality. Creativity inspires others by example, and for impact to be felt must be seen or heard. Must honor natural creative cycles including the lows which are equally important as the highs.",
    "image": "/images/human-design/gates/gate-1.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-2",
    "type": "hd-gate",
    "name": "Gate 2: The Receptive Feminine",
    "symbol": "2",
    "gateNumber": 2,
    "iChingHexagram": 2,
    "iChingName": "The Direction of Self",
    "centerId": "g-center",
    "channelGateId": "gate-14",
    "tropicalSignId": "taurus",
    "degreeStart": 43.25,
    "degreeEnd": 48.867,
    "geneKeyId": "gk-2",
    "keywords": [
      "receiving",
      "abundance",
      "and authentic direction"
    ],
    "coreTheme": "Receptivity, Direction, and Vision (especially for resources)",
    "hdDefinition": "Receptivity as the primal base through which any response is determined. The root of action.",
    "highExpression": "Trusting in the abundance of life, being open to receiving gifts and opportunities. Having clear inner direction and vision, being magnetically attractive to resources and support.",
    "lowExpression": "Spending resources recklessly due to fear and anxiety about needs being met. Doubting ability to receive abundance, having no faith in capacity for receiving.",
    "affirmations": [
      "I trust in the abundance of life",
      "I choose to receive everything life offers me",
      "I am a magnet for abundance"
    ],
    "description": "Higher knowing rooted in direction of self toward love and beauty via Magnetic Monopole. Focused on movement in time through space with innate sense of inner direction not based on geographic location. Visionary providing plan for new way forward with capacity to receive abundance of life.",
    "image": "/images/human-design/gates/gate-2.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-3",
    "type": "hd-gate",
    "name": "Gate 3: The Sacred Fool",
    "symbol": "3",
    "gateNumber": 3,
    "iChingHexagram": 3,
    "iChingName": "Ordering",
    "centerId": "sacral-center",
    "channelGateId": "gate-60",
    "tropicalSignId": "aries/taurus",
    "degreeStart": 30,
    "degreeEnd": 35.625,
    "geneKeyId": "gk-3",
    "keywords": [
      "taking leaps of faith",
      "play",
      "and transformation"
    ],
    "coreTheme": "Bringing order to the constantly changing circumstances.",
    "hdDefinition": "The fundamental challenge of initiation is to transcend confusion and establish order.",
    "highExpression": "Playfully transforming chaos into order, seeing difficulties as opportunities for innovation. Having patience for the mutative timing and enjoying the creative process of bringing something new into being.",
    "lowExpression": "Feeling disempowered by chaos and confusion, struggling with the unpredictable nature of mutation. Frustration with God about living in a chaotic world.",
    "affirmations": [
      "Play, curiosity, and wonder are my north star",
      "I am tenacious AF",
      "I overcome obstacles by playing"
    ],
    "description": "Function is to transcend confusion and establish order so something new and potentially viable can take hold in world. Connection to unique Individual knowing, personal innovation, and potential for significant contribution. Creates innovative ways to overcome obstacles with light-hearted touch.",
    "image": "/images/human-design/gates/gate-3.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-4",
    "type": "hd-gate",
    "name": "Gate 4: The Forgiveness Decoder",
    "symbol": "4",
    "gateNumber": 4,
    "iChingHexagram": 4,
    "iChingName": "Formulization",
    "centerId": "ajna-center",
    "channelGateId": "gate-63",
    "tropicalSignId": "leo",
    "degreeStart": 123.875,
    "degreeEnd": 129.5,
    "geneKeyId": "gk-4",
    "keywords": [
      "logic",
      "forgiveness",
      "solutions",
      "possibility"
    ],
    "coreTheme": "Fear of never-ending chaos.",
    "hdDefinition": "The energy to beguile and succeed despite ignorance. Freedom from retribution.",
    "highExpression": "Understanding that leads to forgiveness and solutions",
    "lowExpression": "Harsh judgment or mental chaos",
    "affirmations": [],
    "description": "Applies mental awareness to questions fueled by doubt about future; formulates logic's answers. Each answer is only potential which must eventually be tested and substantiated by facts. Freedom from retribution through understanding.",
    "image": "/images/human-design/gates/gate-4.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-5",
    "type": "hd-gate",
    "name": "Gate 5: The Time Alchemist",
    "symbol": "5",
    "gateNumber": 5,
    "iChingHexagram": 5,
    "iChingName": "Fixed Patterns",
    "centerId": "sacral-center",
    "channelGateId": "gate-15",
    "tropicalSignId": "sagittarius",
    "degreeStart": 251.367,
    "degreeEnd": 257,
    "geneKeyId": "gk-5",
    "keywords": [
      "habits",
      "routines",
      "and expanding time"
    ],
    "coreTheme": "The energy to set and repeat patterns and rituals to ensure consistency.",
    "hdDefinition": "The fundamental attunement to natural rhythms. Waiting as an active state of awareness.",
    "highExpression": "Perfect attunement to natural rhythms",
    "lowExpression": "Fighting natural rhythms or rigid adherence to unsuitable patterns",
    "affirmations": [],
    "description": "Energy that enjoys fixed rhythms and tempos. Gives tenacity to stay true to own inner rhythms to maintain vitality, health and flow. Finds great satisfaction in mundane rituals and routines that attune to vibrations of all life.",
    "image": "/images/human-design/gates/gate-5.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-6",
    "type": "hd-gate",
    "name": "Gate 6: The Peacemaker",
    "symbol": "6",
    "gateNumber": 6,
    "iChingHexagram": 6,
    "iChingName": "Friction",
    "centerId": "emotional solar plexus-center",
    "channelGateId": "gate-59",
    "tropicalSignId": "virgo",
    "degreeStart": 153.875,
    "degreeEnd": 159.5,
    "geneKeyId": "gk-6",
    "keywords": [
      "creating inner peace",
      "conflict resolution",
      "and emotional empowerment"
    ],
    "coreTheme": "Fear of intimacy.",
    "hdDefinition": "The fundamental design component of progress. The law that growth cannot exist without friction.",
    "highExpression": "Using conflict as a doorway into inner peace. Taking full responsibility for emotions before confronting others and engaging only in necessary confrontation for growth.",
    "lowExpression": "Emotional volatility or reactivity that creates chaos. Fighting for things that don't matter or projecting unresolved emotions onto others.",
    "affirmations": [
      "I create clarity and stability by honoring my emotions",
      "I take full responsibility for my emotions and this paves the way for peaceful relationships",
      "I am not available to take on emotional projection from others"
    ],
    "description": "Fundamental design component of progress with law that growth cannot exist without friction. Generates all three modes of emotional awareness: feelings, moods and sensitivity. Powerful motorized combination on wave designed to create friction producing heat essential for growth and fertility.",
    "image": "/images/human-design/gates/gate-6.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-7",
    "type": "hd-gate",
    "name": "Gate 7: The Wise Shepherd￼",
    "symbol": "7",
    "gateNumber": 7,
    "iChingHexagram": 7,
    "iChingName": "The Role of Self in Interaction",
    "centerId": "g-center",
    "channelGateId": "gate-31",
    "tropicalSignId": "leo",
    "degreeStart": 129.5,
    "degreeEnd": 135.125,
    "geneKeyId": "gk-7",
    "keywords": [
      "offering guidance",
      "empowerment",
      "and mindful watching"
    ],
    "coreTheme": "Directional leadership and influence.",
    "hdDefinition": "The point of convergence. By design, the need for leadership to guide and order society.",
    "highExpression": "Empowering guidance toward collective good",
    "lowExpression": "Divisive or weak leadership",
    "affirmations": [],
    "description": "Oriented toward future with ability to see when society's present direction needs correcting. Logic's gate of direction with six leadership roles: Authoritarian, Democrat, Anarchist, Abdicator, General, Administrator. Provides power behind the throne leadership.",
    "image": "/images/human-design/gates/gate-7.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-8",
    "type": "hd-gate",
    "name": "Gate 8: The Rebel With A Cause",
    "symbol": "8",
    "gateNumber": 8,
    "iChingHexagram": 8,
    "iChingName": "Contribution",
    "centerId": "throat-center",
    "channelGateId": "gate-1",
    "tropicalSignId": "taurus/gemini",
    "degreeStart": 45,
    "degreeEnd": 50.625,
    "geneKeyId": "gk-8",
    "keywords": [
      "contribution",
      "authenticity",
      "and self-expression"
    ],
    "coreTheme": "Unique self expression.",
    "hdDefinition": "The basic worth realized in contributing individual efforts to group goals.",
    "highExpression": "Making authentic contribution through being yourself, empowering others to be authentic. Leading by example through unique style and individual expression.",
    "lowExpression": "Worrying about how individual expression will impact relationships, feeling purposeless under external conditioning and pressure. Being inauthentic to please others.",
    "affirmations": [
      "I stay true to my individual expression",
      "My unique style cannot be replicated because it comes from the inside",
      "I make a contribution by being my authentic self"
    ],
    "description": "Says \"I know I can contribute, or not.\" Contribution comes through public display of Individual lifestyle or by empowering and promoting others. Drawn toward what is novel and innovative. Leadership path of recognizing and displaying what is mutative.",
    "image": "/images/human-design/gates/gate-8.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-9",
    "type": "hd-gate",
    "name": "Gate 9: The Details Whiz",
    "symbol": "9",
    "gateNumber": 9,
    "iChingHexagram": 9,
    "iChingName": "Energy for Detail",
    "centerId": "sacral-center",
    "channelGateId": "gate-52",
    "tropicalSignId": "sagittarius",
    "degreeStart": 229.25,
    "degreeEnd": 234.875,
    "geneKeyId": "gk-9",
    "keywords": [
      "seeing the end result",
      "focusing",
      "and paying attention to details"
    ],
    "coreTheme": "Concentrating and focusing to create new patterns.",
    "hdDefinition": "Potential can be fulfilled through detailed attention to all pertinent aspects.",
    "highExpression": "Focused determination on meaningful details",
    "lowExpression": "Scattered attention or paralysis from too many details",
    "affirmations": [],
    "description": "Acts like funnel, focusing Gate 52's enormous power to concentrate on meaningful and worthwhile details. Carries frequency of diligence for detail and ability to focus energy on detailed aspects of projects or issues. Creates determination to focus passive but powerful energy from Root Center.",
    "image": "/images/human-design/gates/gate-9.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-10",
    "type": "hd-gate",
    "name": "Gate 10: The Self Love North Star",
    "symbol": "10",
    "gateNumber": 10,
    "iChingHexagram": 10,
    "iChingName": "The Behavior of the Self",
    "centerId": "g-center",
    "channelGateId": "gate-34",
    "tropicalSignId": "sagittarius/capricorn",
    "degreeStart": 240,
    "degreeEnd": 245.625,
    "geneKeyId": "gk-10",
    "keywords": [
      "self love",
      "personal empowerment",
      "and being an example"
    ],
    "coreTheme": "The love of being oneself.",
    "hdDefinition": "The underlying code of behavior that ensures successful interaction despite circumstances.",
    "highExpression": "Deep self-love and understanding of personal needs, values, and desires. Being an example of radical self-love through honoring boundaries, saying yes to authentic desires, and treating oneself with compassion and respect.",
    "lowExpression": "People-pleasing and codependency. Ignoring emotional wisdom, personal needs, and values in favor of external validation or approval from others.",
    "affirmations": [
      "I love myself fully and completely",
      "I am an example of radical self love",
      "I am empowered by knowing and honoring what I need"
    ],
    "description": "The most complex gate in the G Center and one of the four Gates of the Incarnation Cross of the Vessel of Love. This is the gate of the love of oneself. The six potential behaviors or roles of the self are guided by intuition, empowered by Sacral response, and manifested through expression. Gate 10 understands and honors its needs, values, and desires and is a shining example of self-love.",
    "image": "/images/human-design/gates/gate-10.png",
    "circuitType": "Integration"
  },
  {
    "id": "gate-11",
    "type": "hd-gate",
    "name": "Gate 11: The Idea Factory",
    "symbol": "11",
    "gateNumber": 11,
    "iChingHexagram": 11,
    "iChingName": "Ideas",
    "centerId": "ajna-center",
    "channelGateId": "gate-56",
    "tropicalSignId": "sagittarius",
    "degreeStart": 240.625,
    "degreeEnd": 246.25,
    "geneKeyId": "gk-11",
    "keywords": [
      "inner contemplation",
      "imagination",
      "and visualization"
    ],
    "coreTheme": "Fear of darkness.",
    "hdDefinition": "A Harmonic condition in the individual or society that permits assessment before renewed action.",
    "highExpression": "Inner contemplation through visualization, initiating self and others into self-reflection with ideas, knowing ideas are only powerful with right timing",
    "lowExpression": "Overactive imagination leading to anxiety and fear, burning out from trying to act on every idea, attachment to thoughts as truth",
    "affirmations": [],
    "description": "Ideas are concepts designed to express what has been sensed. Possibilities are conceptualized into ideas. These ideas are not prescriptions for action as ideas come and go. Given quiet moment for assessment to sort out what has been remembered over experiential process. The idea factory reveling in pondering life's questions.",
    "image": "/images/human-design/gates/gate-11.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-12",
    "type": "hd-gate",
    "name": "Gate 12: The Fine Artist",
    "symbol": "12",
    "gateNumber": 12,
    "iChingHexagram": 12,
    "iChingName": "Caution",
    "centerId": "throat-center",
    "channelGateId": "gate-22",
    "tropicalSignId": "gemini",
    "degreeStart": 75.125,
    "degreeEnd": 80.75,
    "geneKeyId": "gk-12",
    "keywords": [
      "being poetic",
      "artistic expression",
      "and discernment"
    ],
    "coreTheme": "Discriminating taste.",
    "hdDefinition": "The quality of restraint and the importance of meditation and inaction in confronting temptation.",
    "highExpression": "Expressing emotions through art and refined language, having impeccable taste and discriminating judgment. Making life itself a work of art through conscious choices.",
    "lowExpression": "Using words as weapons, holding people to impossible standards of perfection. Having superiority complex because of refined palate in life.",
    "affirmations": [
      "I transform my emotions into poetry and art",
      "My life is my art",
      "I have impeccable taste"
    ],
    "description": "Articulate, mutative and moody voice of Individual restrained by natural caution. Caution keeps you silent until mood tells you that you really have something to say in unique, transformative way. Making life your greatest work of art through refined expression.",
    "image": "/images/human-design/gates/gate-12.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-13",
    "type": "hd-gate",
    "name": "Gate 13: The Sounding Board",
    "symbol": "13",
    "gateNumber": 13,
    "iChingHexagram": 13,
    "iChingName": "The Listener",
    "centerId": "g-center",
    "channelGateId": "gate-33",
    "tropicalSignId": "aquarius",
    "degreeStart": 279.5,
    "degreeEnd": 285.125,
    "geneKeyId": "gk-13",
    "keywords": [
      "listening with empathy",
      "forgiveness",
      "and being a keeper of secrets"
    ],
    "coreTheme": "Listening to other people’s secrets.",
    "hdDefinition": "Universal ideas and values in an ordered framework that inspires humanistic cooperation.",
    "highExpression": "Listening to others' secrets while holding frequency of forgiveness, believing everyone needs empathetic listening, feeling connected through stories and experiences",
    "lowExpression": "Being dumping ground for others' darkness, unwillingness to forgive, holding onto anger, blame and resentment, gossiping or being loose-lipped",
    "affirmations": [],
    "description": "Gift for hearing, seeing and storing secrets, providing continuity between past and future in role as listener. Perceived as confidante and keeper of secrets. People naturally share experiences because you genuinely enjoy hearing stories, adventures, victories and challenges. The sounding board holding space for deep listening.",
    "image": "/images/human-design/gates/gate-13.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-14",
    "type": "hd-gate",
    "name": "Gate 14: The Prosperity Lumen",
    "symbol": "14",
    "gateNumber": 14,
    "iChingHexagram": 14,
    "iChingName": "Power Skills",
    "centerId": "sacral-center",
    "channelGateId": "gate-2",
    "tropicalSignId": "scorpio/sagittarius",
    "degreeStart": 234.5,
    "degreeEnd": 240.117,
    "geneKeyId": "gk-14",
    "keywords": [
      "prosperity",
      "dream work",
      "and inspiration"
    ],
    "coreTheme": "Generating resources to empower direction in life.",
    "hdDefinition": "The accumulation and retention of power through skilled interaction, coupling grace with control.",
    "highExpression": "Creating prosperity by following dreams and doing work you love. Skillfully managing resources to empower others and support innovation and creativity.",
    "lowExpression": "Fear that you won't be able to make dreams come true, feeling stuck doing things you hate for money. Getting trapped in compromise and scarcity thinking.",
    "affirmations": [
      "I am prosperous",
      "My life is abundant",
      "I make money doing what I love"
    ],
    "description": "Empowers direction for individual and humanity through distribution of available resources. Makes sure mutation is supported and shows how to invest resources to expand horizons. Fertile power at its most exalted. Creates prosperity by doing work you love.",
    "image": "/images/human-design/gates/gate-14.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-15",
    "type": "hd-gate",
    "name": "Gate 15: The Wild Heart",
    "symbol": "15",
    "gateNumber": 15,
    "iChingHexagram": 15,
    "iChingName": "Extremes",
    "centerId": "g-center",
    "channelGateId": "gate-5",
    "tropicalSignId": "gemini/cancer",
    "degreeStart": 80.75,
    "degreeEnd": 86.375,
    "geneKeyId": "gk-15",
    "keywords": [
      "wild",
      "personal rhythm",
      "radical authenticity"
    ],
    "coreTheme": "Loving humanity, embracing different rhythms, and extremes of behavior.",
    "hdDefinition": "The quality of behavior which expresses the proper balance between extremes.",
    "highExpression": "Magnetic acceptance of all human diversity",
    "lowExpression": "Either dull conformity or chaotic extremes",
    "affirmations": [],
    "description": "Love of humanity with capacity to accept and find place in society for full spectrum of human behavior. Lack of fixed pattern ensures each person can make contribution through diverse ways love exists in world. Magnetic quality that attracts diversity.",
    "image": "/images/human-design/gates/gate-15.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-16",
    "type": "hd-gate",
    "name": "Gate 16: The Mastery Maven",
    "symbol": "16",
    "gateNumber": 16,
    "iChingHexagram": 16,
    "iChingName": "Skills",
    "centerId": "throat-center",
    "channelGateId": "gate-48",
    "tropicalSignId": "gemini",
    "degreeStart": 65.75,
    "degreeEnd": 71.367,
    "geneKeyId": "gk-16",
    "keywords": [
      "talent",
      "skill",
      "enthusiasm",
      "and your commitment to mastery"
    ],
    "coreTheme": "To skillfully master something.",
    "hdDefinition": "The great art of enriching life by the harmonic channeling of energy.",
    "highExpression": "Masterful skill expression that inspires others",
    "lowExpression": "Indifferent to skills or perfectionist paralysis",
    "affirmations": [],
    "description": "Eventually makes mark in world as keen critic, skilled performer, or through talent and enthusiasm for living. Needs to identify with skill, dedicate to repetition of pattern, focus on practice until reaches mastery that transcends skill itself.",
    "image": "/images/human-design/gates/gate-16.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-17",
    "type": "hd-gate",
    "name": "Gate 17: The Powerful Opinion",
    "symbol": "17",
    "gateNumber": 17,
    "iChingHexagram": 17,
    "iChingName": "Opinion",
    "centerId": "ajna-center",
    "channelGateId": "gate-62",
    "tropicalSignId": "aries",
    "degreeStart": 5.625,
    "degreeEnd": 11.25,
    "geneKeyId": "gk-17",
    "keywords": [
      "your opinions",
      "creating harmonious solutions",
      "and logic"
    ],
    "coreTheme": "Fear of Challenge.",
    "hdDefinition": "The ancient law that those who wish to rule must know how to serve.",
    "highExpression": "Far-sighted opinions that serve collective understanding",
    "lowExpression": "Dogmatic opinions or fear of expressing views",
    "affirmations": [],
    "description": "Looks for one concept or opinion among many that everyone can trust - one that will survive both testing and criticism and calm fears about future. Designed to structure answer into concept or workable pattern through visual pattern recognition.",
    "image": "/images/human-design/gates/gate-17.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-18",
    "type": "hd-gate",
    "name": "Gate 18: The Wholeness Doctor",
    "symbol": "18",
    "gateNumber": 18,
    "iChingHexagram": 18,
    "iChingName": "Correction",
    "centerId": "spleen-center",
    "channelGateId": "gate-58",
    "tropicalSignId": "libra",
    "degreeStart": 165.125,
    "degreeEnd": 170.75,
    "geneKeyId": "gk-18",
    "keywords": [
      "healing",
      "wholeness",
      "and clearly seeing"
    ],
    "coreTheme": "Fear of authority.",
    "hdDefinition": "The vigilance and determination to uphold and defend basic and fundamental human rights.",
    "highExpression": "Loving correction that sees wholeness",
    "lowExpression": "Destructive judgment or authority fear",
    "affirmations": [],
    "description": "Enjoys discovering, naming and challenging what needs correcting. When experiences dissatisfaction, often indicates loss of vitality. Deep concern for human rights and what keeps society healthy through vigilant awareness.",
    "image": "/images/human-design/gates/gate-18.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-19",
    "type": "hd-gate",
    "name": "Gate 19: The Sensitive Soul",
    "symbol": "19",
    "gateNumber": 19,
    "iChingHexagram": 19,
    "iChingName": "Wanting",
    "centerId": "root-center",
    "channelGateId": "gate-49",
    "tropicalSignId": "aquarius",
    "degreeStart": 273.875,
    "degreeEnd": 279.5,
    "geneKeyId": "gk-19",
    "keywords": [
      "sensitivity",
      "being attuned to needs",
      "and community empowerment"
    ],
    "coreTheme": "The pressure to be sensitive to basic needs.",
    "hdDefinition": "That all things are interrelated is apparent and manifested through the action of approach.",
    "highExpression": "Being sensitive to needs of others while maintaining proper self-care. Believing individuals, communities, and collective thrive when basic needs are met. Loving being around emotionally healthy people.",
    "lowExpression": "Not understanding your own needs and putting your needs last. When not taking time for own needs, easily becoming overwhelmed by energetic input of others.",
    "affirmations": [
      "I have a kismet connection with animals",
      "Every action is an attempt to meet a need",
      "I am a portal between the conscious and unconscious"
    ],
    "description": "Fuels two essential human mandates - need to have access to basic resources like food and shelter, and need for spirit. These mandates set up to interact or bond with others in specific ways. When everyone has enough, experience life as one healthy community.",
    "image": "/images/human-design/gates/gate-19.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-20",
    "type": "hd-gate",
    "name": "Gate 20: The Voice of Alchemy",
    "symbol": "20",
    "gateNumber": 20,
    "iChingHexagram": 20,
    "iChingName": "Now",
    "centerId": "throat-center",
    "channelGateId": "gate-57",
    "tropicalSignId": "gemini",
    "degreeStart": 50.625,
    "degreeEnd": 56.25,
    "geneKeyId": "gk-20",
    "keywords": [
      "contemplation",
      "alchemy",
      "and the present moment"
    ],
    "coreTheme": "Instantaneous clarity and action.",
    "hdDefinition": "Recognition and awareness in the now which transforms understanding into right action.",
    "highExpression": "Being present and speaking truth in the now. Trusting that everything needed to know exists in the present moment and that highest potential will be revealed in Divine Timing.",
    "lowExpression": "Making choices according to the mind instead of inner wisdom and inability to be still in the present moment. Giving into pressure to give unsolicited or incorrect advice.",
    "affirmations": [
      "I live in the present moment",
      "I speak truth in the now",
      "I am self assured"
    ],
    "description": "A purely existential gate that keeps you focused in the present, and supports your capacity to survive as yourself. When your expression is properly timed, awareness will be transformed into words or actions that can impact people around you. Has the capacity to transform understanding into right action through present moment awareness.",
    "image": "/images/human-design/gates/gate-20.png",
    "circuitType": "Integration"
  },
  {
    "id": "gate-21",
    "type": "hd-gate",
    "name": "Gate 21: The Resource Manager",
    "symbol": "21",
    "gateNumber": 21,
    "iChingHexagram": 21,
    "iChingName": "Hunter/Huntress",
    "centerId": "heart-center",
    "channelGateId": "gate-45",
    "tropicalSignId": "aries",
    "degreeStart": 9.5,
    "degreeEnd": 15.117,
    "geneKeyId": "gk-21",
    "keywords": [
      "control",
      "taking charge",
      "and managing resources"
    ],
    "coreTheme": "To be in control of circumstances.",
    "hdDefinition": "The justified and necessary use of power in overcoming deliberate and persistent interference.",
    "highExpression": "Understanding, respecting, and valuing all resources. Energy management balancing yin and yang, masculine and feminine, push and pull. Easily managing mundane resources of family, community, or company in empowering way.",
    "lowExpression": "Controlling others to appease ego, fearing own power and authority, or having feelings of low self-worth due to people-pleasing.",
    "affirmations": [
      "I understand and respect the value of all resources",
      "I control what I can and let go of the rest",
      "I balance masculine and feminine energy with ease"
    ],
    "description": "Needs to be in control of its domain. To apply strength and will of ego to ensure Tribal survival, must have control over something or someone. In modern world, energy translates into responsibilities of police, managing director or president.",
    "image": "/images/human-design/gates/gate-21.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-22",
    "type": "hd-gate",
    "name": "Gate 22: The Graceful Gaze",
    "symbol": "22",
    "gateNumber": 22,
    "iChingHexagram": 22,
    "iChingName": "Openness",
    "centerId": "emotional solar plexus-center",
    "channelGateId": "gate-12",
    "tropicalSignId": "pisces",
    "degreeStart": 309.5,
    "degreeEnd": 315.125,
    "geneKeyId": "gk-22",
    "keywords": [
      "grace",
      "beauty",
      "and emotional understanding"
    ],
    "coreTheme": "Fear of Silence.",
    "hdDefinition": "A quality of behavior best suited in handling mundane and trivial situations.",
    "highExpression": "Offering grace to yourself and others, seeing full range of emotions as simply human. Recognizing the beauty and abundance in all emotional experiences including difficult ones.",
    "lowExpression": "Believing you don't deserve beauty, love, or grace in life. Repressing emotions, living from emotional reactivity and ignoring responsibility through blame and victimization.",
    "affirmations": [
      "I have everything I need to thrive",
      "I transform shame with grace",
      "I am open to the full spectrum of my emotions"
    ],
    "description": "Combines potential for emotional openness through listening with social grace and charm highly attractive to others when in right mood. When mood changes, dramatically different side may be experienced. Offers grace to yourself and others in all emotional states.",
    "image": "/images/human-design/gates/gate-22.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-23",
    "type": "hd-gate",
    "name": "Gate 23: The Alchemical Wordsmith",
    "symbol": "23",
    "gateNumber": 23,
    "iChingHexagram": 23,
    "iChingName": "Assimilation",
    "centerId": "throat-center",
    "channelGateId": "gate-43",
    "tropicalSignId": "taurus",
    "degreeStart": 48.867,
    "degreeEnd": 54.5,
    "geneKeyId": "gk-23",
    "keywords": [
      "words",
      "speaking the truth",
      "and transformation"
    ],
    "coreTheme": "Communicating individual insights.",
    "hdDefinition": "Amorality. The awareness and understanding which leads to the acceptance of diversity.",
    "highExpression": "Using voice to communicate radical ideas, being recognized for ability to initiate transformation with words. Getting to the point, simplifying complex ideas, not wasting time.",
    "lowExpression": "Holding back out of fear of being too weird, worrying people don't care what you have to say. Talking at people who aren't ready to listen instead of trusting right timing.",
    "affirmations": [
      "I make things simple and clear",
      "I get right to the point and don't mince words",
      "My words are magic"
    ],
    "description": "Where inspiration as inner knowing is finally translated into language. Amorality, acceptance of diversity, and ability to cut through mental intolerance opens way for mutation to take hold. Communicates radical ideas and initiates transformation with words alone.",
    "image": "/images/human-design/gates/gate-23.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-24",
    "type": "hd-gate",
    "name": "Gate 24: The Silent Mystic",
    "symbol": "24",
    "gateNumber": 24,
    "iChingHexagram": 24,
    "iChingName": "Rationalization",
    "centerId": "ajna-center",
    "channelGateId": "gate-61",
    "tropicalSignId": "taurus",
    "degreeStart": 35.625,
    "degreeEnd": 41.25,
    "geneKeyId": "gk-24",
    "keywords": [
      "silence",
      "wise rationalization",
      "and mental renewal"
    ],
    "coreTheme": "Fear of ignorance.",
    "hdDefinition": "The natural and spontaneous process of transformation and renewal.",
    "highExpression": "Using silence wisely for transformation and renewal, allowing mystical inspiration to become rational understanding. Mastering the pause between giving and receiving.",
    "lowExpression": "Avoiding silence with buffering or unnecessary noise, beating yourself up for needing to revisit ideas repeatedly. Struggling to find balance between giving and receiving.",
    "affirmations": [
      "I make space for silence",
      "I trust my knowing",
      "I love to find the sacred by looking at things from many angles"
    ],
    "description": "Function is to take unique inspiration of Gate 61 and turn it into rational concept for communication. Returns to same territory repeatedly, pondering thought considered inspiring until brought into form. Creates transformation through silence and contemplation.",
    "image": "/images/human-design/gates/gate-24.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-25",
    "type": "hd-gate",
    "name": "Gate 25: The Loving Soul",
    "symbol": "25",
    "gateNumber": 25,
    "iChingHexagram": 25,
    "iChingName": "The Spirit of the Self",
    "centerId": "g-center",
    "channelGateId": "gate-51",
    "tropicalSignId": "pisces",
    "degreeStart": 0,
    "degreeEnd": 5.625,
    "geneKeyId": "gk-25",
    "keywords": [
      "unconditional love",
      "acceptance",
      "and open hearted living"
    ],
    "coreTheme": "Unconditional love and retaining innocence despite circumstances.",
    "hdDefinition": "The perfection of action through uncontrived and spontaneous nature.",
    "highExpression": "Embodying unconditional love for self and others without discrimination. Believing that divine love is the fabric of the universe and that every person is worthy of it, using acceptance to transform all experiences.",
    "lowExpression": "Judging self and others harshly, experiencing self-rejection and self-hatred. Shutting down when trauma creates impressions of being unworthy of love or becoming constricted in heart expression.",
    "affirmations": [
      "I love myself and others without conditions",
      "My heart is open and I thrive",
      "I move forward by loving and accepting what is"
    ],
    "description": "Love flows out of fully accepting and living surrendered to one's form. Gate of higher self with pivotal role to turn people toward individuation. Innocence not designed to bring love in specific way, but to love without discrimination. Mystical potential of this love is transcendent and universal, embodying the spirit of unconditional acceptance.",
    "image": "/images/human-design/gates/gate-25.png",
    "circuitType": "Individual Centering"
  },
  {
    "id": "gate-26",
    "type": "hd-gate",
    "name": "Gate 26: The Sacred Salesman",
    "symbol": "26",
    "gateNumber": 26,
    "iChingHexagram": 26,
    "iChingName": "The Taming Power of the Great – The Egoist",
    "centerId": "heart-center",
    "channelGateId": "gate-44",
    "tropicalSignId": "sagittarius",
    "degreeStart": 240.625,
    "degreeEnd": 246.25,
    "geneKeyId": "gk-26",
    "keywords": [
      "seeing a brighter future",
      "selling",
      "and integrity"
    ],
    "coreTheme": "To be the best.",
    "hdDefinition": "The maximization of the power of memory applied to the nurturing of continuity.",
    "highExpression": "Being a champion for dreams that come true. Trusting in abundance of life and empowered to sell a brighter future to tribe with integrity.",
    "lowExpression": "Manipulating or controlling others for own gain. Using memory manipulation and selective remembering to persuade or distract from fears.",
    "affirmations": [
      "My integrity is my most valuable asset",
      "Selling is service when it is in everyone's best interest",
      "I trust in the abundance of life and am unattached to outcomes"
    ],
    "description": "Where memory is manipulated or past selectively remembered to persuade or distract from fears. Line between truth and lie blurs, and potential and possibility transformed into reality and 'sold' to public for a price. Natural salesperson actually expected to exaggerate.",
    "image": "/images/human-design/gates/gate-26.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-27",
    "type": "hd-gate",
    "name": "Gate 27: The Empowered Caretaker",
    "symbol": "27",
    "gateNumber": 27,
    "iChingHexagram": 27,
    "iChingName": "Caring",
    "centerId": "sacral-center",
    "channelGateId": "gate-50",
    "tropicalSignId": "taurus",
    "degreeStart": 30,
    "degreeEnd": 35.625,
    "geneKeyId": "gk-27",
    "keywords": [
      "radical self-responsibility",
      "caretaking",
      "and nurturing"
    ],
    "coreTheme": "Nourishment and protection for survival.",
    "hdDefinition": "The enhancement of the quality and the substance of all activities through caring.",
    "highExpression": "Finding balance between self-care and caring for others. Taking responsibility for own values, needs, beliefs, thoughts, feelings, and actions to ensure healthy relationships and caring from overflow.",
    "lowExpression": "Taking incorrect responsibility for other people's needs. Self-sacrificing and caring for others to prove worthiness of safety, love, belonging, and support.",
    "affirmations": [
      "I give from the overflow",
      "My boundaries are magic",
      "I take care of others with deep love and joy"
    ],
    "description": "Energy focused on maintaining and enhancing quality of life through power to care for weak, sick and young. Tremendous potential for altruism present, exemplified in life of Mother Teresa. Role is to nourish and nurture through power of compassion.",
    "image": "/images/human-design/gates/gate-27.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-28",
    "type": "hd-gate",
    "name": "Gate 28: The Darkness Whisperer",
    "symbol": "28",
    "gateNumber": 28,
    "iChingHexagram": 28,
    "iChingName": "The Game Player",
    "centerId": "spleen-center",
    "channelGateId": "gate-38",
    "tropicalSignId": "scorpio",
    "degreeStart": 212,
    "degreeEnd": 217.617,
    "geneKeyId": "gk-28",
    "keywords": [
      "risk",
      "shadow",
      "and courage"
    ],
    "coreTheme": "Fear of death and purposelessness.",
    "hdDefinition": "The transitoriness of power and influence.",
    "highExpression": "Facing darkness of life with courage and tenacity, finding deep joy in overcoming obstacles. Using fear as wisdom and allowing it to guide conscious risk-taking.",
    "lowExpression": "Fear of dying before finding purpose in life, avoiding stillness and silence. Attempting to dispel fear with risky behavior, getting lost in depression and meaninglessness.",
    "affirmations": [
      "I face the darkness of life with courage and tenacity",
      "I transform challenges into meaning and purpose",
      "I alchemize shadows into light"
    ],
    "description": "Deepest fear is that life might end before knowing what makes it worth living. Energy stubbornly focused on listening with awareness to intuit which risks make you feel alive. Faces darkness of life with courage and finds meaning in struggle.",
    "image": "/images/human-design/gates/gate-28.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-29",
    "type": "hd-gate",
    "name": "Gate 29: The Faithful Devotee￼",
    "symbol": "29",
    "gateNumber": 29,
    "iChingHexagram": 29,
    "iChingName": "Perseverance",
    "centerId": "sacral-center",
    "channelGateId": "gate-46",
    "tropicalSignId": "leo/virgo",
    "degreeStart": 135.125,
    "degreeEnd": 140.75,
    "geneKeyId": "gk-29",
    "keywords": [
      "devotion",
      "rapture",
      "and tenacious commitment"
    ],
    "coreTheme": "Committing to an experience purely for experience’s sake.",
    "hdDefinition": "The deep within the deep. Persistence despite difficulties has its inevitable rewards.",
    "highExpression": "Being faithful and devoted to things that truly matter, commitment from the heart and what lights you up, magical medicine when coming from love",
    "lowExpression": "Feeling burned out or overcommitted, trapped in cycles of proving worthiness, staying devoted to things that don't matter, depletion and frustration",
    "affirmations": [],
    "description": "Potential as constant affirmation of life. When answers yes, commits energy to something new and will persevere through whatever cycle of discovery brings. Perseverance is cyclical - what committed to one day may no longer be of interest the next. The faithful devotee committed to things that matter.",
    "image": "/images/human-design/gates/gate-29.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-30",
    "type": "hd-gate",
    "name": "Gate 30: The Deep Feeler",
    "symbol": "30",
    "gateNumber": 30,
    "iChingHexagram": 30,
    "iChingName": "The Clinging Fire – Feelings",
    "centerId": "emotional solar plexus-center",
    "channelGateId": "gate-41",
    "tropicalSignId": "aquarius/pisces",
    "degreeStart": 290.75,
    "degreeEnd": 296.375,
    "geneKeyId": "gk-30",
    "keywords": [
      "feelings",
      "desire",
      "intensity",
      "and emotions"
    ],
    "coreTheme": "Fear of the fates.",
    "hdDefinition": "Freedom recognized as an illusion and limitation accepted as a fate",
    "highExpression": "Reveling in intensity of desire and emotion, knowing full spectrum of feelings are natural, processing depths of desire through lens of human emotion",
    "lowExpression": "Destructive sensation and intensity seeking, losing faith in life, disconnection from desire, insatiable craving without surrender to emotional spectrum",
    "affirmations": [],
    "description": "Gate of Fates teaches that life is not what we expect it to be but what we allow it to be. Experiences conceived from desire that meets life on highs and lows of emotional wave. Desire can feel like obsessive hunger weaving yearnings of different lives together. The deep feeler reveling in emotional intensity.",
    "image": "/images/human-design/gates/gate-30.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-31",
    "type": "hd-gate",
    "name": "Gate 31: The Natural Leader",
    "symbol": "31",
    "gateNumber": 31,
    "iChingHexagram": 31,
    "iChingName": "Leading",
    "centerId": "throat-center",
    "channelGateId": "gate-7",
    "tropicalSignId": "leo",
    "degreeStart": 122,
    "degreeEnd": 127.617,
    "geneKeyId": "gk-31",
    "keywords": [
      "leadership",
      "collective vision",
      "influence",
      "equanimity"
    ],
    "coreTheme": "Influential leadership.",
    "hdDefinition": "The law of friction, whether active or passive, that engenders transference and thus influence.",
    "highExpression": "Humble, influential leadership for collective good",
    "lowExpression": "Arrogant dominance or abdication of leadership",
    "affirmations": [],
    "description": "Designed to be influential through democratic, collegial leadership. Provides vision for new direction and shows others how to achieve it rather than doing it for them. Voice must be backed by energy of majority to be heard.",
    "image": "/images/human-design/gates/gate-31.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-32",
    "type": "hd-gate",
    "name": "Gate 32: The Success Oracle",
    "symbol": "32",
    "gateNumber": 32,
    "iChingHexagram": 32,
    "iChingName": "Continuity",
    "centerId": "spleen-center",
    "channelGateId": "gate-54",
    "tropicalSignId": "libra",
    "degreeStart": 200.75,
    "degreeEnd": 206.367,
    "geneKeyId": "gk-32",
    "keywords": [
      "change",
      "success and failure",
      "and foresight"
    ],
    "coreTheme": "Fear of failure.",
    "hdDefinition": "The only thing which endures is change.",
    "highExpression": "Guiding community into its highest potential. Seeing the big picture, sensing what needs to change, and being in healthy relationship with both success and failure to lead family, friends, and community into well-being.",
    "lowExpression": "Using fear as fuel for unhealthy relationships and community dynamics such as codependency, hierarchy, and pressuring others to conform. Isolating from family, friends, or community due to belief that you must go through life alone.",
    "affirmations": [
      "I know what it takes to succeed",
      "I love how life is always changing",
      "Success is when everyone in the community is thriving"
    ],
    "description": "Awareness focused on constant evaluation as instinctive recognition of what can and cannot be transformed. Underlying fear of failure can put brakes on runaway ambition. Ability to adapt yet maintain true nature is Spleen's contribution to material continuity of Tribe.",
    "image": "/images/human-design/gates/gate-32.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-33",
    "type": "hd-gate",
    "name": "Gate 33: The Contemplative Witness",
    "symbol": "33",
    "gateNumber": 33,
    "iChingHexagram": 33,
    "iChingName": "Privacy",
    "centerId": "throat-center",
    "channelGateId": "gate-13",
    "tropicalSignId": "leo",
    "degreeStart": 116.375,
    "degreeEnd": 122,
    "geneKeyId": "gk-33",
    "keywords": [
      "contemplation",
      "privacy",
      "memories",
      "and being wise"
    ],
    "coreTheme": "Sharing lessons of the past.",
    "hdDefinition": "Active withdrawal and the transformation of a weak position into a strength.",
    "highExpression": "Making ample space for reflection, seeing beauty in all things including painful memories, alchemizing experiences into wisdom through contemplation",
    "lowExpression": "Isolation or hiding from world, acting from fear or anger, forcing wisdom onto others prematurely, throwing past into others' faces",
    "affirmations": [],
    "description": "Marks end of cycle with built-in moment of silence for considering every aspect of experience. Need to be alone comes from moment of uncertainty between completed experience and new one, pause allowing reflection on what to take forward while renewing strength. The contemplative witness processing past lessons.",
    "image": "/images/human-design/gates/gate-33.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-34",
    "type": "hd-gate",
    "name": "Gate 34: The Sovereign",
    "symbol": "34",
    "gateNumber": 34,
    "iChingHexagram": 34,
    "iChingName": "Power",
    "centerId": "sacral-center",
    "channelGateId": "gate-10",
    "tropicalSignId": "sagittarius",
    "degreeStart": 215.625,
    "degreeEnd": 221.25,
    "geneKeyId": "gk-34",
    "keywords": [
      "sovereignty",
      "empowerment",
      "and steady vision"
    ],
    "coreTheme": "Pure power to empower.",
    "hdDefinition": "Power is only great when its display or use serves the common good.",
    "highExpression": "Sovereignty, empowerment, and steady vision. Cultivating inner strength, faith, and flow to make visions reality while serving the common good through displays of authentic power.",
    "lowExpression": "Pushing or forcing dreams into reality. Lack of clear vision making the energy feel drained of time, energy, and resources. Using power in selfish or destructive ways.",
    "affirmations": [
      "I am sovereign",
      "All things are possible",
      "I am powerful AF"
    ],
    "description": "A potent and impressive source of energy that empowers us toward individuation, displaying and celebrating our uniqueness in the world. Two qualities distinguish this gate from the other eight in the Sacral: its asexuality and the unavailability of its power to others. Provides pure Sacral power for integration and collective empowerment.",
    "image": "/images/human-design/gates/gate-34.png",
    "circuitType": "Integration"
  },
  {
    "id": "gate-35",
    "type": "hd-gate",
    "name": "Gate 35: The Hungry Heart",
    "symbol": "35",
    "gateNumber": 35,
    "iChingHexagram": 35,
    "iChingName": "Change",
    "centerId": "throat-center",
    "channelGateId": "gate-36",
    "tropicalSignId": "gemini",
    "degreeStart": 65.625,
    "degreeEnd": 71.25,
    "geneKeyId": "gk-35",
    "keywords": [
      "adventure",
      "emotional experiences",
      "and learning"
    ],
    "coreTheme": "Progress through experience.",
    "hdDefinition": "By design, progress cannot exist in a vacuum and is dependent on interaction.",
    "highExpression": "Living life as great adventure, knowing curiosity is magic, eagerly waiting for life's lessons through adventure, courage in experiencing life fully",
    "lowExpression": "Becoming bored and impatient, unsatisfied hunger leading to overdoing with substances or behaviors, struggling to learn from life due to emotional buffers",
    "affirmations": [],
    "description": "Driven by restless curiosity and high expectations to explore new horizons for sheer exhilaration of doing it, but not alone. Voice says \"I feel\" and what usually feels is desire for change. Voice of impersonal, relational experience. The hungry heart seeking adventure and emotional experiences.",
    "image": "/images/human-design/gates/gate-35.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-36",
    "type": "hd-gate",
    "name": "Gate 36: The Compassionate Sage",
    "symbol": "36",
    "gateNumber": 36,
    "iChingHexagram": 36,
    "iChingName": "Crisis",
    "centerId": "emotional solar plexus-center",
    "channelGateId": "gate-35",
    "tropicalSignId": "pisces",
    "degreeStart": 315.125,
    "degreeEnd": 320.75,
    "geneKeyId": "gk-36",
    "keywords": [
      "compassion",
      "being human",
      "gentleness",
      "and emotional wisdom"
    ],
    "coreTheme": "Fear of inadequacy.",
    "hdDefinition": "The rule of cycles in which decline is a natural but not enduring stage.",
    "highExpression": "Being compassionate with self and others, seeing humanity in everyone, harnessing empathy during emotional crises, soothing unnecessary suffering",
    "lowExpression": "Lacking compassion, beating self up, holding impossible standards, feelings of inadequacy, inability to relax, creating emotional drama",
    "affirmations": [],
    "description": "Place where fears of vulnerability and inexperience are resolved or transformed into experience through emotional crises. Creates and meets challenges of change and growth through emotional crises. Restrains strong hope-to-pain wave driving human experience toward change. The compassionate sage cultivating understanding.",
    "image": "/images/human-design/gates/gate-36.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-37",
    "type": "hd-gate",
    "name": "Gate 37: The Boundaries Master",
    "symbol": "37",
    "gateNumber": 37,
    "iChingHexagram": 37,
    "iChingName": "Friendship",
    "centerId": "emotional solar plexus-center",
    "channelGateId": "gate-40",
    "tropicalSignId": "pisces",
    "degreeStart": 335.75,
    "degreeEnd": 341.367,
    "geneKeyId": "gk-37",
    "keywords": [
      "holding people together",
      "family",
      "equality",
      "and emotional resources"
    ],
    "coreTheme": "Fear of tradition.",
    "hdDefinition": "The manifestation macro- and micro-cosmically of the organic nature of communities.",
    "highExpression": "Having strong family bonds through strong communication and healthy boundaries. Believing all people are worthy of respect and treating everyone as valuable part of family, community, or friend circle.",
    "lowExpression": "Sacrificing yourself to make sure family stays together or hiding behind emotions. When not taking responsibility for emotions, projecting emotions onto others by being cruel or mean on purpose.",
    "affirmations": [
      "I value family, community, and togetherness",
      "I am a relational magician",
      "I maintain clear and strong boundaries"
    ],
    "description": "Most communal gate in BodyGraph. When power recognized by others, can hold both family and community together with warmth, friendliness and nurturing nature. Ability to make emotional connection with others through touch and sensitivity sensing their accessibility.",
    "image": "/images/human-design/gates/gate-37.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-38",
    "type": "hd-gate",
    "name": "Gate 38: The Purposeful Fighter",
    "symbol": "38",
    "gateNumber": 38,
    "iChingHexagram": 38,
    "iChingName": "Fighter",
    "centerId": "root-center",
    "channelGateId": "gate-28",
    "tropicalSignId": "capricorn",
    "degreeStart": 251.25,
    "degreeEnd": 256.875,
    "geneKeyId": "gk-38",
    "keywords": [
      "perseverance",
      "making meaning",
      "struggle",
      "and being discerning"
    ],
    "coreTheme": "Pressure to find or struggle for purpose in life. In this context, pressure is not necessarily a problem. It’s really about acting from the amount of pressure that is correct for you.",
    "hdDefinition": "The ability to preserve individual integrity through opposition to detrimental forces.",
    "highExpression": "Fighting for a purpose and enjoying the pressure to evolve. Finding the right amount of struggle that leads to meaning rather than suffering, discerning what is worth fighting for.",
    "lowExpression": "Fighting for the sake of fighting, believing life is meant to be an unhealthy struggle. Putting unnecessary pressure on yourself and forgetting your divine nature.",
    "affirmations": [
      "I have a warrior's spirit",
      "I love a good challenge",
      "I fight for the things that are worth fighting for"
    ],
    "description": "Exerts pressure to discover value of one's life. Must be reason to exist, purpose, and something to love that elevates struggle beyond surviving. Capable of forcefully confronting adversity. Fights for things that have meaning and purpose.",
    "image": "/images/human-design/gates/gate-38.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-39",
    "type": "hd-gate",
    "name": "Gate 39: The Sacred Provocateur￼",
    "symbol": "39",
    "gateNumber": 39,
    "iChingHexagram": 39,
    "iChingName": "Provocation",
    "centerId": "root-center",
    "channelGateId": "gate-55",
    "tropicalSignId": "cancer",
    "degreeStart": 90,
    "degreeEnd": 95.625,
    "geneKeyId": "gk-39",
    "keywords": [
      "being provocative",
      "clarity",
      "and being a force of transformation"
    ],
    "coreTheme": "Pressure to find passion and spirit in life and to emote. In this context, pressure is not necessarily a problem. It’s really about acting from the amount of pressure that is correct for you.",
    "hdDefinition": "The value of obstruction in provoking analysis, assessment, and reevaluation.",
    "highExpression": "Using pressure to find passion and spirit in life, taking full responsibility for emotions while allowing others to do the same. Provoking heightened states of emotional and spiritual awareness.",
    "lowExpression": "Taking responsibility for other people's emotions and being a people pleaser. Intentionally pushing buttons in revenge or as attempt to hurt people.",
    "affirmations": [
      "I am provocative AF",
      "I love to be mischievous",
      "I push buttons in those that are ready for transformation"
    ],
    "description": "Fueled by Root Center, pressure to provoke evolving emotional awareness of spirit into revealing itself. Individual through 39th gate provokes mutative potential within 55th gate to release spirit consciousness. Sacred gift is provoking heightened states of awareness.",
    "image": "/images/human-design/gates/gate-39.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-40",
    "type": "hd-gate",
    "name": "Gate 40: The Liberated Altruist￼",
    "symbol": "40",
    "gateNumber": 40,
    "iChingHexagram": 40,
    "iChingName": "Aloneness",
    "centerId": "heart-center",
    "channelGateId": "gate-37",
    "tropicalSignId": "virgo",
    "degreeStart": 155.75,
    "degreeEnd": 161.367,
    "geneKeyId": "gk-40",
    "keywords": [
      "service",
      "community",
      "boundaries",
      "balance",
      "work and rest"
    ],
    "coreTheme": "The will to provide.",
    "hdDefinition": "The point of transition between struggle and liberation.",
    "highExpression": "Balancing heart of service with need for alone time, rest and relaxation. Understanding boundaries are beautiful and being empowered to dedicate vast amounts of energy in service to community with proper boundaries in place.",
    "lowExpression": "Using force rather than natural energy to get things done, especially for others. Believing serving others is how one proves worth in society and having weak or porous boundaries leading to burnout from over-giving.",
    "affirmations": [
      "I balance my heart of service with deep self care",
      "My boundaries are beautiful",
      "I give when my heart is truly in it"
    ],
    "description": "One of three gates of aloneness carrying sense of being alone even when in group. This aloneness is beginning of individuation process - need to separate from Tribe. Desire within for wholeness expressed as strong independence.",
    "image": "/images/human-design/gates/gate-40.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-41",
    "type": "hd-gate",
    "name": "Gate 41: The Patient Dreamer",
    "symbol": "41",
    "gateNumber": 41,
    "iChingHexagram": 41,
    "iChingName": "Contraction",
    "centerId": "root-center",
    "channelGateId": "gate-30",
    "tropicalSignId": "aquarius",
    "degreeStart": 270,
    "degreeEnd": 275.625,
    "geneKeyId": "gk-41",
    "keywords": [
      "hopes and dreams",
      "felt experiences",
      "transformation",
      "and divine timing"
    ],
    "coreTheme": "Pressure to feel and the desire for new experience. In this context, pressure is not necessarily a problem. It’s really about acting from the amount of pressure that is correct for you.",
    "hdDefinition": "The limitation of resources which maximizes development of potential.",
    "highExpression": "Honoring hopes and dreams, watching them evolve through fulfillment, seeing visions as trustworthy source of transformation, using mind as playground of creativity",
    "lowExpression": "Never taking steps toward dreams, staying stuck in fantasies, ignoring divine timing due to fear, stopping dreams due to nervousness about action",
    "affirmations": [],
    "description": "Initiates uniquely human experiential way as hunger to experience emotion. Begins with desire to interact with others through feelings. Manifests as vague expectation, sexual fantasy or restless need to experience something new with someone. The patient dreamer honoring hopes and dreams.",
    "image": "/images/human-design/gates/gate-41.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-42",
    "type": "hd-gate",
    "name": "Gate 42: The Celebration Doula",
    "symbol": "42",
    "gateNumber": 42,
    "iChingHexagram": 42,
    "iChingName": "Growth",
    "centerId": "sacral-center",
    "channelGateId": "gate-53",
    "tropicalSignId": "aries",
    "degreeStart": 20.75,
    "degreeEnd": 26.367,
    "geneKeyId": "gk-42",
    "keywords": [
      "celebration",
      "closing loops",
      "and seeing things through"
    ],
    "coreTheme": "Closing cycles and bringing things to an end.",
    "hdDefinition": "The expansion of the resources which maximizes the development of full potential.",
    "highExpression": "Seeing things through to completion and celebrating accomplishments, believing the future is bright with possibilities and using that as fuel for bringing projects to fruition",
    "lowExpression": "Unhealthy attachment, repeating patterns, trying to control outcomes through rebellion or self-sabotage, attachment to finishing everything started",
    "affirmations": [],
    "description": "Tenacity to stay with cycle to maximize its inherent potential. Abstract's cyclical process generates growth and balanced development using humanity's collected experiences to create foundation for future progress. Each cycle builds on lessons learned from last. The celebration doula that brings projects to full potential.",
    "image": "/images/human-design/gates/gate-42.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-43",
    "type": "hd-gate",
    "name": "Gate 43: The Listener Within",
    "symbol": "43",
    "gateNumber": 43,
    "iChingHexagram": 43,
    "iChingName": "Insight",
    "centerId": "ajna-center",
    "channelGateId": "gate-23",
    "tropicalSignId": "scorpio",
    "degreeStart": 228.867,
    "degreeEnd": 234.5,
    "geneKeyId": "gk-43",
    "keywords": [
      "inner listening",
      "self-awareness",
      "and breakthroughs"
    ],
    "coreTheme": "Fear of rejection.",
    "hdDefinition": "In order for achievement to be maintained a new order must be fairly established.",
    "highExpression": "Being a hotline for universal wisdom, tuning into ideas that create breakthroughs. Staying true to inner wisdom and making space for radical transformation to occur.",
    "lowExpression": "Listening to others instead of inner wisdom, being clouded by external influences. Worrying about rejection and doubting your inner truth and insights.",
    "affirmations": [
      "I turn ideas into breakthrough",
      "I think outside the box",
      "I am a hotline of magic"
    ],
    "description": "Gate of inner ear that only listens to own unique inner voice. Transforms rational inner knowing into Individual insight through spontaneous breakthrough to new perspective. Like being a hotline for Universal wisdom and truth.",
    "image": "/images/human-design/gates/gate-43.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-44",
    "type": "hd-gate",
    "name": "Gate 44: The Pattern Interrupter",
    "symbol": "44",
    "gateNumber": 44,
    "iChingHexagram": 44,
    "iChingName": "Alertness",
    "centerId": "spleen-center",
    "channelGateId": "gate-26",
    "tropicalSignId": "scorpio",
    "degreeStart": 206.375,
    "degreeEnd": 212,
    "geneKeyId": "gk-44",
    "keywords": [
      "seeing patterns",
      "the past",
      "transformation",
      "and possibility"
    ],
    "coreTheme": "Fear of the past.",
    "hdDefinition": "The success of any interaction is based on the absence of any preconditions.",
    "highExpression": "Practicing forgiveness and learning from mistakes. Deep knowing that every moment, including memory, holds potential for healing and transformation. Guiding others to break painful patterns from the past.",
    "lowExpression": "Being afraid to repeat mistakes from the past and using those mistakes as a reason not to move forward. Internal resistance to mistakes prevents transformation, learning, and growth.",
    "affirmations": [
      "Healing is always possible",
      "I help others break unhealthy patterns of the past",
      "I can lead a horse to water but cannot make them drink"
    ],
    "description": "Gate of memory remembering patterns for living that successfully provided for material needs. Memory is integral and consistently trustworthy part of survival intelligence as species. Instinctually alert in every moment for correct spontaneous relationship or interaction.",
    "image": "/images/human-design/gates/gate-44.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-45",
    "type": "hd-gate",
    "name": "Gate 45: The Money Steward",
    "symbol": "45",
    "gateNumber": 45,
    "iChingHexagram": 45,
    "iChingName": "The Gatherer",
    "centerId": "throat-center",
    "channelGateId": "gate-21",
    "tropicalSignId": "gemini",
    "degreeStart": 71.25,
    "degreeEnd": 76.875,
    "geneKeyId": "gk-45",
    "keywords": [
      "leadership",
      "money",
      "wellbeing",
      "and the distribution of resources"
    ],
    "coreTheme": "Leading through education.",
    "hdDefinition": "The natural and generally beneficial attraction of like forces.",
    "highExpression": "Leadership through money and wellbeing. Mastering managing, using, and distributing material resources (especially money) in service to family, friends, and community. Fully aware of both spiritual and mundane power that money holds and wielding it with equity.",
    "lowExpression": "Hoarding money or resources. Trying to knock others down so that you may rise up. Unconsciously staying broke in attempt to prove spiritual worthiness.",
    "affirmations": [
      "I easily manage material resources",
      "When everyone's needs are met – including my own – the whole kingdom thrives",
      "The mundane and the spiritual are one and the same"
    ],
    "description": "Gate of dominance, gate of Master/Mistress or King/Queen. Single voice of Tribe saying \"I have\" and deeply possessive gate of manifestation and action. Here to protect Tribe's material resources as natural authority and guide.",
    "image": "/images/human-design/gates/gate-45.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-46",
    "type": "hd-gate",
    "name": "Gate 46: The Embodiment Master",
    "symbol": "46",
    "gateNumber": 46,
    "iChingHexagram": 46,
    "iChingName": "The Gate of Determination of the Self",
    "centerId": "g-center",
    "channelGateId": "gate-29",
    "tropicalSignId": "virgo",
    "degreeStart": 159.5,
    "degreeEnd": 165.125,
    "geneKeyId": "gk-46",
    "keywords": [
      "body love",
      "reveling in life",
      "bliss",
      "and embodiment"
    ],
    "coreTheme": "Love of the body and the determination to follow through.",
    "hdDefinition": "Good fortune that may be perceived as the result of serendipity but derives from effort and dedication.",
    "highExpression": "Enjoying being alive in human body, knowing every part of life is opportunity for Divine Grace, cultivating presence and delighting in synchronicity",
    "lowExpression": "Creating chaos by avoiding present moment, taking life too seriously, buffering with substances, spiritual bypassing, materialism or ego",
    "affirmations": [],
    "description": "Focused on quality of life experienced in physical body. Expresses love of body and sensual honoring of it as temple where always in right place at right time. Lives good fortune and discovery of serendipity through determination of higher self. The embodiment master enjoying the human body.",
    "image": "/images/human-design/gates/gate-46.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-47",
    "type": "hd-gate",
    "name": "Gate 47: The A-Ha Moment Master￼",
    "symbol": "47",
    "gateNumber": 47,
    "iChingHexagram": 47,
    "iChingName": "Realization",
    "centerId": "ajna-center",
    "channelGateId": "gate-64",
    "tropicalSignId": "virgo",
    "degreeStart": 150,
    "degreeEnd": 155.625,
    "geneKeyId": "gk-47",
    "keywords": [
      "insights",
      "realizations",
      "a-ha moments",
      "and waiting for clarity"
    ],
    "coreTheme": "Fear of futility",
    "hdDefinition": "A restrictive and adverse state as a result of internal weakness or external strength or both.",
    "highExpression": "Trusting divine timing of a-ha moments and clarity, knowing you are not your thoughts but pure consciousness, letting thoughts come and go like clouds",
    "lowExpression": "Obsessing about thoughts and attaching meaning to them, becoming attached to finding the a-ha moment, feeling hopeless and mental anguish",
    "affirmations": [],
    "description": "If Gate 64 remembers disorganized collection of film clips, Gate 47 is editor attempting to assemble them into meaningful slice of human experience. Will not see full picture immediately as tentatively start sorting through collection of images. The a-ha moment master trusting divine timing of insights.",
    "image": "/images/human-design/gates/gate-47.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-48",
    "type": "hd-gate",
    "name": "Gate 48: The Wisdom Well",
    "symbol": "48",
    "gateNumber": 48,
    "iChingHexagram": 48,
    "iChingName": "Depth",
    "centerId": "spleen-center",
    "channelGateId": "gate-16",
    "tropicalSignId": "libra",
    "degreeStart": 170.75,
    "degreeEnd": 176.375,
    "geneKeyId": "gk-48",
    "keywords": [
      "being wise",
      "having depth",
      "embodiment",
      "and understanding being human"
    ],
    "coreTheme": "Fear of inadequacy.",
    "hdDefinition": "The necessary and qualitative foundation that is a prerequisite to establish the common good.",
    "highExpression": "Profound wisdom that serves collective understanding",
    "lowExpression": "Chronic inadequacy or superficial knowledge seeking",
    "affirmations": [],
    "description": "Provides potent awareness rooted in deep instinctual memory, giving potential depth to bring logic's real and workable solutions to problems of society. More than anything, wants to express and share depth to help others.",
    "image": "/images/human-design/gates/gate-48.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-49",
    "type": "hd-gate",
    "name": "Gate 49: The Revolution Ringleader",
    "symbol": "49",
    "gateNumber": 49,
    "iChingHexagram": 49,
    "iChingName": "Principles",
    "centerId": "emotional solar plexus-center",
    "channelGateId": "gate-19",
    "tropicalSignId": "aquarius",
    "degreeStart": 285.125,
    "degreeEnd": 290.75,
    "geneKeyId": "gk-49",
    "keywords": [
      "transformation",
      "being a leader in relationships",
      "and being revolutionary"
    ],
    "coreTheme": "Fear of Nature.",
    "hdDefinition": "Ideally the transformation of forms based on the highest principles and not simply for power.",
    "highExpression": "Leading people through rocky times. Deeply understanding that flow is natural state of all energy and having emotional sense of when it's time for change, renewal, and revolution.",
    "lowExpression": "Believing there is a right way and wrong way to do life. Becoming rigid and settling for nothing less than perfect. Ruthlessly cutting people out of life when they don't live up to perfect standards.",
    "affirmations": [
      "I take the lead during rocky times",
      "I am a revolutionary",
      "My principles lead the way"
    ],
    "description": "Principles of acceptance and rejection, marriage and divorce, ultimately revolution are direct result of living with Tribal hierarchies influenced by emotional wave. Places you at top of hierarchies so feel need to be obeyed.",
    "image": "/images/human-design/gates/gate-49.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-50",
    "type": "hd-gate",
    "name": "Gate 50: The Tuning Fork￼",
    "symbol": "50",
    "gateNumber": 50,
    "iChingHexagram": 50,
    "iChingName": "Values",
    "centerId": "spleen-center",
    "channelGateId": "gate-27",
    "tropicalSignId": "libra/scorpio",
    "degreeStart": 206.367,
    "degreeEnd": 212,
    "geneKeyId": "gk-50",
    "keywords": [
      "values",
      "harmony",
      "and collective empowerment"
    ],
    "coreTheme": "Fear of responsibility.",
    "hdDefinition": "The value of historical continuity whose traditional values serve and enrich the present and the future.",
    "highExpression": "Harmonizing group vibration to frequency rooted in values and beliefs that serve everyone. Instinctive knowing that groups are only as healthy as each member and easily spotting fears that corrupt a group.",
    "lowExpression": "Staying in groups despite sensing their corrupt nature. Living out of fear, anger, and poor boundaries and being easily persuaded into incorrect values and beliefs by unhealthy groups.",
    "affirmations": [
      "I live according to my values",
      "I know which groups are healthy and which ones aren't",
      "I harmonize groups to a higher frequency"
    ],
    "description": "Each act of intimacy resulting in birth demands offspring be nurtured into adulthood. Mystical name is the Guardian. As Tribal lawmaker, establishes what is right or wrong. How and where rules for caring become source of moral conditioning for children.",
    "image": "/images/human-design/gates/gate-50.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-51",
    "type": "hd-gate",
    "name": "Gate 51: The Thunderbolt",
    "symbol": "51",
    "gateNumber": 51,
    "iChingHexagram": 51,
    "iChingName": "Shock",
    "centerId": "heart-center",
    "channelGateId": "gate-25",
    "tropicalSignId": "aries",
    "degreeStart": 16.875,
    "degreeEnd": 22.5,
    "geneKeyId": "gk-51",
    "keywords": [
      "shock",
      "awakening",
      "being powerful",
      "and unconditional love"
    ],
    "coreTheme": "To be first at something.",
    "hdDefinition": "The ability to respond to disorder and shock through recognition and adaptation.",
    "highExpression": "Initiating awakening through the shock of unconditional love. Having radical faith that every moment, even horrific ones, are gateways into Divine Love and using courage to pioneer new territories.",
    "lowExpression": "Using shock to hurt others or push buttons destructively. Losing faith in life and becoming agitated or traumatized by shocking experiences without integration.",
    "affirmations": [
      "I have radical faith in life",
      "Every experience in life is an opportunity to awaken",
      "I have the courage to live according to my inner guidance"
    ],
    "description": "Energy for Individual initiative backed by ego's will and courage. Embodies power to compete, driving to be one step ahead of everybody and risk going where no one has gone to find place for yourself. Uses shock as catalyst for spiritual awakening and transformation, turning life's challenges into gateways for divine love.",
    "image": "/images/human-design/gates/gate-51.png",
    "circuitType": "Individual Centering"
  },
  {
    "id": "gate-52",
    "type": "hd-gate",
    "name": "Gate 52: The Still Mountain",
    "symbol": "52",
    "gateNumber": 52,
    "iChingHexagram": 52,
    "iChingName": "Stillness",
    "centerId": "root-center",
    "channelGateId": "gate-9",
    "tropicalSignId": "cancer",
    "degreeStart": 93.867,
    "degreeEnd": 99.5,
    "geneKeyId": "gk-52",
    "keywords": [
      "stillness",
      "concentration",
      "ebbing",
      "and flowing"
    ],
    "coreTheme": "Pressure to focus and concentrate. In this context, pressure is not necessarily a problem. It’s really about acting from the amount of pressure that is correct for you.",
    "hdDefinition": "Temporary and self-imposed inaction for the benefit of assessment.",
    "highExpression": "Deep concentration and trust in timing",
    "lowExpression": "Restless movement or depressive stagnation",
    "affirmations": [],
    "description": "Energy under pressure focused on assessment and concentration. Raw power to concentrate that must wait for divine timing. Creates passive tension from Root Center that seeks outlet through Gate 9. Once finds something deeply identifies with, creates balance between pressure to move forward and power to sit still.",
    "image": "/images/human-design/gates/gate-52.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-53",
    "type": "hd-gate",
    "name": "Gate 53: The Spark of Alchemy",
    "symbol": "53",
    "gateNumber": 53,
    "iChingHexagram": 53,
    "iChingName": "The Spark of Alchemy",
    "centerId": "root-center",
    "channelGateId": "gate-42",
    "tropicalSignId": "cancer",
    "degreeStart": 101.25,
    "degreeEnd": 106.875,
    "geneKeyId": "gk-53",
    "keywords": [
      "initiating",
      "navigating new beginnings",
      "and seeing opportunities"
    ],
    "coreTheme": "pressure to start new things. In this context, pressure is not necessarily a problem. It’s really about acting from the amount of pressure that is correct for you.",
    "hdDefinition": "Development as a structured progression that is both steadfast and enduring.",
    "highExpression": "Seeing all experiences as opportunities for growth and transformation, trusting that magic swoops in to help see things through when guided by inner wisdom",
    "lowExpression": "Having too many open loops and no energy to see them through, staying in comfort zone, quitting too soon, beginning things out of scarcity",
    "affirmations": [],
    "description": "Pressure to begin cyclical process of maturation and sequence of development from birth to death. Format energy applying to all life forms as well as relationships, ideas, projects, trends, and life cycles of nations and civilizations. Carries fuel needed to begin something new. The spark of alchemy that sees all of life as an opportunity to grow.",
    "image": "/images/human-design/gates/gate-53.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-54",
    "type": "hd-gate",
    "name": "Gate 54: The Prosperity Seeker",
    "symbol": "54",
    "gateNumber": 54,
    "iChingHexagram": 54,
    "iChingName": "Drive",
    "centerId": "root-center",
    "channelGateId": "gate-32",
    "tropicalSignId": "capricorn",
    "degreeStart": 285.117,
    "degreeEnd": 290.75,
    "geneKeyId": "gk-54",
    "keywords": [
      "ambition",
      "material mastery",
      "and spiritual growth"
    ],
    "coreTheme": "Pressure to achieve, rise up, and transform. In this context, pressure is not necessarily a problem. It’s really about acting from the amount of pressure that is correct for you.",
    "hdDefinition": "Interaction in its mundane social context but also one’s mystical and cosmic relationships.",
    "highExpression": "Ambition and drive with inner knowing that all paths lead to the Divine. Empowered to master the material plane (time, money, resources) as a path to spiritual growth.",
    "lowExpression": "Blind ambition that takes you nowhere and leaves you feeling bitter. Prone to giving up too quickly when results aren't instant.",
    "affirmations": [
      "Mastering the material plane is my spiritual path",
      "I am ambitious AF",
      "I love to create prosperity for myself and others"
    ],
    "description": "Provides humanity with fuel and ambition to transform Tribe's material direction and standing among other tribes. Supplies energy for most mundane ambitions and highest spiritual aspirations that may be hidden within them. Only when mastered instincts to thrive on mundane plane is spiritual transformation possible.",
    "image": "/images/human-design/gates/gate-54.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-55",
    "type": "hd-gate",
    "name": "Gate 55: The Abundant Spirit",
    "symbol": "55",
    "gateNumber": 55,
    "iChingHexagram": 55,
    "iChingName": "Spirit",
    "centerId": "emotional solar plexus-center",
    "channelGateId": "gate-39",
    "tropicalSignId": "pisces",
    "degreeStart": 296.375,
    "degreeEnd": 302,
    "geneKeyId": "gk-55",
    "keywords": [
      "abundance",
      "faith",
      "creativity",
      "and the fruitful darkness"
    ],
    "coreTheme": "Fear of emptiness.",
    "hdDefinition": "Abundance is strictly a question of spirit.",
    "highExpression": "Embodying faith in the spirit of abundance, feeling that God is everything and Earth is a place for Divine play. Using emotions as creative fuel and finding abundance in all experiences.",
    "lowExpression": "Rejecting low emotional experiences and using them as evidence for lack and victim consciousness. Losing faith when not using emotions as creative fuel.",
    "affirmations": [
      "I am connected to the spirit of abundance",
      "Earth is a place of Divine play",
      "My moods are creative fuel and that is my abundance"
    ],
    "description": "Awareness of spirit is emotion, not concept or instinct. Abundance is function of spirit and how you perceive what you're feeling and mood you're experiencing in moment. Emotionally embodies faith in the spirit of abundance.",
    "image": "/images/human-design/gates/gate-55.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-56",
    "type": "hd-gate",
    "name": "Gate 56: The Wandering Storyteller",
    "symbol": "56",
    "gateNumber": 56,
    "iChingHexagram": 56,
    "iChingName": "Stimulation",
    "centerId": "throat-center",
    "channelGateId": "gate-11",
    "tropicalSignId": "cancer/leo",
    "degreeStart": 116.367,
    "degreeEnd": 122,
    "geneKeyId": "gk-56",
    "keywords": [
      "stimulation",
      "telling stories",
      "delight",
      "and personal empowerment"
    ],
    "coreTheme": "Stimulating storytelling.",
    "hdDefinition": "Stability through movement. The perpetuation of continuity through the linking of short term activity.",
    "highExpression": "Telling stories from many adventures, finding humor and delight in all things, knowing when to step outside comfort zone and tell better stories",
    "lowExpression": "Becoming easily distracted with shiny object syndrome, overstimulation or boredom, playing victim role, unable to let go of outdated mental stories",
    "affirmations": [],
    "description": "Where ideas are gathered together and visual memory is recollected and verbally recounted. Gate of casual historian, voice of storyteller and philosopher that says \"I believe.\" Idea is not solution or call to action but journey over time designed to stimulate formation of ideals and beliefs. The wandering storyteller sharing adventures.",
    "image": "/images/human-design/gates/gate-56.png",
    "circuitType": "Sensing (Abstract)"
  },
  {
    "id": "gate-57",
    "type": "hd-gate",
    "name": "Gate 57: The Lucid Intuitive",
    "symbol": "57",
    "gateNumber": 57,
    "iChingHexagram": 57,
    "iChingName": "Intuitive Clarity",
    "centerId": "spleen-center",
    "channelGateId": "gate-20",
    "tropicalSignId": "libra",
    "degreeStart": 176.375,
    "degreeEnd": 182,
    "geneKeyId": "gk-57",
    "keywords": [
      "intuition",
      "instinct",
      "clarity",
      "and inner knowing"
    ],
    "coreTheme": "Fear of the future.",
    "hdDefinition": "The extraordinary power of clarity.",
    "highExpression": "Trusting intuitive knowing above all else. Being highly intuitive, clairaudient, and possibly psychic. Believing everything needed to know exists in the present moment and that the body is the most trustworthy source of intuition.",
    "lowExpression": "Not trusting intuition or writing off intuitive knowing because there is nothing logical to back it up. Trusting other people's opinions or overriding intuitive wisdom with logic and mental rationalization.",
    "affirmations": [
      "I am intuitive AF",
      "I bring about spontaneous healing and miracles through my intuition",
      "I trust myself and my intuition"
    ],
    "description": "With its clarity of intuitive insight, Gate 57 has the capacity to penetrate to one's core in the now. You have a deep inner attunement to sound that is constantly alert to the vibrations coming from your physical, emotional and psychic environments. Gate of the right ear with extraordinary power of clarity.",
    "image": "/images/human-design/gates/gate-57.png",
    "circuitType": "Integration"
  },
  {
    "id": "gate-58",
    "type": "hd-gate",
    "name": "Gate 58: The Joy Junkie",
    "symbol": "58",
    "gateNumber": 58,
    "iChingHexagram": 58,
    "iChingName": "Vitality",
    "centerId": "root-center",
    "channelGateId": "gate-18",
    "tropicalSignId": "capricorn",
    "degreeStart": 245.625,
    "degreeEnd": 251.25,
    "geneKeyId": "gk-58",
    "keywords": [
      "joy",
      "transformation",
      "and potential"
    ],
    "coreTheme": "Pressure to make things better. In this context, pressure is not necessarily a problem. It’s really about acting from the amount of pressure that is correct for you.",
    "hdDefinition": "Stimulation is the key to joy.",
    "highExpression": "Contagious joy that inspires collective transformation",
    "lowExpression": "Chronic dissatisfaction or forced joy",
    "affirmations": [],
    "description": "Has ability to sense when something is weak or unhealthy. Brings joyful and compassionate audacity to challenge patterns or authorities. Shares appreciation of beauty and vitality that naturally attracts and delights others.",
    "image": "/images/human-design/gates/gate-58.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-59",
    "type": "hd-gate",
    "name": "Gate 59: The Intimacy Catalyst",
    "symbol": "59",
    "gateNumber": 59,
    "iChingHexagram": 59,
    "iChingName": "The Intimacy Catalyst",
    "centerId": "sacral-center",
    "channelGateId": "gate-6",
    "tropicalSignId": "virgo",
    "degreeStart": 146.375,
    "degreeEnd": 152,
    "geneKeyId": "gk-59",
    "keywords": [
      "vulnerability",
      "honesty",
      "and intimacy"
    ],
    "coreTheme": "The sexual energy to bond with a mate.",
    "hdDefinition": "The ability to break down barriers to achieve union.",
    "highExpression": "Being honest and vulnerable to create authentic intimacy. Breaking down barriers through genuine openness while being discerning about who has earned the right to vulnerability.",
    "lowExpression": "Avoiding vulnerability with dishonesty and lying. Using vulnerability as manipulation or sharing indiscriminately without healthy boundaries.",
    "affirmations": [
      "I create intimacy through vulnerability",
      "I initiate others into the ways of healthy and sustainable relationships",
      "I give birth to new life"
    ],
    "description": "Generates genetic strategies for sexual bonding and creating new life. Known as \"aura breaker,\" defines ways we penetrate or break through barriers to intimacy to create offspring or enter creative ventures with others. Lines describe ways humanity approaches bonding as genetic strategies singularly focused on selecting best partner for viable offspring.",
    "image": "/images/human-design/gates/gate-59.png",
    "circuitType": "Tribal Defense"
  },
  {
    "id": "gate-60",
    "type": "hd-gate",
    "name": "Gate 60: The Embodied Magician",
    "symbol": "60",
    "gateNumber": 60,
    "iChingHexagram": 60,
    "iChingName": "Acceptance",
    "centerId": "root-center",
    "channelGateId": "gate-3",
    "tropicalSignId": "capricorn/aquarius",
    "degreeStart": 296.367,
    "degreeEnd": 302,
    "geneKeyId": "gk-60",
    "keywords": [
      "magic",
      "limitation",
      "embodiment",
      "and the laws of nature"
    ],
    "coreTheme": "Pressure to transcend limitation. In this context, pressure is not necessarily a problem. It’s really about acting from the amount of pressure that is correct for you.",
    "hdDefinition": "The acceptance of limitation is the first step in transcendence.",
    "highExpression": "Flowing through life by using creativity to overcome limitations, breaking rules and creating equitable systems. Thriving with proper boundaries that allow magic and transformation to flourish.",
    "lowExpression": "Becoming victimized by laws, rules, boundaries and natural limits. Acting out when boundaries aren't clear, staying in comfort zone instead of using creativity.",
    "affirmations": [
      "I trust that limitation is the seed of creativity",
      "Magic and creativity flow through my boundaries",
      "I work with nature instead of against it"
    ],
    "description": "Creates pressure needed for pure energy to mutate into form. Root Center fuels restraint, enabling pressure to build under each possibility. Hub of all evolutionary possibilities with creative mutative process subject to pulse. Uses creativity to overcome obstacles.",
    "image": "/images/human-design/gates/gate-60.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-61",
    "type": "hd-gate",
    "name": "Gate 61: The Divine Door",
    "symbol": "61",
    "gateNumber": 61,
    "iChingHexagram": 61,
    "iChingName": "Inner Truth – Mystery",
    "centerId": "head-center",
    "channelGateId": "gate-24",
    "tropicalSignId": "capricorn",
    "degreeStart": 290.75,
    "degreeEnd": 296.367,
    "geneKeyId": "gk-61",
    "keywords": [
      "mystery",
      "seeking",
      "inner truth",
      "and mysticism"
    ],
    "coreTheme": "knowing something new, understanding the mysteries of life, and knowing the unknowable.",
    "hdDefinition": "The awareness of universal underlying principles.",
    "highExpression": "Deeply understanding that knowledge and wisdom are different, with wisdom happening when knowledge integrates into the body. Living with open heart and mind, knowing Truth is subjective.",
    "lowExpression": "Feeling pressured to answer the biggest question \"Why am I here?\" Getting lost or overwhelmed with the question of why, becoming obsessed or fanatical.",
    "affirmations": [
      "I surrender to the Divine Mystery of life",
      "I am ready to receive Divine Inspiration",
      "Truth is subjective"
    ],
    "description": "Pressure to know, unravel mystery, and inspire with unique moments of absolute recognition. Knowing moves toward deeper self-acceptance where you can embrace what distinguishes you from others. Path to discovering inner truth by reveling in mystery.",
    "image": "/images/human-design/gates/gate-61.png",
    "circuitType": "Individual Knowing"
  },
  {
    "id": "gate-62",
    "type": "hd-gate",
    "name": "Gate 62: The Esoteric Translator",
    "symbol": "62",
    "gateNumber": 62,
    "iChingHexagram": 62,
    "iChingName": "Details",
    "centerId": "throat-center",
    "channelGateId": "gate-17",
    "tropicalSignId": "cancer",
    "degreeStart": 106.875,
    "degreeEnd": 112.5,
    "geneKeyId": "gk-62",
    "keywords": [
      "piercing language",
      "clarity",
      "being a translator",
      "and the organization of ideas"
    ],
    "coreTheme": "Communicating the details and facts.",
    "hdDefinition": "Caution, patience and detail produce excellence out of limitation.",
    "highExpression": "Impeccable precision in communication and organization",
    "lowExpression": "Information obsession or communication confusion",
    "affirmations": [],
    "description": "Says \"I think.\" Designed to name, concretize, and communicate visual patterns. Selects and organizes details as facts to better understand and explain complex concepts or situations. Responsible for creation of language.",
    "image": "/images/human-design/gates/gate-62.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-63",
    "type": "hd-gate",
    "name": "Gate 63: The Discerning Questioner",
    "symbol": "63",
    "gateNumber": 63,
    "iChingHexagram": 63,
    "iChingName": "Doubt",
    "centerId": "head-center",
    "channelGateId": "gate-4",
    "tropicalSignId": "pisces",
    "degreeStart": 341.367,
    "degreeEnd": 347,
    "geneKeyId": "gk-63",
    "keywords": [
      "doubt",
      "discernment",
      "patterns",
      "and finding potential"
    ],
    "coreTheme": "Working through doubt to make sense of patterns and find a new pattern.",
    "hdDefinition": "In the spiral of life, all ends are beginnings.",
    "highExpression": "Discerning inquiry that reveals deeper truth",
    "lowExpression": "Paralyzing doubt or destructive skepticism",
    "affirmations": [],
    "description": "Suspicion or doubt is merely pressure - readiness to pay attention to and question what feels insecure until can be understood and evaluated in terms of future security. Doubt arises when senses inconsistency in existing patterns.",
    "image": "/images/human-design/gates/gate-63.png",
    "circuitType": "Collective Understanding (Logic)"
  },
  {
    "id": "gate-64",
    "type": "hd-gate",
    "name": "Gate 64: The Imagination Station",
    "symbol": "64",
    "gateNumber": 64,
    "iChingHexagram": 64,
    "iChingName": "Confusion",
    "centerId": "head-center",
    "channelGateId": "gate-47",
    "tropicalSignId": "virgo",
    "degreeStart": 146.375,
    "degreeEnd": 152,
    "geneKeyId": "gk-64",
    "keywords": [
      "your imagination and creativity",
      "confusion",
      "and illumination"
    ],
    "coreTheme": "Making sense of the past and resolving chaos and confusion.",
    "hdDefinition": "Transition, like birth, requires a determined strength for the passage through.",
    "highExpression": "Lovingly embracing confusion inherent in illumination, living in land of infinite possibilities, keeping eye on highest potential even when confused",
    "lowExpression": "Putting pressure on self to figure things out immediately, shutting down potential and possibilities, worrying about the \"how\" instead of focusing on next step",
    "affirmations": [],
    "description": "Accepting confusion as state before order is established, part of process attempting to make sense of constant flow of data recycling through mind. Pressure behind that flow, not gate that resolves confusion. Mind filled with disconnected memories and images from past. The imagination station using creativity to transcend confusion.",
    "image": "/images/human-design/gates/gate-64.png",
    "circuitType": "Sensing (Abstract)"
  }
]