[
  {
    "id": "hd-type-generator",
    "type": "hd-type",
    "name": "Generator",
    "symbol": "G",
    "description": "Generators are the life force of the planet, representing approximately 37% of the population. They have a defined Sacral Center, which gives them consistent access to life force energy for work and creation. Their aura is open and enveloping, drawing life toward them.",
    "percentage": "~37%",
    "auraType": "Open and enveloping",
    "auraDescription": "The Generator's aura is like a warm embrace that draws experiences and people toward them. It's designed to attract the right opportunities for response.",
    "strategyId": "hd-strategy-wait-to-respond",
    "signatureEmotion": "Satisfaction",
    "notSelfEmotion": "Frustration",
    "role": "To master what they love through committed response",
    "definedCenters": [
      "sacral-center"
    ],
    "keywords": [
      "Life force",
      "Response",
      "Work",
      "Mastery",
      "Satisfaction",
      "Building"
    ],
    "gifts": [
      "Sustainable life force energy for work they love",
      "Deep capacity for mastery through commitment",
      "Natural magnetism that draws opportunities",
      "Ability to know what's correct through gut response",
      "Power to sustain and build over time"
    ],
    "challenges": [
      "Initiating rather than waiting to respond",
      "Saying yes when the gut says no",
      "Quitting before achieving mastery",
      "Feeling stuck or frustrated when not responding correctly",
      "Giving away energy to things that don't light them up"
    ],
    "notSelfBehavior": "When Generators initiate rather than respond, or say yes to things their Sacral doesn't genuinely respond to, they experience frustration. This can manifest as feeling stuck, exhausted, or trapped in situations that drain rather than fulfill them.",
    "signatureBehavior": "When living correctly, Generators experience deep satisfaction in their work and life. They feel energized by what they do, experience mastery and flow, and go to bed tired but fulfilled.",
    "practicalGuidance": "Pay attention to your gut response - the 'uh-huh' (yes) and 'uhn-uhn' (no) sounds. Wait for something in your environment to respond to before taking action. Notice what lights you up and what drains you.",
    "famousExamples": [
      "Albert Einstein",
      "Dalai Lama",
      "Mozart",
      "Elvis Presley"
    ],
    "deconditioningJourney": "For Generators, deconditioning is the slow unlearning of a lifetime of initiating. The early phase (months 1-12) is uncomfortable — the mind insists on going out and 'making things happen' and does not easily yield. The middle phase (years 2-4) brings genuine response experiences: opportunities that arrive and produce a clear Sacral 'yes' feel qualitatively different from what was forced. The later phase (years 5-7) is somatic consolidation — the gut response becomes audible before the mind translates it. The body learns to wait. Full deconditioning is not intellectual acceptance of the strategy; it is the body's nervous system resetting toward magnetism rather than initiation.",
    "auraMechanism": "The Generator's aura is open and enveloping — it draws life toward it. Ra taught that this is not metaphor but a mechanical function: the Generator's field literally attracts the right things to respond to. Initiating breaks this function. Waiting keeps the aura's magnetism active.",
    "enteringCorrectlyGuidance": "A Generator who enters a job, relationship, or project through a genuine Sacral response carries sustainable energy from the first moment. A Generator who enters by initiating — by 'making it happen' through mental planning — carries a conditioning burden from the start that becomes harder to resolve over time.",
    "raQuote": "The mind of the Generator will always want to initiate. It will always come up with reasons why you should go for something. That's conditioning. Wait.",
    "experimentInstruction": "For 90 days: before taking any significant action, pause and ask your Sacral a yes/no question about it. Notice the gut response — the 'uh-huh' or 'uhn-uhn' — before the mind speaks. Track: What did you initiate anyway? What did you respond to? Compare the quality of energy in each category.",
    "vperPhase": "Execute"
  },
  {
    "id": "hd-type-manifesting-generator",
    "type": "hd-type",
    "name": "Manifesting Generator",
    "symbol": "MG",
    "description": "Manifesting Generators combine the sustainable energy of Generators with a connection to the Throat Center that allows them to initiate and manifest. They make up about 33% of the population. They are multi-passionate beings designed to move quickly and efficiently.",
    "percentage": "~33%",
    "auraType": "Open and enveloping",
    "auraDescription": "Like pure Generators, MGs have an open, enveloping aura that draws life toward them. However, their connection to manifestation adds a dynamic quality that can move energy more quickly.",
    "strategyId": "hd-strategy-wait-to-respond",
    "signatureEmotion": "Satisfaction",
    "notSelfEmotion": "Frustration and Anger",
    "role": "To find shortcuts and efficient paths while mastering multiple passions",
    "definedCenters": [
      "sacral-center"
    ],
    "keywords": [
      "Multi-passionate",
      "Speed",
      "Efficiency",
      "Response",
      "Shortcuts",
      "Energy"
    ],
    "gifts": [
      "Ability to do multiple things simultaneously",
      "Finding faster, more efficient ways to accomplish goals",
      "Sustainable energy combined with manifestation power",
      "Quick learning and adaptation",
      "Natural ability to skip unnecessary steps"
    ],
    "challenges": [
      "Skipping steps that are actually necessary",
      "Starting many things without completing them",
      "Moving too fast for others to follow",
      "Impatience with slower processes",
      "Not informing others before taking action"
    ],
    "notSelfBehavior": "When MGs initiate without responding, or fail to inform others of their actions, they experience both frustration and anger. They may feel trapped, misunderstood, or constantly starting over.",
    "signatureBehavior": "When living correctly, MGs experience satisfaction through efficiently pursuing multiple passions. They find joy in the dance of responding, informing, and then acting on what lights them up.",
    "practicalGuidance": "Wait to respond like a Generator, but also inform others before you act (like a Manifestor). Embrace your multi-passionate nature - you don't have to choose just one thing. Trust your ability to skip steps, but verify with your Sacral response.",
    "famousExamples": [
      "Angelina Jolie",
      "Jimi Hendrix",
      "Marie Curie",
      "Clint Eastwood"
    ],
    "deconditioningJourney": "For Manifesting Generators, deconditioning involves two concurrent processes: learning to respond before acting (Generator layer) and learning to inform before moving fast (Manifestor layer). The early phase struggles with the multi-passionate nature — the MG starts many things without finishing and feels guilty. The middle phase discovers that Sacral response plus informing produces a different quality of outcome — less resistance, more sustainable momentum. The later phase integrates the MG's natural skip-step genius with the authority of response: not every step, but the right steps, at the right pace.",
    "auraMechanism": "The MG's aura is open and enveloping like the Generator's, but with a dynamic quality that moves energy faster. The aura's function is to attract AND to catalyze — it draws opportunities and then accelerates through them. The aura needs both response AND informing to function correctly: response activates the magnetic field, informing clears the path.",
    "enteringCorrectlyGuidance": "An MG who enters correctly — Sacral response followed by informing those who will be affected — enters with both life force and cleared resistance. An MG who enters by initiating and skipping the inform step enters into a field of accumulated resistance that compounds with each new step.",
    "raQuote": "The Manifesting Generator is a hybrid. They need to respond first, then inform. In that order. Always.",
    "experimentInstruction": "For 90 days: before starting anything new, ask two questions in sequence. First: is there a Sacral 'yes'? Second: who needs to know before I move? Practice the inform step even when it feels unnecessary. Track: what changed in how others respond to your initiatives?",
    "vperPhase": "Execute"
  },
  {
    "id": "hd-type-projector",
    "type": "hd-type",
    "name": "Projector",
    "symbol": "P",
    "description": "Projectors are the guides and advisors of humanity, making up about 20% of the population. They have no consistent access to Sacral energy, making them non-energy types. Their genius lies in understanding and guiding others' energy rather than doing the work themselves.",
    "percentage": "~20%",
    "auraType": "Focused and absorbing",
    "auraDescription": "The Projector's aura is penetrating and focused, designed to see deeply into others. It can feel intense to those being 'seen' but offers profound insight and recognition.",
    "strategyId": "hd-strategy-wait-for-invitation",
    "signatureEmotion": "Success",
    "notSelfEmotion": "Bitterness",
    "role": "To guide and direct the energy of others when recognized and invited",
    "definedCenters": [],
    "keywords": [
      "Guide",
      "Recognition",
      "Invitation",
      "Wisdom",
      "Efficiency",
      "Seeing"
    ],
    "gifts": [
      "Deep capacity to see and understand others",
      "Natural wisdom about systems and efficiency",
      "Ability to guide energy for optimal results",
      "Insight into the talents and potential of others",
      "Mastery through studying rather than doing"
    ],
    "challenges": [
      "Giving advice without being invited",
      "Working like a Generator and burning out",
      "Not being recognized for their gifts",
      "Bitterness when contributions aren't valued",
      "Over-identifying with what they absorb from others"
    ],
    "notSelfBehavior": "When Projectors push their guidance on others without invitation, or try to work like Generators, they become bitter. They may feel unseen, unappreciated, and exhausted from trying to prove their value.",
    "signatureBehavior": "When living correctly, Projectors experience success - being recognized, invited, and valued for their guidance. They feel fulfilled when their insights make a difference and their wisdom is appreciated.",
    "practicalGuidance": "Study what fascinates you and become an expert. Wait for recognition and invitation before offering guidance, especially in big life areas (career, relationships, where to live). Rest frequently and don't try to keep up with Generator energy.",
    "famousExamples": [
      "Barack Obama",
      "Princess Diana",
      "Marilyn Monroe",
      "Nelson Mandela"
    ],
    "deconditioningJourney": "For Projectors, deconditioning is the gradual release of the need to push. The early phase is often the most painful — Projectors who have been working like Generators arrive at burnout before deconditioning begins. Stopping is itself the first act of deconditioning. The middle phase involves learning the felt difference between genuine invitation and polite acknowledgment — only the former carries sustainable energy. The later phase cultivates the study and mastery that makes recognition and invitation natural: the Projector becomes so fluent in what they see that the right people inevitably seek them out.",
    "auraMechanism": "The Projector's aura is focused and penetrating — it sees into others deeply. Ra described it as a laser compared to the Generator's floodlight. This aura is not designed to work on its own; it is designed to be recognized by others and then used to guide their energy. Without recognition, the Projector's aura is simply penetrating — and that can feel threatening rather than inviting.",
    "enteringCorrectlyGuidance": "A Projector who enters a career role, relationship, or community through a genuine invitation that recognizes their specific capacities enters with their aura supported. A Projector who pushes into a situation without invitation enters into an energetic environment that does not sustain them — leading to bitterness no matter how good their guidance.",
    "raQuote": "Do not accept anything less than an invitation. Understand that whatever is going to fulfill you, whether it's the work you do or the love you have, whatever it may be, it must come from invitation.",
    "experimentInstruction": "For 90 days: in the areas of career, relationship, and where you live — offer nothing without a clear invitation. Study your one true interest deeply. When bitterness arises, treat it as information: something was attempted without proper recognition. Track: what invitations arrived when you stopped reaching?",
    "vperPhase": "Plan"
  },
  {
    "id": "hd-type-manifestor",
    "type": "hd-type",
    "name": "Manifestor",
    "symbol": "M",
    "description": "Manifestors are the initiators of humanity, making up only about 8% of the population. They have a defined Throat Center with a motor connection, giving them the unique ability to initiate and make things happen independently. They are designed to have impact.",
    "percentage": "~8%",
    "auraType": "Closed and repelling",
    "auraDescription": "The Manifestor's aura is closed and can feel pushing or repelling to others. This is not personal - it's designed to give them the space and independence they need to initiate.",
    "strategyId": "hd-strategy-inform",
    "signatureEmotion": "Peace",
    "notSelfEmotion": "Anger",
    "role": "To initiate and have impact while informing those affected",
    "definedCenters": [
      "throat-center"
    ],
    "keywords": [
      "Initiation",
      "Impact",
      "Independence",
      "Informing",
      "Peace",
      "Power"
    ],
    "gifts": [
      "Ability to initiate and start new things",
      "Natural capacity to have impact",
      "Independence and self-sufficiency",
      "Power to catalyze change",
      "Freedom to act on creative urges"
    ],
    "challenges": [
      "Feeling controlled or constrained by others",
      "Forgetting to inform and facing resistance",
      "Being perceived as angry or intimidating",
      "Struggling with collaboration and teamwork",
      "Managing the impact they have on others"
    ],
    "notSelfBehavior": "When Manifestors don't inform others before acting, they encounter resistance and anger. They may feel controlled, trapped, or constantly in conflict with those around them.",
    "signatureBehavior": "When living correctly, Manifestors experience peace. They inform those who will be impacted, receive the space they need, and feel the freedom to initiate and create impact.",
    "practicalGuidance": "Inform others before you act - not asking permission, but letting them know what you're going to do. This simple practice eliminates most of the resistance you encounter. Honor your need for independence and alone time.",
    "famousExamples": [
      "Maya Angelou",
      "Johnny Depp",
      "George W. Bush",
      "Adolf Hitler"
    ],
    "deconditioningJourney": "For Manifestors, deconditioning is not about slowing down but about releasing the anger that comes from constant resistance. The early phase involves recognizing the anger — often masked as impatience, indignation, or a sense of being controlled. The middle phase is learning to inform: not asking permission, but reducing friction. The experience of being given space rather than meeting resistance is often startling for Manifestors accustomed to fighting. The later phase is peace — the Manifestor discovers that informing paradoxically creates more freedom, not less.",
    "auraMechanism": "The Manifestor's aura is closed and repelling — it creates a bubble of independence. Ra explained this is not a flaw but the mechanism by which Manifestors get the space they need to initiate. The repelling quality is what others feel as the Manifestor's intensity or unapproachability. Informing is the key that opens the closed aura enough to let action move through without triggering defensive resistance in others.",
    "enteringCorrectlyGuidance": "A Manifestor who enters a new project or relationship by informing those who will be affected enters with the path cleared. A Manifestor who enters by simply acting — without informing — immediately generates resistance that must be managed for the entire arc of that engagement.",
    "raQuote": "Inform before you act — not to ask permission, but to let others know. The more you inform, the more freedom you'll actually experience.",
    "experimentInstruction": "For 90 days: before every significant action, identify who will be affected and tell them what you are going to do — not what you might do, but what you are going to do. Track: how does resistance change? Notice the quality of peace when you have informed versus the quality of anger when you have not.",
    "vperPhase": "Vision"
  },
  {
    "id": "hd-type-reflector",
    "type": "hd-type",
    "name": "Reflector",
    "symbol": "R",
    "description": "Reflectors are the rarest type, making up only about 1% of the population. They have no defined centers, making them completely open to conditioning and deeply connected to the lunar cycle. They are the mirrors of society, sampling and reflecting the health of their communities.",
    "percentage": "~1%",
    "auraType": "Resistant and sampling",
    "auraDescription": "The Reflector's aura is resistant and sampling - it takes in and reflects the energy around them while maintaining a protective quality. They taste everything but are not defined by anything.",
    "strategyId": "hd-strategy-lunar-cycle",
    "signatureEmotion": "Surprise",
    "notSelfEmotion": "Disappointment",
    "role": "To mirror and evaluate the health of their community",
    "definedCenters": [],
    "keywords": [
      "Mirror",
      "Lunar cycle",
      "Surprise",
      "Community",
      "Reflection",
      "Evaluation"
    ],
    "gifts": [
      "Ability to sample and reflect all energies",
      "Deep wisdom about community health",
      "Objectivity and fairness in evaluation",
      "Sensitivity to environment and people",
      "Potential for profound wisdom about human nature"
    ],
    "challenges": [
      "Not knowing who they truly are",
      "Taking in unhealthy environments",
      "Making decisions too quickly",
      "Identifying with conditioning rather than their true nature",
      "Finding the right community and environment"
    ],
    "notSelfBehavior": "When Reflectors make decisions too quickly or live in unhealthy environments, they experience deep disappointment. They may feel invisible, lost, or like they don't belong anywhere.",
    "signatureBehavior": "When living correctly, Reflectors experience surprise - the wonder and delight of life's variety. They feel valued as wise evaluators and enjoy the ever-changing nature of their experience.",
    "practicalGuidance": "Wait a full lunar cycle (28-29 days) for major decisions. Pay close attention to your environment - you need to be around healthy people and places. Find trusted others to talk through decisions with over time. Honor your need to be different each day.",
    "famousExamples": [
      "Sandra Bullock",
      "Fyodor Dostoevsky",
      "H.G. Wells",
      "Ammachi"
    ],
    "deconditioningJourney": "For Reflectors, deconditioning is the slowest of all types — appropriately, since the lunar cycle is their natural rhythm. The early phase is identity confusion: with no defined centers, the Reflector has been whatever the environment made them. The middle phase is learning to witness rather than identify — noticing 'this is not me; this is what I am sampling' across the day's energy shifts. The later phase is the discovery of the Reflector's true consistency: not in their definition (they have none) but in their unique way of sampling, reflecting, and evaluating. The deconditioning milestone is the first major decision made after a full lunar cycle — and the quality difference between that decision and a rushed one.",
    "auraMechanism": "The Reflector's aura is resistant and sampling — it tastes everything but is not absorbed by anything. Ra described it as protective: the sampling quality keeps Reflectors from being permanently conditioned by any one energy, but only if the aura is not overwhelmed by long-term immersion in unhealthy environments. The aura requires healthy environments the way a measuring instrument requires calibration conditions.",
    "enteringCorrectlyGuidance": "A Reflector who enters a situation — especially a living environment, community, or partnership — after a full lunar cycle of sensing into it enters with genuine clarity about whether this environment is healthy for their sampling function. A Reflector who enters quickly, driven by excitement or pressure, inherits whatever that environment amplifies — including its pathologies.",
    "raQuote": "The Reflector is the mirror of the health of the collective. They sample everything. The only question is: what is worth sampling?",
    "experimentInstruction": "For 90 days: before any major decision — career, relationship, living situation — give yourself a minimum of 29 days. Talk about the decision with at least five different people throughout. Track how your feeling about the decision changes across the cycle. Notice: is there a stable thread beneath the changes, or do you feel differently each time?",
    "vperPhase": "Review"
  }
]
