[
  {
    "id": "hermetic-1-mentalism",
    "type": "hermetic-principle",
    "name": "The Principle of Mentalism",
    "number": 1,
    "symbol": "∞",
    "latinName": "Mens",
    "statement": "THE ALL is MIND; The Universe is Mental.",
    "essence": "All of existence is a mental creation of infinite consciousness. Matter, energy, and experience are thoughts vibrating at specific frequencies within the Universal Mind.",
    "element": "Air / Ether",
    "planet": "Mercury",
    "alchemicalSubstance": "Mercurius",
    "relatedChakras": ["chakra-6-third-eye", "chakra-7-crown"],
    "relatedGeneKeys": [],
    "description": "The First Principle reveals the fundamental nature of reality: consciousness precedes and underlies all manifestation. This is not idealism that denies the reality of the physical world, but a recognition that the physical world IS real — and that it is made of mind. Atoms are structured thought. Planets are archetypal ideas in cosmic mind. The natal chart maps the configuration of mind operative at the birth moment.",
    "shadow": {
      "expression": "Using this principle to bypass embodied reality — 'it's all in the mind' as a way to avoid the weight, sensation, and demands of physical existence. Mental abstraction that loses contact with earth. The spiritual narcissism of believing one's thoughts create reality in the sense that wishes manifest immediately."
    },
    "gift": {
      "expression": "The direct recognition that inner work is real work — that shifting the quality of mind has measurable consequences in lived experience. The liberation from purely mechanical cause-and-effect: because everything is mental, consciousness can participate in, influence, and co-create with the patterns it perceives."
    },
    "siddhi": {
      "expression": "Direct recognition of one's own nature as the Universal Mind itself — not a fragment of it, but the whole expressing through this particular aperture. The personal mind dissolves into the cosmic Mind, and individual thinking becomes transparent to universal knowing."
    },
    "practice": "Meditation on the quality of mind you are bringing to any situation. Ask: what is the mental atmosphere through which I am perceiving this experience? How would a different quality of mind encounter the same situation?",
    "astrologyApplication": "The natal chart is a map of the MIND's configuration. Signs show how the mind naturally moves (fire=intuitive, earth=practical, air=conceptual, water=feeling). Houses show where mental attention habitually focuses. Planets are archetypes of mind.",
    "geneKeysApplication": "The three frequencies (Shadow/Gift/Siddhi) are states of consciousness — different qualities of mind generating different life experiences. Shifting frequency literally means shifting the quality of the mind that encounters reality.",
    "contemplativeQuestion": "What is the quality of mind you are inhabiting right now? If everything you perceive is arising within consciousness, what does that suggest about your current experience?",
    "keywords": ["consciousness", "mind", "thought", "perception", "mental", "awareness", "creation", "reality", "universal mind"]
  },
  {
    "id": "hermetic-2-correspondence",
    "type": "hermetic-principle",
    "name": "The Principle of Correspondence",
    "number": 2,
    "symbol": "⊕",
    "latinName": "Analogia",
    "statement": "As above, so below; as below, so above; as within, so without; as without, so within.",
    "essence": "All planes of existence mirror each other. The structure of the atom reflects the structure of the solar system. Inner states manifest as outer circumstances. The celestial reflects the terrestrial.",
    "element": "All elements",
    "planet": "Sun / Moon",
    "alchemicalSubstance": "Sal (the integrating medium)",
    "relatedChakras": ["chakra-4-heart", "chakra-6-third-eye"],
    "relatedGeneKeys": [],
    "description": "The Second Principle is the metaphysical foundation of astrology, Human Design, and all systems of correspondence. There is an isomorphic relationship between different levels of reality — not because one causes the other, but because all levels are expressions of the same underlying patterns. To change something on one level of reality is to participate in change on all levels.",
    "shadow": {
      "expression": "Using correspondence mechanically: 'my outer life is messy therefore I am messy.' Weaponizing the principle as self-criticism or judgment of others. Losing the nuance that correspondence is not identity — outer circumstances may reflect inner states without being simple one-to-one translations."
    },
    "gift": {
      "expression": "The capacity to read the outer world as a message from the inner — and the inner as a message about the outer. The ability to work with symbols, archetypes, and correspondences as real information. Every circumstance becomes an opportunity for insight. The natal chart becomes a living mirror."
    },
    "siddhi": {
      "expression": "All apparent separation between above and below, within and without, collapses. One perceives directly the unity that correspondence points toward — not two realms reflecting each other, but a single reality expressing itself simultaneously at all scales."
    },
    "practice": "When facing a challenging external situation, ask: what inner state might this be corresponding to? Conversely, when doing inner work, notice what outer shifts seem to echo the inner movement.",
    "astrologyApplication": "This principle IS astrology. The movements of planets above correspond to human experience below — not through physical causation but through synchronistic correspondence of pattern. The birth chart holds the below-correspondence of the cosmos-above at the birth moment.",
    "geneKeysApplication": "The Gene Keys work through correspondence: the body's biochemistry (codon rings, amino acids) corresponds to psychological frequencies (shadow/gift/siddhi), which correspond to life circumstances. Transformation at any level corresponds to shifts at all levels.",
    "contemplativeQuestion": "What external situation is corresponding to something happening in your inner life? What are the circumstances of your life currently reflecting back to you?",
    "keywords": ["correspondence", "reflection", "mirror", "pattern", "analogy", "synchrony", "as above so below", "inner outer", "fractal"]
  },
  {
    "id": "hermetic-3-vibration",
    "type": "hermetic-principle",
    "name": "The Principle of Vibration",
    "number": 3,
    "symbol": "〜",
    "latinName": "Vibratio",
    "statement": "Nothing rests; everything moves; everything vibrates.",
    "essence": "All matter, energy, and consciousness exists in constant motion at varying frequencies. The difference between different forms of existence is their rate of vibration. Consciousness can intentionally shift its vibrational frequency.",
    "element": "Fire",
    "planet": "Mercury / Uranus",
    "alchemicalSubstance": "Mercurius",
    "relatedChakras": ["chakra-3-solar-plexus", "chakra-5-throat"],
    "relatedGeneKeys": [],
    "description": "The Third Principle reveals that reality is not static but dynamic at every level. The rock vibrates; the thought vibrates; the galaxy vibrates. The difference between a lead and gold (in alchemical terms) is vibrational frequency. The difference between the shadow frequency of a Gene Key and its siddhi is vibration. This principle transforms the spiritual path from moral effort into vibrational attunement.",
    "shadow": {
      "expression": "Using 'high vibe only' spirituality to bypass difficult emotions and shadow work. The toxic positivity trap: if everything is vibration, then 'negative' emotions must be kept away. This misunderstands the principle — lower frequencies are not wrong, they are information. Bypassing them creates deeper stagnation."
    },
    "gift": {
      "expression": "The recognition that transformation is possible at any moment because what feels solid (a belief, a pattern, a physical symptom) is actually a vibration that can shift. Working with sound, music, breath, movement, and contemplation as genuine technologies of transformation because they directly alter vibrational state."
    },
    "siddhi": {
      "expression": "Perception of the vibrational nature of all existence becomes direct and immediate — one perceives the dance of frequencies that constitutes reality, and one's own presence as a vibrational force that participates in that dance. The body becomes an instrument consciously attuned to the cosmic orchestra."
    },
    "practice": "Notice the vibrational quality of your current state — in the body, in the emotions, in the quality of thought. Without judgment, simply observe and name the frequency. Then gently invite a shift — through breath, sound, movement, or a shift in where attention rests.",
    "astrologyApplication": "Planetary transits are vibrational events — the meeting of cosmic frequencies with personal frequencies at specific moments in time. Some transits harmonize (trine, sextile) with natal frequencies; some challenge (square, opposition). All carry vibrational information.",
    "geneKeysApplication": "The path from Shadow to Gift to Siddhi is the central vibrational journey of Gene Keys work. The shadow frequency is not wrong — it is the same genetic potential at a lower vibration. Contemplation is a vibrational technology.",
    "contemplativeQuestion": "What is the vibrational frequency of the atmosphere you are creating in your daily life? If your dominant mental and emotional state were a musical note, what would it sound like right now?",
    "keywords": ["vibration", "frequency", "movement", "resonance", "attunement", "sound", "harmony", "transformation", "oscillation"]
  },
  {
    "id": "hermetic-4-polarity",
    "type": "hermetic-principle",
    "name": "The Principle of Polarity",
    "number": 4,
    "symbol": "⊃",
    "latinName": "Polaritas",
    "statement": "Everything is Dual; everything has poles; everything has its pair of opposites; like and unlike are the same; opposites are identical in nature, but different in degree.",
    "essence": "All manifestation exists on a spectrum between two poles. Apparent opposites are not separate things but degrees of the same underlying principle. The practical art: transmuting one pole toward the other through consciousness.",
    "element": "Air",
    "planet": "Venus / Mars",
    "alchemicalSubstance": "Sulphur-Sal tension",
    "relatedChakras": ["chakra-4-heart", "chakra-1-root"],
    "relatedGeneKeys": [],
    "description": "The Fourth Principle dissolves the dualistic framing of good/evil, love/hate, strength/weakness. These are not opposites but poles of the same principle — varying degrees along a single spectrum. Hot and cold are degrees of temperature. Fear and courage are degrees of the same survival energy. Love and hate are degrees of the same intensity of care. This transforms how we relate to shadow: it is not the enemy of the gift but the same energy at a lower frequency.",
    "shadow": {
      "expression": "Using polarity to justify remaining at the lower pole: 'if everything has two poles, then the negative is just as valid as the positive.' True, but this misses the practical art: the Hermeticist learns to consciously move along the spectrum, not to stay fixed at either pole."
    },
    "gift": {
      "expression": "The capacity to recognize one's own shadow as the gift at a lower frequency — not to eliminate it but to raise it. The compassion that comes from understanding that another's 'vice' is simply the underdeveloped form of a virtue. The ability to work with opposites as complementary rather than combative."
    },
    "siddhi": {
      "expression": "Direct recognition that all polarities are expressions of a single undivided reality — that the apparent opposition is itself the playful creativity of the One. Consciousness no longer gets caught at either pole but recognizes the infinite spectrum as its natural home."
    },
    "practice": "Take any quality you judge in yourself or another. Ask: what is the higher expression of this same energy? What does this pattern look like at its most refined and integrated? Then: how do I move this particular pattern along its spectrum toward its higher expression?",
    "astrologyApplication": "The 12 signs exist in 6 polar pairs (Aries/Libra, Taurus/Scorpio, etc.). Planets in opposition are not enemies but in conversation about the same principle from opposite ends. Understanding polarity in the chart transforms how we read challenges — they are not defeats but invitations to integrate the opposite pole.",
    "geneKeysApplication": "The Shadow and the Siddhi of each Gene Key are poles of the same underlying genetic potential. The 'repressive' and 'reactive' shadows are opposite poles of the same shadow. The gift is the midpoint of integration. The contemplative path moves consciously along this spectrum.",
    "contemplativeQuestion": "What is a quality you consider a weakness or shadow in yourself? What would the highest expression of that same energy look like? How far are you from that higher expression, and what would help you move toward it?",
    "keywords": ["polarity", "duality", "spectrum", "opposites", "integration", "shadow", "transmutation", "balance", "complementarity"]
  },
  {
    "id": "hermetic-5-rhythm",
    "type": "hermetic-principle",
    "name": "The Principle of Rhythm",
    "number": 5,
    "symbol": "↕",
    "latinName": "Rhythmus",
    "statement": "Everything flows, out and in; everything has its tides; all things rise and fall; the pendulum-swing manifests in everything; the measure of the swing to the right is the measure of the swing to the left; rhythm compensates.",
    "essence": "All movement is rhythmic. Expansion follows contraction; light follows dark; activity follows rest. Understanding the current phase of a cycle changes its meaning entirely.",
    "element": "Water",
    "planet": "Moon / Saturn",
    "alchemicalSubstance": "Mercurius (the flowing medium)",
    "relatedChakras": ["chakra-2-sacral", "chakra-5-throat"],
    "relatedGeneKeys": [],
    "description": "The Fifth Principle is one of the most practically liberating: nothing is permanently fixed in its current state because all states are part of rhythmic cycles. The difficulty that feels permanent is a tide that will turn. The joy that feels permanent is part of a cycle that will ebb. Understanding this brings both patience with difficulty and savoring of joy. Astrology is the science of cosmic rhythms; the natal chart shows an individual's natural rhythmic pattern.",
    "shadow": {
      "expression": "Using the principle of rhythm as spiritual bypass: 'this too shall pass' as a way to avoid fully feeling current experience. Or conversely, becoming so attached to tracking cycles that one loses presence. The excessive astrologer who cannot make a decision without checking the planetary weather."
    },
    "gift": {
      "expression": "The capacity to navigate cycles with grace — to rest in the inward tide without despair, to act in the outward tide without compulsion. The understanding that 'fallow periods' are as necessary as 'harvest periods.' Timing wisdom: knowing when to push and when to yield."
    },
    "siddhi": {
      "expression": "Recognition of oneself as the rhythm itself — not an entity being moved by cycles but the rhythmic pulsation of existence experiencing itself. Equanimity: not because nothing moves but because one has become the movement. The dance, not the dancer."
    },
    "practice": "Notice where you are in the natural rhythms of your life: Is this an inward or outward phase? A time of gathering or of giving? A season of building or of releasing? Honor the current phase rather than forcing the opposite.",
    "astrologyApplication": "Planetary cycles ARE Rhythm made visible. Saturn returns (28-30 years) mark the great life rhythms. Jupiter cycles (12 years) mark expansion rhythms. Lunar phases mark monthly rhythms. Understanding your current position in multiple overlapping cycles radically changes the meaning of present experience.",
    "geneKeysApplication": "The Gene Keys sequences (Activation, Venus, Pearl, Core) are rhythmic journeys — the contemplative path does not happen all at once but unfolds in its own time and rhythm. The codon rings describe biological rhythms. Working with Gene Keys requires patience with the rhythm of transformation.",
    "contemplativeQuestion": "What phase of a larger cycle are you currently in? Is this a time of expansion or consolidation, of beginning or completing, of action or integration? What does this phase ask of you?",
    "keywords": ["rhythm", "cycle", "tides", "seasons", "timing", "phases", "flow", "ebb", "patience", "natural law"]
  },
  {
    "id": "hermetic-6-cause-effect",
    "type": "hermetic-principle",
    "name": "The Principle of Cause and Effect",
    "number": 6,
    "symbol": "→",
    "latinName": "Causalitas",
    "statement": "Every Cause has its Effect; every Effect has its Cause; everything happens according to Law; Chance is but a name for Law not recognized.",
    "essence": "Nothing happens by accident. Every effect can be traced to a cause; every cause produces effects. Consciousness, when it understands this, can participate causally rather than being subject to effects of unconscious causes.",
    "element": "Earth",
    "planet": "Saturn",
    "alchemicalSubstance": "Sulphur (directed will as cause)",
    "relatedChakras": ["chakra-3-solar-plexus", "chakra-1-root"],
    "relatedGeneKeys": [],
    "description": "The Sixth Principle transforms victimhood into agency — not through blame ('you caused this') but through recognition ('this effect points to a cause I can work with'). What appears as coincidence or fate is simply cause-and-effect operating through levels we have not yet perceived. This is the principle behind karma: patterns established in the past produce present effects; choices made in the present establish future causes.",
    "shadow": {
      "expression": "The pathological application: hyper-causality that removes mystery from experience. Or: using 'I caused this' as self-blame for circumstances that genuinely were externally caused. The principle requires discernment — not everything is one's personal creation. Some causes are collective, ancestral, or environmental."
    },
    "gift": {
      "expression": "Genuine personal agency: understanding that the quality of consciousness one brings to situations is a real causal force. The capacity to trace current patterns back to their originating beliefs or choices, and to make different choices that will produce different effects. Responsibility without guilt."
    },
    "siddhi": {
      "expression": "Recognition of oneself as both cause and effect simultaneously — as the wave that is also the ocean, the thought that is also the thinker. Action arises from pure being rather than from a chain of prior causes, and effects arise without generating new causal chains. Complete freedom within total law."
    },
    "practice": "When experiencing an unwanted pattern, trace backward: what causes might be generating this effect? Look at beliefs, habitual responses, recurring choices. Then ask: what new cause do I want to put into motion? What is the quality of consciousness I want to embody — because THAT is the most fundamental cause I can influence.",
    "astrologyApplication": "The natal chart shows the causal moment (birth) whose effects unfold through life. Planetary transits show current causal environments. Working skillfully with transits means participating in the causal stream rather than being swept along by it.",
    "geneKeysApplication": "The shadows we carry are causal frequencies. A shadow frequency in Gene Key 1 (Entropy) generates specific life effects — creative stagnation, a particular quality of relationship, a certain recurring life theme. Shifting the frequency shifts the causal input and therefore the experiential output.",
    "contemplativeQuestion": "What effects in your current life are you ready to trace to their causes? What quality of consciousness have you been habitually bringing that might be generating outcomes you don't want — and what cause would you need to embody to generate different effects?",
    "keywords": ["causality", "effect", "responsibility", "agency", "karma", "choice", "consequence", "pattern", "law", "accountability"]
  },
  {
    "id": "hermetic-7-gender",
    "type": "hermetic-principle",
    "name": "The Principle of Gender",
    "number": 7,
    "symbol": "⚤",
    "latinName": "Genus",
    "statement": "Gender is in everything; everything has its Masculine and Feminine Principles; Gender manifests on all planes.",
    "essence": "All of creation contains both generative (Masculine) and receptive (Feminine) aspects. These are not biological categories but universal principles present in all things. Full expression requires the integration and creative play of both.",
    "element": "Fire / Water",
    "planet": "Sun / Moon",
    "alchemicalSubstance": "Sulphur (Masculine) / Mercurius (Feminine) — united in Sal",
    "relatedChakras": ["chakra-2-sacral", "chakra-4-heart"],
    "relatedGeneKeys": [],
    "description": "The Seventh Principle completes the system by revealing the fundamental creative dynamic: the interplay of generative and receptive principles that produces all manifestation. This is the cosmic sexuality underlying all creation. The Masculine principle penetrates, initiates, and directs. The Feminine principle receives, nurtures, and gestates. All human beings carry both principles, and integration of both — regardless of biological gender — is the path of wholeness.",
    "shadow": {
      "expression": "Gender imbalance: over-identification with one principle at the expense of the other. Excessive Masculine expression: constant action without receptivity, the inability to rest or receive. Excessive Feminine expression: endless receptivity without direction, the inability to initiate or act. Both extremes are shadows of the same principle."
    },
    "gift": {
      "expression": "The conscious integration of both principles creates true generativity: ideas that are both inspired (Masculine: the penetrating insight) and gestated (Feminine: the patient development). Creative power that draws on both initiation and receptivity in their appropriate moments. Relationships understood as the meeting of these principles within and between people."
    },
    "siddhi": {
      "expression": "The complete androgyny of the mystic — not the elimination of either principle but their perfect union. One becomes a complete creative being whose generative and receptive capacities are in such harmony that creation flows effortlessly. The sacred marriage within."
    },
    "practice": "Notice which principle tends to dominate in your approach to life. Are you primarily initiating (Masculine) or receiving (Feminine)? When does the undervalued principle want to emerge? Practice consciously invoking the less-dominant principle in areas where you feel stuck.",
    "astrologyApplication": "The Sun represents the Masculine principle of conscious direction and identity; the Moon represents the Feminine principle of receptivity and soul-needs. The interplay of Sun and Moon in the natal chart shows how these principles are woven together in the individual.",
    "geneKeysApplication": "The repressive shadow (unexpressed, contracted) corresponds to blocked Feminine principle (unwilling to receive the full experience of the shadow). The reactive shadow (explosive, uncontrolled) corresponds to undirected Masculine principle (force without wisdom). The Gift integrates both.",
    "contemplativeQuestion": "Where in your life is the Masculine principle (directed action, initiation, will) needed? Where is the Feminine principle (receptivity, patience, allowing) needed? Where have you been forcing when you should be allowing, or waiting when you should be acting?",
    "keywords": ["masculine", "feminine", "balance", "integration", "sacred marriage", "generative", "receptive", "creativity", "polarity", "androgyny"]
  }
]
