[
  {
    "id": "line-1",
    "type": "line",
    "name": "Line 1 - The Investigator",
    "symbol": "1",
    "lineNumber": 1,
    "archetype": "The Investigator",
    "trigram": "Lower",
    "trigramPosition": "Bottom",
    "keywords": [
      "Foundation",
      "Research",
      "Introspection",
      "Security",
      "Deep study",
      "Authority"
    ],
    "summary": "Line 1 is the foundation line, representing the need to investigate, research, and build a solid base of knowledge before moving forward. Those with Line 1 energy have an innate need to understand things deeply to feel secure.",
    "chakraResonance": "Root",
    "elementalExpression": "Earth",
    "signPair": { "active": "Aries", "receptive": "Taurus" },
    "evolutionaryProcess": {
      "shadow": "Fear-driven research loop — compulsive study used as avoidance of moving forward",
      "gift": "Mastery through preparation — the quiet confidence of knowing what you stand on",
      "theme": "From anxious research into grounded expertise and authority"
    },
    "ancestralIntegration": {
      "wound": "Ancestors who survived through secrecy or paid dearly for being caught unprepared",
      "remedy": "Share your research freely — let knowledge build bridges rather than walls"
    },
    "emotionalImprint": {
      "defensePattern": "Retreating into study to avoid exposure before feeling fully ready",
      "loveLanguage": "Being seen as thorough, competent, and reliable"
    },
    "innerGrounding": {
      "coreNeed": "Solid foundation before action — time to research, prepare, and root in knowledge",
      "whenDenied": "Anxiety, paralysis, and the persistent feeling of never knowing enough"
    },
    "communicationGuardian": "The careful curator — shares only when certainty is established, ensuring every word is anchored in substance",
    "expansionDriving": "Growth through depth over breadth — the call to become the trusted authority whose foundation cannot be shaken",
    "geneKeys": {
      "theme": "Foundation & Research",
      "description": "In Gene Keys, Line 1 brings a contemplative, research-oriented quality to any Gene Key it touches. The journey begins with introspection and building understanding from the ground up.",
      "gift": "The Gift of Line 1 is the capacity for deep research and laying solid foundations. When operating at the Gift frequency, Line 1 brings thoroughness, reliability, and the ability to create security through knowledge.",
      "shadow": "At the Shadow frequency, Line 1 can manifest as excessive insecurity, over-research to the point of never acting, and a tendency to become lost in details rather than trusting intuition.",
      "contemplationTheme": "What foundation am I building? What do I need to understand more deeply before I can move forward?",
      "practicalGuidance": "Take time to research and understand before acting. Build security through knowledge. Trust that a solid foundation will support all future growth."
    },
    "humanDesign": {
      "theme": "Foundation and Security",
      "description": "In Human Design, Line 1 represents the need to investigate, research, and build a solid base of knowledge. Those with Line 1 energy are the researchers and investigators of life.",
      "gifts": [
        "Deep capacity for research and investigation",
        "Natural ability to build solid foundations",
        "Thorough understanding through study",
        "Security through knowledge",
        "Ability to become an authority through expertise"
      ],
      "challenges": [
        "Insecurity when lacking sufficient knowledge",
        "Tendency to over-research before acting",
        "Fear of being caught unprepared",
        "Can become isolated in their studies"
      ],
      "inPersonality": "When Line 1 appears in the Personality (conscious), you're aware of your need to investigate and research. You consciously seek knowledge and understanding, and feel secure when you've done your homework.",
      "inDesign": "When Line 1 appears in the Design (unconscious), this investigative quality operates beneath your awareness. Others may see you as thorough and well-researched even when you don't recognize this in yourself.",
      "healthyExpression": "The healthy Line 1 has done their research and stands on a solid foundation of knowledge. They feel secure in their understanding and can share their expertise with confidence.",
      "unhealthyExpression": "The unhealthy Line 1 is perpetually insecure, always feeling they need to know more before they can act."
    },
    "profiles": [
      "1/3",
      "1/4",
      "4/1",
      "5/1"
    ],
    "relatedLineId": "line-4",
    "harmonyDescription": "Line 1 forms a natural harmony with Line 4 - the foundation-builder and the networker/externalizer."
  },
  {
    "id": "line-2",
    "type": "line",
    "name": "Line 2 - The Hermit",
    "symbol": "2",
    "lineNumber": 2,
    "archetype": "The Hermit",
    "trigram": "Lower",
    "trigramPosition": "Middle",
    "keywords": [
      "Natural talent",
      "Calling",
      "Solitude",
      "Projection",
      "Being called out",
      "Shyness"
    ],
    "summary": "Line 2 represents natural, innate talent that often operates unconsciously. Those with Line 2 energy have gifts they may not recognize in themselves, and they require being 'called out' by others to share these talents.",
    "chakraResonance": "Sacral",
    "elementalExpression": "Water",
    "signPair": { "active": "Gemini", "receptive": "Cancer" },
    "evolutionaryProcess": {
      "shadow": "Hiding natural gifts behind solitude — refusing the right calling out of shyness or self-doubt",
      "gift": "Effortless genius expressed naturally when the correct invitation arrives",
      "theme": "From self-protective withdrawal to being found and recognized for natural gifts"
    },
    "ancestralIntegration": {
      "wound": "Ancestors who suppressed their natural gifts to fit in, stay safe, or avoid standing out",
      "remedy": "Trust that your natural talents are enough — let yourself be called rather than pushing"
    },
    "emotionalImprint": {
      "defensePattern": "Retreating further into solitude when called in ways that feel wrong or overwhelming",
      "loveLanguage": "Being seen and called for exactly who you are, without performance or pressure"
    },
    "innerGrounding": {
      "coreNeed": "Uninterrupted solitude to develop intrinsic gifts on your own rhythm",
      "whenDenied": "Resentment of external demands, depletion, and loss of the natural spontaneity that is your gift"
    },
    "communicationGuardian": "The natural transmitter — speaks only when authentically called, and when it speaks, illuminates with effortless clarity",
    "expansionDriving": "Growth through being recognized and invited by the right others — expansion happens through authentic calling, not self-promotion",
    "geneKeys": {
      "theme": "Natural Gifts & Calling",
      "description": "In Gene Keys, Line 2 brings a quality of effortless talent and the paradox of needing to be called out by others to recognize one's own gifts.",
      "gift": "The Gift of Line 2 is natural, unstudied talent. When operating at the Gift frequency, Line 2 brings an ease and grace to the Gene Key's expression, often appearing effortless to others.",
      "shadow": "At the Shadow frequency, Line 2 can manifest as shyness, withdrawal, fear of being seen, or conversely, projection of one's gifts onto others while denying them in oneself.",
      "contemplationTheme": "What natural gifts do I possess that I may not fully recognize? Who is calling me to share my talents?",
      "practicalGuidance": "Allow yourself periods of solitude to develop your natural talents. Be open to being called out by life. Trust that your gifts will be recognized when the time is right."
    },
    "humanDesign": {
      "theme": "Natural Talent and Being Called Out",
      "description": "In Human Design, Line 2 represents natural, innate talent that often operates unconsciously. Those with Line 2 energy have gifts they may not recognize, requiring being 'called out' by others to share them.",
      "gifts": [
        "Natural, innate talents that come easily",
        "Ability to do things without formal training",
        "Gifts that others recognize and call forth",
        "Need for solitude that nurtures creativity",
        "Selective engagement preserves energy"
      ],
      "challenges": [
        "May not recognize their own talents",
        "Can resist being called out",
        "Struggle with unwanted projections from others",
        "May hide gifts out of shyness or resistance",
        "Can become too isolated"
      ],
      "inPersonality": "When Line 2 appears in the Personality (conscious), you're aware of your need for alone time and may resist being called out. You might feel shy about your talents even as others project their needs onto you.",
      "inDesign": "When Line 2 appears in the Design (unconscious), your natural talents operate beneath your awareness. Others see gifts in you that you may not recognize.",
      "healthyExpression": "The healthy Line 2 honors their need for solitude while remaining open to being called out for the right opportunities.",
      "unhealthyExpression": "The unhealthy Line 2 either hides completely from the world or answers every call, regardless of whether it's correct for them."
    },
    "profiles": [
      "2/4",
      "2/5",
      "5/2",
      "6/2"
    ],
    "relatedLineId": "line-5",
    "harmonyDescription": "Line 2 forms a natural harmony with Line 5 - the hermit with natural gifts and the heretic who universalizes."
  },
  {
    "id": "line-3",
    "type": "line",
    "name": "Line 3 - The Martyr",
    "symbol": "3",
    "lineNumber": 3,
    "archetype": "The Martyr",
    "trigram": "Lower",
    "trigramPosition": "Top",
    "keywords": [
      "Trial and error",
      "Experience",
      "Adaptation",
      "Resilience",
      "Discovery",
      "Learning through mistakes"
    ],
    "summary": "Line 3 is the line of experiential learning, where wisdom comes through direct engagement with life and learning from mistakes. What others might call 'mistakes' are actually valuable data points for Line 3.",
    "chakraResonance": "Solar Plexus",
    "elementalExpression": "Fire",
    "signPair": { "active": "Leo", "receptive": "Virgo" },
    "evolutionaryProcess": {
      "shadow": "Shame about the trial-and-error process — each correction mistaken for failure or proof of unworthiness",
      "gift": "Embodied wisdom earned through direct experience — the teacher who has lived what they teach",
      "theme": "Transforming trial and error into the authority of lived mastery"
    },
    "ancestralIntegration": {
      "wound": "Ancestors who were punished for mistakes or who carried shame around imperfection and failure",
      "remedy": "Reframe every correction as curriculum — your bonds of experience are the greatest gift you carry"
    },
    "emotionalImprint": {
      "defensePattern": "Volatility and self-criticism when the experimental process produces disruption or broken bonds",
      "loveLanguage": "Being accepted and valued despite imperfection — seen as a pioneer, not a failure"
    },
    "innerGrounding": {
      "coreNeed": "Permission to experiment without judgment — safety to fail, adjust, and try again without shame",
      "whenDenied": "Self-blame, destructive relationships, and a tendency to burn down what has just been built"
    },
    "communicationGuardian": "The embodied witness — communicates most powerfully through lived experience, never through untested theory",
    "expansionDriving": "Growth through bonds of experience — what endures has been tested; resilience and adaptability are the expansion",
    "geneKeys": {
      "theme": "Trial & Error Learning",
      "description": "In Gene Keys, Line 3 brings a quality of adaptability and the courage to learn through experience. The path of transformation involves hands-on learning and possible mistakes.",
      "gift": "The Gift of Line 3 is adaptability and the wisdom gained through direct experience. When operating at the Gift frequency, Line 3 brings resilience, practical knowledge, and the ability to share lessons learned.",
      "shadow": "At the Shadow frequency, Line 3 can manifest as repeated mistakes without learning, martyrdom, pessimism, or being stuck in patterns of self-sabotage.",
      "contemplationTheme": "What am I learning through my experiences? How can I transform my mistakes into wisdom?",
      "practicalGuidance": "Embrace your experiences, including mistakes, as essential to your growth. Share the wisdom you've gained through trial and error. Trust the process of experiential learning."
    },
    "humanDesign": {
      "theme": "Trial and Error, Experiential Learning",
      "description": "In Human Design, Line 3 represents learning through direct experience—trial and error. Those with Line 3 energy are here to discover what works and what doesn't through hands-on experimentation.",
      "gifts": [
        "Resilience through experiential learning",
        "Ability to discover what truly works",
        "Adaptability born from diverse experiences",
        "Wisdom gained through direct engagement",
        "Natural experimenters and innovators"
      ],
      "challenges": [
        "May be labeled as making 'mistakes'",
        "Can feel like life is a series of failures",
        "Bonds frequently made and broken",
        "Material and relational instability",
        "Self-judgment about their experimental nature"
      ],
      "inPersonality": "When Line 3 appears in the Personality (conscious), you're aware of your experimental nature. You know you learn by doing.",
      "inDesign": "When Line 3 appears in the Design (unconscious), you may not realize how much you learn through experience. Life seems to put you through trials.",
      "healthyExpression": "The healthy Line 3 has made peace with their experimental nature. They understand that 'mistakes' are discoveries.",
      "unhealthyExpression": "The unhealthy Line 3 judges themselves harshly for their trials, feeling like a perpetual failure."
    },
    "profiles": [
      "1/3",
      "3/5",
      "3/6",
      "6/3"
    ],
    "relatedLineId": "line-6",
    "harmonyDescription": "Line 3 forms a natural harmony with Line 6 - the experiential learner and the eventual role model who has integrated those experiences."
  },
  {
    "id": "line-4",
    "type": "line",
    "name": "Line 4 - The Opportunist",
    "symbol": "4",
    "lineNumber": 4,
    "archetype": "The Opportunist",
    "trigram": "Upper",
    "trigramPosition": "Bottom",
    "keywords": [
      "Network",
      "Community",
      "Opportunity",
      "Influence",
      "Friendship",
      "Externalization"
    ],
    "summary": "Line 4 marks the transition from the lower (personal) trigram to the upper (transpersonal) trigram. Those with Line 4 energy are designed to externalize and share, working through their network of relationships.",
    "chakraResonance": "Heart",
    "elementalExpression": "Air",
    "signPair": { "active": "Libra", "receptive": "Scorpio" },
    "evolutionaryProcess": {
      "shadow": "Strategic networking for security — connection used as survival mechanism rather than genuine relating",
      "gift": "Genuine influence through authentic relationship — the trusted friend who opens doors",
      "theme": "From networking for safety into influencing through real relatedness"
    },
    "ancestralIntegration": {
      "wound": "Ancestors who survived through social positioning, strategic alliances, or betrayal of intimate bonds",
      "remedy": "Invest deeply in your foundation people — let genuine friendship replace strategic connection"
    },
    "emotionalImprint": {
      "defensePattern": "Carefully managing relationships to prevent abandonment or rejection from the network",
      "loveLanguage": "Loyal, consistent presence within a close circle of deeply trusted allies"
    },
    "innerGrounding": {
      "coreNeed": "A stable foundation of trusted relationships — a few deep bonds over many surface connections",
      "whenDenied": "Social anxiety, over-extension, and exhaustion from maintaining too many connections at once"
    },
    "communicationGuardian": "The networked bridge — carries ideas between trusted circles, translating vision into relational reality",
    "expansionDriving": "Growth through networks of trust — opportunities arise naturally through relationship, not through solitary effort",
    "geneKeys": {
      "theme": "Network & Relationships",
      "description": "In Gene Keys, Line 4 brings a quality of social intelligence and the ability to influence through personal bonds. Transformation occurs through connections with others.",
      "gift": "The Gift of Line 4 is the capacity to build meaningful relationships and create opportunities through network. When operating at the Gift frequency, Line 4 brings friendship, influence, and beneficial presence in community.",
      "shadow": "At the Shadow frequency, Line 4 can manifest as manipulation, over-dependency on others, fear of being alone, or using relationships for personal gain.",
      "contemplationTheme": "How do my relationships support my growth? What opportunities are emerging through my network?",
      "practicalGuidance": "Cultivate genuine friendships and meaningful connections. Allow opportunities to arise naturally through your network. Be generous with your influence and resources."
    },
    "humanDesign": {
      "theme": "Network and Influence",
      "description": "In Human Design, Line 4 represents the transition from personal to transpersonal. Those with Line 4 energy are designed to externalize and share, working through their network. Opportunities come through who they know.",
      "gifts": [
        "Strong network of meaningful relationships",
        "Opportunities come through connections",
        "Natural ability to influence others",
        "Provides foundation and stability for others",
        "Bridge between personal and collective"
      ],
      "challenges": [
        "Dependency on network for opportunities",
        "Can be devastated by friendship loss",
        "May struggle with 'cold' networking",
        "Need for close bonds can limit expansion",
        "Can become stuck in wrong networks"
      ],
      "inPersonality": "When Line 4 appears in the Personality (conscious), you're aware of how important your network is. You consciously cultivate relationships.",
      "inDesign": "When Line 4 appears in the Design (unconscious), your networking operates beneath your awareness. You naturally attract connections.",
      "healthyExpression": "The healthy Line 4 has cultivated a network of genuine friendships. Opportunities flow naturally through these relationships.",
      "unhealthyExpression": "The unhealthy Line 4 either clings desperately to their network or isolates themselves when hurt."
    },
    "profiles": [
      "1/4",
      "2/4",
      "4/6",
      "4/1"
    ],
    "relatedLineId": "line-1",
    "harmonyDescription": "Line 4 forms a natural harmony with Line 1 - the networker/externalizer and the foundation-builder."
  },
  {
    "id": "line-5",
    "type": "line",
    "name": "Line 5 - The Heretic",
    "symbol": "5",
    "lineNumber": 5,
    "archetype": "The Heretic",
    "trigram": "Upper",
    "trigramPosition": "Middle",
    "keywords": [
      "Universal",
      "Projection field",
      "Practical solutions",
      "Savior",
      "Leadership",
      "Reputation"
    ],
    "summary": "Line 5 carries the strongest projection field of all lines. Others project their hopes and expectations onto Line 5, seeing them as potential saviors or problem-solvers. They have the capacity to deliver practical, universal solutions.",
    "chakraResonance": "Throat",
    "elementalExpression": "Ether",
    "signPair": { "active": "Sagittarius", "receptive": "Capricorn" },
    "evolutionaryProcess": {
      "shadow": "Living as a projection screen — identity collapsed into what others need you to be",
      "gift": "Universal love expressed through fearless truth-telling — the practical mystic who transforms systems",
      "theme": "From carrying others' projections to embodying your own universal truth"
    },
    "ancestralIntegration": {
      "wound": "Ancestors who were persecuted, silenced, or punished for speaking truth to power or challenging existing structures",
      "remedy": "Speak your universal truth without needing approval — what feels like heresy may be exactly the medicine needed"
    },
    "emotionalImprint": {
      "defensePattern": "Withholding authentic self-expression to manage how others project onto you and protect your reputation",
      "loveLanguage": "Being seen beyond the projection — known for who you actually are, not the role others require you to fill"
    },
    "innerGrounding": {
      "coreNeed": "Periodic withdrawal from projection fields to reconnect with authentic self before returning to serve",
      "whenDenied": "Identity dissolution — living as a mirror for others rather than as your own sovereign self"
    },
    "communicationGuardian": "The universal broadcaster — speaks to the many; the message must be both universal in scope and practically applicable",
    "expansionDriving": "Growth through becoming a practical solution to universal challenges — impact through the transformation of existing systems",
    "geneKeys": {
      "theme": "Universalization & Projection",
      "description": "In Gene Keys, Line 5 brings the capacity to deliver practical solutions that benefit the collective, while navigating the projections placed upon it.",
      "gift": "The Gift of Line 5 is the ability to offer universal solutions and practical wisdom that benefits many. When operating at the Gift frequency, Line 5 brings leadership, practical genius, and the capacity to meet collective needs.",
      "shadow": "At the Shadow frequency, Line 5 can manifest as savior complex, paranoia about projections, running from responsibility, or failing to meet expectations.",
      "contemplationTheme": "What practical solutions am I called to offer? How can I serve the collective through my unique gifts?",
      "practicalGuidance": "Accept the projections placed on you as part of your path. Deliver practical, universal solutions. Remember that your reputation is built on meeting real needs."
    },
    "humanDesign": {
      "theme": "Projection and Practical Solutions",
      "description": "In Human Design, Line 5 carries the strongest projection field. Others project their hopes and expectations, seeing them as potential saviors. When Line 5 delivers, they're celebrated; when they don't meet projections, they can be vilified.",
      "gifts": [
        "Natural ability to provide practical solutions",
        "Charisma and attractive projection field",
        "Capacity to influence and lead",
        "Can see universal applications",
        "Ability to meet collective needs"
      ],
      "challenges": [
        "Heavy burden of others' projections",
        "Reputation can be damaged if projections aren't met",
        "May be vilified when they don't 'save' others",
        "Paranoia about what others think",
        "Must manage expectations carefully"
      ],
      "inPersonality": "When Line 5 appears in the Personality (conscious), you're aware of the projections others place on you. You may feel the pressure to be a savior.",
      "inDesign": "When Line 5 appears in the Design (unconscious), you may not realize how much others project onto you. You attract expectations without understanding why.",
      "healthyExpression": "The healthy Line 5 understands the projection field and chooses carefully when to step into the role of problem-solver.",
      "unhealthyExpression": "The unhealthy Line 5 either tries to meet every projection (burning out) or becomes paranoid about reputation."
    },
    "profiles": [
      "2/5",
      "3/5",
      "5/1",
      "5/2"
    ],
    "relatedLineId": "line-2",
    "harmonyDescription": "Line 5 forms a natural harmony with Line 2 - the heretic who universalizes and the hermit with natural gifts."
  },
  {
    "id": "line-6",
    "type": "line",
    "name": "Line 6 - The Role Model",
    "symbol": "6",
    "lineNumber": 6,
    "archetype": "The Role Model",
    "trigram": "Upper",
    "trigramPosition": "Top",
    "keywords": [
      "Role model",
      "Objectivity",
      "Three-part life process",
      "Wisdom",
      "Leadership",
      "Trust"
    ],
    "summary": "Line 6 represents the culmination of the hexagram and operates through a unique three-part life process. They are designed to become wise leaders through experience, eventually stepping into the role of trusted guide.",
    "chakraResonance": "Third Eye",
    "elementalExpression": "Spirit",
    "signPair": { "active": "Aquarius", "receptive": "Pisces" },
    "evolutionaryProcess": {
      "shadow": "Premature disillusionment during the trial phase — cynicism about life's meaning used as a form of protection",
      "gift": "Living embodiment of earned wisdom — the elder who demonstrates rather than teaches",
      "theme": "Three-phase arc from trial through retreat into emergence as authentic living example"
    },
    "ancestralIntegration": {
      "wound": "Ancestors who never completed their arc — who remained in disillusionment or who performed wisdom without living it",
      "remedy": "Honor your three phases — your emergence in the third chapter is the gift to the next generation"
    },
    "emotionalImprint": {
      "defensePattern": "Holding life at an objective distance — using overview as protection from the vulnerability of engagement",
      "loveLanguage": "Being witnessed in the fullness of your arc — including the early failures and the roof period that shaped you"
    },
    "innerGrounding": {
      "coreNeed": "Patience with your own unfolding — trust that the three-phase arc has its own timing that cannot be rushed",
      "whenDenied": "Premature settling, resignation, or a life lived at the level of other people's expectations rather than your own destiny"
    },
    "communicationGuardian": "The living transmission — teaches without teaching; others learn by witnessing the life, not the lessons extracted from it",
    "expansionDriving": "Growth through living the full arc — the legacy is the life itself, not the achievements or knowledge accumulated along the way",
    "geneKeys": {
      "theme": "Transition & Integration",
      "description": "In Gene Keys, Line 6 brings a quality of overview, objectivity, and the potential to serve as a living example. The journey moves from initial trial, through retreat and contemplation, to eventual emergence as a living example.",
      "gift": "The Gift of Line 6 is the capacity to embody wisdom and serve as a role model for others. When operating at the Gift frequency, Line 6 brings objectivity, trust, and the ability to inspire through authentic living.",
      "shadow": "At the Shadow frequency, Line 6 can manifest as aloofness, disconnection from practical life, disillusionment, or an inability to commit to anything.",
      "contemplationTheme": "What phase of integration am I in? How can I embody the wisdom I have gained?",
      "practicalGuidance": "Trust the three phases of your journey: engagement, retreat, and emergence. Maintain objectivity while staying connected to life. Allow yourself to become a living example of integrated wisdom."
    },
    "humanDesign": {
      "theme": "Three-Part Life Process and Objectivity",
      "description": "In Human Design, Line 6 operates through a unique three-part life process: trial and error (like Line 3) until around age 30, then withdrawal 'onto the roof' for observation until around 50, then stepping into the role model phase.",
      "gifts": [
        "Unique three-part life journey brings wisdom",
        "Objectivity from 'roof' observation period",
        "Natural role models and leaders",
        "Trustworthy through lived experience",
        "Can see the big picture"
      ],
      "challenges": [
        "First 30 years can feel chaotic (Line 3 process)",
        "May feel disconnected during 'roof' period",
        "Pressure to be a perfect role model",
        "Can become too aloof or detached",
        "Waiting for the third phase can be frustrating"
      ],
      "inPersonality": "When Line 6 appears in the Personality (conscious), you're aware of your three-part life process. You may consciously observe from the 'roof'.",
      "inDesign": "When Line 6 appears in the Design (unconscious), the three-part process operates without your conscious awareness.",
      "healthyExpression": "The healthy Line 6 has moved through their process with grace, emerging as an authentic role model.",
      "unhealthyExpression": "The unhealthy Line 6 either never gets on the roof (staying in perpetual chaos) or refuses to come down."
    },
    "lifePhases": {
      "phase1": {
        "name": "Trial Phase",
        "ageRange": "Birth to ~30",
        "description": "A period of experiential learning similar to Line 3, where wisdom is gained through direct engagement with life."
      },
      "phase2": {
        "name": "On the Roof",
        "ageRange": "~30 to ~50",
        "description": "A period of withdrawal and observation. Gaining objectivity and perspective on life from a detached vantage point."
      },
      "phase3": {
        "name": "Role Model",
        "ageRange": "~50 onwards",
        "description": "Stepping off the roof into embodied wisdom. Becoming a trusted role model and guide for others."
      }
    },
    "profiles": [
      "3/6",
      "4/6",
      "6/2",
      "6/3"
    ],
    "relatedLineId": "line-3",
    "harmonyDescription": "Line 6 forms a natural harmony with Line 3 - the role model who has integrated experiences and the experiential learner."
  }
]
