[
  {
    "id": "heaven",
    "type": "trigram",
    "name": "Heaven",
    "chineseName": "Qian",
    "symbol": "☰",
    "trigramNumber": 1,
    "lines": [
      "yang",
      "yang",
      "yang"
    ],
    "nature": "Creative",
    "attribute": "Strong",
    "direction": "Northwest",
    "season": "Late Autumn",
    "element": "Metal",
    "bodyPart": "Head",
    "familyMember": "Father",
    "animal": "Horse, Dragon",
    "keywords": [
      "Creative force",
      "Initiative",
      "Power",
      "Strength",
      "Leadership"
    ],
    "description": "Heaven represents the primal creative force - pure yang energy that initiates all action and existence. It is the archetype of the father, the sky, and divine masculine consciousness. In the Gene Keys, Heaven correlates with the creative impulse that transforms potential into manifestation.",
    "geneKeyCorrelation": "Heaven trigram appears in Gene Keys associated with creative power, leadership, and divine will. It represents the outward-moving impulse of consciousness seeking expression.",
    "upperTrigram": "When appearing as the upper trigram in a hexagram, Heaven indicates that the creative impulse is manifesting in the external world, seeking recognition and expression.",
    "lowerTrigram": "When appearing as the lower trigram, Heaven indicates inner strength and creative potential that forms the foundation for outward action."
  },
  {
    "id": "trigram-earth",
    "type": "trigram",
    "name": "Earth (Kun)",
    "chineseName": "Kun",
    "symbol": "☷",
    "trigramNumber": 2,
    "lines": [
      "yin",
      "yin",
      "yin"
    ],
    "nature": "Receptive",
    "attribute": "Yielding",
    "direction": "Southwest",
    "season": "Late Summer",
    "element": "Earth",
    "bodyPart": "Belly, Abdomen",
    "familyMember": "Mother",
    "animal": "Ox, Mare",
    "keywords": [
      "Receptivity",
      "Devotion",
      "Nurturing",
      "Support",
      "Form"
    ],
    "description": "Earth represents the primal receptive force - pure yin energy that receives, supports, and gives form to all creation. It is the archetype of the mother, the ground of being, and divine feminine consciousness. In the Gene Keys, Earth correlates with the capacity to receive, nurture, and sustain.",
    "geneKeyCorrelation": "Earth trigram appears in Gene Keys associated with receptivity, service, and devotion. It represents the inward-drawing impulse of consciousness seeking to support and nurture.",
    "upperTrigram": "When appearing as the upper trigram, Earth indicates that receptivity and service are expressed outwardly, creating supportive relationships and nurturing environments.",
    "lowerTrigram": "When appearing as the lower trigram, Earth indicates deep inner receptivity and the capacity to receive guidance and support from higher sources."
  },
  {
    "id": "thunder",
    "type": "trigram",
    "name": "Thunder",
    "chineseName": "Zhen",
    "symbol": "☳",
    "trigramNumber": 3,
    "lines": [
      "yang",
      "yin",
      "yin"
    ],
    "nature": "Arousing",
    "attribute": "Inciting Movement",
    "direction": "East",
    "season": "Spring",
    "element": "Wood",
    "bodyPart": "Feet",
    "familyMember": "Eldest Son",
    "animal": "Dragon",
    "keywords": [
      "Initiative",
      "Shock",
      "Movement",
      "Awakening",
      "Birth"
    ],
    "description": "Thunder represents the arousing force that shocks systems into new awareness. A single yang line rising beneath two yin lines symbolizes energy breaking through stillness. In the Gene Keys, Thunder correlates with sudden breakthroughs and the initiation of new cycles.",
    "geneKeyCorrelation": "Thunder trigram appears in Gene Keys associated with new beginnings, shock, and awakening. It represents the moment of breakthrough when potential suddenly becomes kinetic.",
    "upperTrigram": "When appearing as the upper trigram, Thunder indicates that arousing energy is manifesting externally, creating visible movement and change in the world.",
    "lowerTrigram": "When appearing as the lower trigram, Thunder indicates inner awakening and the initial stirrings of new energy seeking expression."
  },
  {
    "id": "trigram-water",
    "type": "trigram",
    "name": "Water (Kan)",
    "chineseName": "Kan",
    "symbol": "☵",
    "trigramNumber": 4,
    "lines": [
      "yin",
      "yang",
      "yin"
    ],
    "nature": "Abysmal",
    "attribute": "Dangerous",
    "direction": "North",
    "season": "Winter",
    "element": "Water",
    "bodyPart": "Ears",
    "familyMember": "Middle Son",
    "animal": "Pig",
    "keywords": [
      "Depth",
      "Danger",
      "Flow",
      "Soul",
      "The Unconscious"
    ],
    "description": "Water represents the abysmal depths - the dangerous yet essential journey through unknown territory. A yang line enclosed by two yin lines symbolizes light within darkness. In the Gene Keys, Water correlates with soul journey, depth psychology, and navigating the unconscious.",
    "geneKeyCorrelation": "Water trigram appears in Gene Keys associated with depth, danger, soul, and the journey through darkness. It represents the courage to face the unknown within.",
    "upperTrigram": "When appearing as the upper trigram, Water indicates that deep soul work is manifesting in relationships and external circumstances that test us.",
    "lowerTrigram": "When appearing as the lower trigram, Water indicates profound inner depth and the unconscious currents that shape our destiny."
  },
  {
    "id": "mountain",
    "type": "trigram",
    "name": "Mountain",
    "chineseName": "Gen",
    "symbol": "☶",
    "trigramNumber": 5,
    "lines": [
      "yang",
      "yin",
      "yin"
    ],
    "nature": "Keeping Still",
    "attribute": "Resting",
    "direction": "Northeast",
    "season": "Late Winter",
    "element": "Earth",
    "bodyPart": "Hands",
    "familyMember": "Youngest Son",
    "animal": "Dog",
    "keywords": [
      "Stillness",
      "Meditation",
      "Stopping",
      "Boundaries",
      "Contemplation"
    ],
    "description": "Mountain represents stillness and the wisdom of stopping at the right time. A yang line resting on two yin lines symbolizes the end of movement and the return to stillness. In the Gene Keys, Mountain correlates with meditation, contemplation, and knowing when to stop.",
    "geneKeyCorrelation": "Mountain trigram appears in Gene Keys associated with stillness, meditation, and contemplation. It represents the wisdom of stopping and the power of presence.",
    "upperTrigram": "When appearing as the upper trigram, Mountain indicates that stillness and boundaries are being established in the external world.",
    "lowerTrigram": "When appearing as the lower trigram, Mountain indicates deep inner stillness and the meditative foundation for all action."
  },
  {
    "id": "wind",
    "type": "trigram",
    "name": "Wind",
    "chineseName": "Xun",
    "symbol": "☴",
    "trigramNumber": 6,
    "lines": [
      "yin",
      "yang",
      "yang"
    ],
    "nature": "Gentle",
    "attribute": "Penetrating",
    "direction": "Southeast",
    "season": "Late Spring",
    "element": "Wood",
    "bodyPart": "Thighs",
    "familyMember": "Eldest Daughter",
    "animal": "Rooster",
    "keywords": [
      "Gentleness",
      "Penetration",
      "Influence",
      "Subtlety",
      "Growth"
    ],
    "description": "Wind represents gentle but persistent influence - the power that penetrates through subtlety rather than force. A yin line beneath two yang lines symbolizes flexibility grounded in strength. In the Gene Keys, Wind correlates with gentle influence, gradual growth, and the power of persistence.",
    "geneKeyCorrelation": "Wind trigram appears in Gene Keys associated with gentle influence and penetrating truth. It represents the power of subtle, persistent change.",
    "upperTrigram": "When appearing as the upper trigram, Wind indicates gentle influence spreading outward, creating change through subtle, persistent means.",
    "lowerTrigram": "When appearing as the lower trigram, Wind indicates inner flexibility and the capacity to adapt while remaining rooted."
  },
  {
    "id": "trigram-fire",
    "type": "trigram",
    "name": "Fire (Li)",
    "chineseName": "Li",
    "symbol": "☲",
    "trigramNumber": 7,
    "lines": [
      "yang",
      "yin",
      "yang"
    ],
    "nature": "Clinging",
    "attribute": "Light-giving",
    "direction": "South",
    "season": "Summer",
    "element": "Fire",
    "bodyPart": "Eyes",
    "familyMember": "Middle Daughter",
    "animal": "Pheasant",
    "keywords": [
      "Clarity",
      "Illumination",
      "Attachment",
      "Beauty",
      "Awareness"
    ],
    "description": "Fire represents illumination and the clinging nature of light to what it illuminates. Two yang lines with a yin line between symbolize light that depends on fuel. In the Gene Keys, Fire correlates with clarity, awareness, and the illumination of consciousness.",
    "geneKeyCorrelation": "Fire trigram appears in Gene Keys associated with clarity, beauty, and illuminated awareness. It represents the light of consciousness that reveals truth.",
    "upperTrigram": "When appearing as the upper trigram, Fire indicates that clarity and illumination are manifesting externally, bringing awareness to situations.",
    "lowerTrigram": "When appearing as the lower trigram, Fire indicates inner illumination and the clarity that comes from awakened awareness."
  },
  {
    "id": "lake",
    "type": "trigram",
    "name": "Lake",
    "chineseName": "Dui",
    "symbol": "☱",
    "trigramNumber": 8,
    "lines": [
      "yin",
      "yang",
      "yang"
    ],
    "nature": "Joyous",
    "attribute": "Pleasure-giving",
    "direction": "West",
    "season": "Autumn",
    "element": "Metal",
    "bodyPart": "Mouth",
    "familyMember": "Youngest Daughter",
    "animal": "Sheep",
    "keywords": [
      "Joy",
      "Pleasure",
      "Expression",
      "Communication",
      "Reflection"
    ],
    "description": "Lake represents joy and the pleasure of open expression. A yin line above two yang lines symbolizes openness at the surface with depth below. In the Gene Keys, Lake correlates with joy, communication, and the delight of authentic expression.",
    "geneKeyCorrelation": "Lake trigram appears in Gene Keys associated with joy, pleasure, and communication. It represents the delight of expressing one's true nature.",
    "upperTrigram": "When appearing as the upper trigram, Lake indicates that joy and authentic expression are manifesting externally through communication.",
    "lowerTrigram": "When appearing as the lower trigram, Lake indicates inner joy and the capacity for delight that forms the foundation of authentic living."
  }
]
